[
    {
        "id": "6pniev",
        "subreddit": "IDontWorkHereLady",
        "title": "Crazy Lady Thinks I Work Here",
        "script": "Yesterday at Canadian Tire, I was just trying to buy wipers for my car when a woman approached me, thinking I worked there. I moved to check the wipers, but she followed me, demanding to know why I was ignoring her. I told her the screen was for that, but she insisted I was terrible at customer service. When she threatened to speak to my manager, I decided to call my wife, who I jokingly refer to as my \"manager.\" I put her on speakerphone, and as she realized the situation, she told the woman I didn’t work there. By the end, the lady stormed off, and I left with my wipers, laughing at the whole ridiculous encounter. My wife thinks I was mean, but I say I was just fighting stupidity with a little humor.",
        "tags": [
            "unbelievable",
            "awkward",
            "twist",
            "customer service",
            "humor"
        ]
    },
    {
        "id": "c0afu1",
        "subreddit": "Bridezillas",
        "title": "Lost My Best Friend Because Of Her Wedding",
        "script": "My best friend got engaged and immediately asked me to be her bridesmaid. I was thrilled for about 0.2 seconds until she said, “Now I get to make you dress girly!” Her requirements? A dress, heels, growing my hair to bob length, dyeing it, getting a tan, and covering my tattoos with body makeup. \n\nI’m a tomboy and this was a gut wrencher. But it’s her big day, right? I offered to do everything except grow my hair. Not good enough. She said I’d ruin her photos with my short hair. Arguments ensued, and during this time, my dad was diagnosed with a terminal illness. I stepped down from being a bridesmaid to a guest.\n\nWhen she asked what my girlfriend and I would wear, I said we had tailor-made suits from a previous wedding. She flipped, saying she didn’t want everyone staring at the two lesbians in suits and that we’d take attention away from her. Gobsmacked, I told her unless she was telling all the guests what to wear, she could f*** right off.\n\nI went to the wedding to avoid being the jerk who didn’t show up. It was a grand affair, but after 8 hours, I left after the first dance to get home to my kid. The next day, I heard the bride was sobbing that I left early and texted me to say the money I gifted her was nowhere near the cost of hosting me. \n\nSo we don’t talk anymore. But guess what? I’m getting married! My fiancée proposed last week, and we’re both wearing suits. Bridezilla ain’t invited.",
        "tags": [
            "partner drama",
            "wedding drama",
            "friendship fallout",
            "twist",
            "infuriating"
        ]
    },
    {
        "id": "bxbbyu",
        "subreddit": "NuclearRevenge",
        "title": "My Grandpa Got Revenge On My Abuser",
        "script": "I grew up with a drug-addicted mother and an absent father, finding solace only with my loving grandparents. At 14, my life spiraled when I fell into an abusive relationship with a man I’ll call Goat. He isolated me for years, and after I finally escaped, he stalked and threatened me. Just before my 18th birthday, he attacked me, leaving me in the hospital. I called my grandpa for help, and for the first time, I saw him break down. He stood by me through recovery and became close with my friend who helped me escape Goat. After a family gathering, my grandpa took revenge—he tracked down Goat and shot him, leading to his arrest and later death in jail. A week after my grandpa died from cancer, I received a letter from him revealing he’d left everything to me. Now, at 21, I run the law firm he built, support my younger family members, and even started a safe house for abuse victims. I’m still healing from my past but determined to honor my grandparents by helping others.",
        "tags": [
            "revenge",
            "family drama",
            "twist",
            "heartwarming",
            "unbelievable"
        ]
    },
    {
        "id": "no8mm3",
        "subreddit": "IDontWorkHereLady",
        "title": "This Prank Got Fred Fired",
        "script": "When my wife and I moved in together, we started getting calls for a business called \"Expo for Art.\" No matter how many times we explained we weren't them, people kept calling. I finally tracked down the owner, Fred, who refused to remove my home number from his receipts, saying it was too much hassle. So, I hatched a plan. I started calling Expo for Art, pretending to be customers and giving out ridiculous prices and information. For weeks, I led people to the store claiming their orders were ready, only to have them show up to confusion and frustration. One day, Fred called me, furious about the chaos. I played innocent, reminding him that people called my number because it was on his receipts. In the end, he had no choice but to order new materials. \"Hello, Expo for Art, this is Fred.\" \"I'VE ORDERED NEW RECEIPT BOOKS AND CARDS. CAN YOU PLEASE STOP THIS BULLSHIT!?!?!?!\" \"Sure. Bye Fred!\"",
        "tags": [
            "revenge",
            "unbelievable",
            "twist",
            "justice served",
            "work drama"
        ]
    },
    {
        "id": "9unzwz",
        "subreddit": "IDontWorkHereLady",
        "title": "I Almost Got Sucked Into a Pyramid Scheme",
        "script": "Four years ago, I interviewed for a marketing position, but it turned out to be a door-to-door sales job for an MLM. We were told to lie about our pay structure, claiming we were salaried when we were actually commission-only. After my trial shift, I got another job offer and informed the MLM that I wouldn’t be joining them. \n\nFast forward to Monday morning, I get a rude awakening from a call. Where the hell are you?! Sorry, who is this? It’s your boss from the company you work for! You’re late! I don’t work for you. I took another job. You should’ve told us! It’s unprofessional to just not show up!\n\nThis continued for a week, with him calling me daily, demanding reasons for my absence. Finally, I was 'let go' for 'unauthorized' absences. When I asked if that meant he would stop calling, he told me to grow up and be professional. \n\nI think I really dodged a bullet there!",
        "tags": [
            "work drama",
            "unbelievable",
            "twist",
            "justice served",
            "infuriating"
        ]
    },
    {
        "id": "oj6fej",
        "subreddit": "Bridezillas",
        "title": "My Husband Got Us Kicked Out of the Wedding Party",
        "script": "My husband was asked to be the best man at his friend's wedding. The couple decided to wait two years to plan their dream wedding and save for an expensive honeymoon. However, the planning was a nightmare. Friends dropped out due to the bride's awful attitude and the groom's entitlement. \n\nSix months before the wedding, the groom asked about the bachelor party. My husband proposed a limo bar crawl close to home, but the next day, the bride sent a furious group text, demanding a lavish Vegas weekend for the groom, complete with a suite at Caesar’s Palace, and insisted the groomsmen cover the costs. \n\nMy husband privately told her we couldn’t afford it and suggested the bar crawl instead. But she exploded, claiming our financial issues weren’t her concern and threatened to replace him as best man. \n\nIn a moment of honesty, my husband shot back, “Why would I spend all this money? You’ll be divorced in two years.” He was kicked out of the wedding party, and we were uninvited. \n\nThe groom ended up having two bachelor parties with just two guests each. The “happy” couple filed for divorce just 23 months after the wedding.",
        "tags": [
            "wedding drama",
            "revenge",
            "relationship advice",
            "twist",
            "unbelievable"
        ]
    },
    {
        "id": "gn0j3m",
        "subreddit": "IDontWorkHereLady",
        "title": "Karen Grabbed Me In The Grocery Store",
        "script": "Last week, my husband and I were grocery shopping when I noticed an elderly lady struggling to bag her groceries. I helped her, thinking it was a simple act of kindness. Suddenly, I felt a tight grip on my arm. I turned to see an angry woman glaring at me. \"Don't be LAZY! Just do your job and help bag my groceries!\" she shouted. I was taken aback, but before I could respond, my husband—an army veteran with a serious demeanor—yanked her hand off me and yelled, \"WHO THE F*** DO YOU THINK YOU ARE? HOW DARE YOU PUT YOUR HANDS ON MY WIFE!\" The store fell silent. The woman’s face turned from angry to terrified as she shuffled away. My husband then turned to the elderly lady, apologizing for the outburst and offering to help her load her groceries. It was like he flipped a switch. Later, we were approached by the store manager who warned us about being banned for the yelling. My husband shrugged, saying they should also ban the Karen for assaulting me. We didn’t get banned, but I sure learned what happens when you mess with my husband.",
        "tags": [
            "partner drama",
            "unbelievable",
            "justice served",
            "twist",
            "infuriating"
        ]
    },
    {
        "id": "cutrk0",
        "subreddit": "Bridezillas",
        "title": "My Friend Ruined Our 20-Year Friendship",
        "script": "I've been no contact with my Bridezilla friend since her wedding. She’s been spinning tales, making me the villain for not following her ridiculous bridesmaid rules while I was dealing with my dad’s terminal illness and my son losing his best friend. As a result, I’ve been cut off from mutual friends and missed out on engagements, hen parties, and baby showers. \n\nLast weekend, my girlfriend proposed! We were over the moon and shared the news. But Bride texted our mutual friends, claiming I blocked her from seeing our engagement post and that she was hurt. So, I snapped a screenshot of her LIKE on our engagement post and sent it to everyone in the group chat, exposing her lies. I said, “Uh, no. She’s just mad someone else is getting attention.” \n\nNow, Bride won’t be invited to any wedding events. We’re off to Vegas with our families, ready to have a blast—suits and all!",
        "tags": [
            "friendship fallout",
            "wedding drama",
            "revenge",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "fnhqhe",
        "subreddit": "IDontWorkHereLady",
        "title": "I Accidentally Became A Doggy Daycare",
        "script": "I worked in an office that allowed dogs, but I was the only one without a pet. One day, a frantic woman rushed in with a massive basset hound named Otis, thinking we were a dog daycare. I was confused but took him in, enjoying my day with the chill dog. When she returned, she asked how much she owed, and I threw out a random $20. To my surprise, she came back the next week, dropping Otis off regularly! It was a dream come true until one day, she discovered our Christmas card featuring Otis. She realized we weren't a dog daycare at all! I braced for her anger, but instead, she laughed and left Otis with me again, saying, “Where else could I find someone to watch him one-on-one for $20?” Otis became my office dog until his family moved away.",
        "tags": [
            "unbelievable",
            "twist",
            "heartwarming",
            "work drama",
            "friendship fallout"
        ]
    },
    {
        "id": "atv9fz",
        "subreddit": "IDontWorkHereLady",
        "title": "The Only Way To Communicate With Karens",
        "script": "In the '90s, I rented a workshop with two friends—one a woodworker, the other a metalworker. We were nothing like the previous business that had installed skylights. One day, a customer from that old business shows up at my door—a real \"Karen.\" She demands repairs on the skylights, insisting I send someone over immediately. I explain that the business has moved and that we're a completely different company. She repeats her demands, getting more agitated. I realize I’m dealing with someone who won’t listen, so I switch to caveman speak: “Skylight business gone. New business come. You talking to new business now. Unnerstand?” She looks confused and I repeat, “No skylight here! Try look in phone book! You bugger off now!” Finally, she leaves in a huff. Communication is key, folks!",
        "tags": [
            "awkward",
            "infuriating",
            "unbelievable",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "1iwk30t",
        "subreddit": "Bridezillas",
        "title": "Evil Bride Tried To Scam Me",
        "script": "I was commissioned to handpaint wedding signs for a friend of a friend. The bride was lovely and understood my struggles with nerve damage that made intricate work tough. I warned her the print-style text wouldn’t be perfect but she insisted it gave a handmade feel. After 35 hours of pain, I delivered the signs, and she loved them. \n\nBut weeks later, I got a message from her. She noticed some letters were uneven and wanted a $100 refund. I explained that meant I’d only get $30 for my work and reminded her she had two months to voice any concerns. I denied her request, and she blocked me. \n\nThen I received a notification from my bank—she requested a chargeback! I disputed it with screenshots of our conversation and photos of the signs, and her chargeback was denied. \n\nTurns out, this bride had requested refunds from every vendor for her wedding, leaving them all in a lurch. She was in debt from her wedding costs and fighting with her husband over her excessive spending. To go into debt over one day is ridiculous, but trying to scam small businesses is another level.",
        "tags": [
            "wedding drama",
            "money problems",
            "infuriating",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "ab5k9a",
        "subreddit": "MaliciousCompliance",
        "title": "I Showed My Dad's Ashes to our Utility Company",
        "script": "My father died on Father’s Day 2012, leaving me to wrap up all his affairs as his only child. When I called the utility company to cancel his services, they asked for his death certificate. I sent it in, but a month later, I received another bill. I called again, and the new representative said she couldn’t talk to me since I wasn’t on the account. I explained that the account holder was dead, but she wouldn’t budge. So, I made an appointment with a supervisor for an in-person meeting. \n\nI showed up with my dad's ashes in a clear bag and plopped them on the desk. I told the woman to tell him I loved him. She went pale and called the cops, claiming I had assaulted her. The cops questioned me, and I explained the situation. They agreed it was extreme but noted no laws were broken. After a private conversation among her superiors, they came back, and the supervisor's boss apologized profusely and got everything sorted.\n\nA few days later, when I called to set up the utilities in my name, I was put on hold. The supervisor's boss got on the line, waived all fees, and informed me that the employee who had been so unhelpful was fired.",
        "tags": [
            "family drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "w5khw1",
        "subreddit": "NuclearRevenge",
        "title": "Should My Dad Have Gotten Revenge for Our Dog?",
        "script": "In 1995, in a small town in Argentina, my father was the local electrician and well-known by everyone. One day, my brother and I were bullied by a kid from Buenos Aires. Our loyal dog, Bucky, protected us, but the bully's father came out with a sledgehammer and brutally killed Bucky right in front of us. We were frozen in fear, crying. My dad, who was fixing a fan, saw our distress and took us for ice cream to mask his emotions. That night, he left home with a wrench, and we later learned the truth. He confronted the bully's father, punched him, and broke his legs in front of his family. He then turned himself in to the police, who let him go after finding the bloody sledgehammer. The bully's family was advised to leave town, never to be accepted again. Years later, I still wonder, was my dad in the right to do this?",
        "tags": [
            "revenge",
            "family drama",
            "unbelievable",
            "twist",
            "heartwarming"
        ]
    },
    {
        "id": "1bvc68q",
        "subreddit": "NuclearRevenge",
        "title": "I Stopped a Revenge Porn Situation",
        "script": "My friend sent some pictures to someone she thought she could trust, but when she got red flags and backed out, he threatened to publish them online. I’m an attorney, so I did some digging. I tracked him down through his online handles to his TikTok, Instagram, and LinkedIn, identifying his workplace. I gathered evidence of his threats and inappropriate workplace behavior, including a picture of him with his work laptop and proprietary info. \n\nI fired off an email to his CEO, HR, and other managers with screenshots of his threats, his workplace incidents, and proof of his identity. I warned them that I would involve local law enforcement and the FBI since my friend is a US citizen. \n\nIn just 45 minutes, I went from a friend defending her honor to ensuring that this guy’s life was about to change forever. You thought you could hide behind anonymity? Think again.",
        "tags": [
            "revenge",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "7ywag0",
        "subreddit": "IDontWorkHereLady",
        "title": "I Was The Only White Guy At This Wedding",
        "script": "I went to my good friend's wedding, dressed in my nice suit, black tie, and shined shoes. I didn’t realize I was the only white guy at the ceremony until it was over. At the after-party, I noticed the waiters were dressed just like me. \n\nA nice older lady, the mother of the bride, approached me. \"Excuse me...can we move this chair over here?\" she asked. I replied, \"Uh...yeah. Go ahead.\" She then asked if it would inconvenience the other table, to which I said, \"That sounds like that's the other table's problem.\" \n\nLater, I returned to that table to drop off my portion of the wedding purse. The same lady was there with her sister. \"Do you know when we'll be eating?\" she asked. I joked about wedding food being the best, and she responded somewhat annoyed, \"Well, with what we're paying for this, I'd imagine it would be.\" \n\nI replied, \"Thank you very much for paying for it. Really, I'm so happy to be here.\" She looked confused, and I asked if this was where we leave the gifts. Suddenly, it clicked for her. \"Oh my god, I'm so sorry! Haha. You don't work here!\" Just then, a waiter walked by, and we all burst out laughing.",
        "tags": [
            "awkward",
            "unbelievable",
            "twist",
            "wedding drama",
            "friendship fallout"
        ]
    },
    {
        "id": "bzppfz",
        "subreddit": "Bridezillas",
        "title": "This Bride Accidentally Revealed Her Secret",
        "script": "I was a bartender for years at a popular wedding venue, handling around 800-1000 weddings. One wedding stood out—a bride in her mid-40s, on her third marriage, was a serious bridezilla. She called about minor details 3-4 times a day for months. On the wedding day, she freaked out over the flowers, but I calmed her down. To my surprise, the event went perfectly. At the end, I asked her how everything went, and she said, “It was perfect, I want to do my next one here.” Her husband did a double take, and I was left speechless. The next day, they returned to pick up items and she said it again—she loved it so much she’d be back for her next wedding. That’s when I realized—she didn’t want to get married, she just loved being a bride and having a special day all about her.",
        "tags": [
            "wedding drama",
            "twist",
            "unbelievable",
            "relationship advice",
            "infuriating"
        ]
    },
    {
        "id": "o76kzv",
        "subreddit": "MaliciousCompliance",
        "title": "HR Tried to Steal My Dad's Pension",
        "script": "My father worked for a Forbes 500 company since the 70s, moving up as a software engineer with patents that saved millions. Just before his pension, HR started making his life miserable. They accused him of not clocking in correctly, but he had been driving the corporate carpool for 15 years with 16 witnesses who could back him up. When HR threatened to fire him for letting his best friend, who was in a wheelchair after losing a foot to diabetes, into the building without badging, my dad asked for proof. They showed him footage of that moment, but my dad had a plan. He had taken the chief of security out for lunch and obtained footage of the HR lady and the CEO doing the same thing. He confronted HR, saying, \"You’re going to fire me for holding the door for my friend? Fine, fire the CEO too!\" In the end, he stayed until he got his pension, proving that standing up for what’s right pays off.",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "justice served",
            "heartwarming"
        ]
    },
    {
        "id": "1givjsj",
        "subreddit": "Bridezillas",
        "title": "Mom Caused A Wedding Cake Disaster",
        "script": "A year later, I can finally share how my mom changed my wedding cake order without telling me. I love my husband, but having a traditional wedding was a huge mistake. The emotions I remember from that day? Anxiety about my mom's unpredictable behavior. If you're engaged and have a complicated family, listen to me: elope! Avoid family drama at all costs! \n\nOnce I got engaged, my relationship with my mom changed drastically. I didn't expect the chaos that followed. The cake incident was just the final straw. She told everyone we were engaged within minutes of my husband proposing, insulted my appearance in photos, and even crashed my first look on the wedding day. \n\nShe made the wedding all about her, claiming I was the controlling one. We still have limited contact, but she never apologized for the hurt she caused. So, soak up the excitement of getting engaged, but be wary of anyone who could turn planning into a nightmare. If you have someone like that in your life, set boundaries and consider eloping.",
        "tags": [
            "wedding drama",
            "family drama",
            "infuriating",
            "twist",
            "justice served"
        ]
    }
]
