[
    {
        "id": "7qjmcj",
        "subreddit": "IDontWorkHereLady",
        "title": "How I Became Assistant to the Regional Manager at a Store I Don't Work For",
        "script": "Yesterday, at my favorite local supermarket, I was shopping when a sweet 75-year-old lady asked me to help her find aluminum foil. I walked her to aisle 7b, grabbed her a roll, and helped her fill her cart with heavy items. After our chat, I went back to my own shopping. Later, I saw her arguing with the floor manager, Greg, who insisted I didn’t work there. But then, she described me and praised my help. Greg, who knows me, called me “Mark,” and suddenly, he thought I was an employee! I lied and said I came in on my day off to help out during a busy time. Greg jokingly offered me the position of Assistant to the Regional Manager, and I couldn’t believe it. The sweet lady chimed in, saying how much she loved shopping there because of the staff’s care. So, I became assistant to the regional manager at a store I don’t even work for!  \nTags: (unbelievable), (twist), (wholesome), (work drama), (heartwarming)",
        "tags": [
            "unbelievable",
            "twist",
            "wholesome",
            "work drama",
            "heartwarming"
        ]
    },
    {
        "id": "1khxmhk",
        "subreddit": "MaliciousCompliance",
        "title": "New Manager's Rules Backfire",
        "script": "My new manager came in loud, preaching about “structure” and “consistency.” Suddenly, no work-from-home, no flexible hours, and no swapping PTO. I asked to move two days for my cousin’s wedding, but she shot back, “Sorry, we can’t make exceptions to anyone. It wouldn’t be fair.” \n\nSo, I put in a request for all 23 of my unused PTO days, straight through the end of the quarter. It got approved in just 10 minutes. A couple of days later, she was in full panic mode: “Wait, who’s handling your workload?” I replied, “Dunno. I assumed you had a plan. No exceptions, right?”\n\nShe had to cover my workload and deal with the fallout. Stuff piled up, clients got angry, and two people quit. When I returned, there was a new HR memo: “Managers can now approve flexible PTO on a case-by-case basis.” Turns out fair looks different when you’re the one getting screwed.\nTags: (work drama), (revenge), (twist), (unbelievable), (justice served)",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "7dj4go",
        "subreddit": "IDontWorkHereLady",
        "title": "Substitute Teacher Mix-Up",
        "script": "A few days ago, I was substitute teaching at a high school when an angry teacher confronted me. He yelled, \"Why aren't you in uniform? And no phones during school!\" I thought he was addressing a student, so I ignored him. He got furious and snatched my phone from my hand. \"What the f**k, give that back! I'm not a student,\" I shot back. He threatened me with detention for swearing and insisted I come to the office to explain my \"disrespect.\" I decided to let him go through with it for a laugh. The principal, who plays netball with me, struggled to hold back her laughter as he raged about how I deserved suspension. Then she revealed, \"Actually, she's a teacher too.\" I've never seen anyone turn so red!\nTags: (work drama), (unbelievable), (twist), (justice served), (teacher drama)",
        "tags": [
            "work drama",
            "unbelievable",
            "twist",
            "justice served",
            "teacher drama"
        ]
    },
    {
        "id": "okmqi2",
        "subreddit": "MaliciousCompliance",
        "title": "Caught Off Guard by My Own Cot",
        "script": "I'm a paramedic, and a few months ago, we were coming back from a routine transfer when I spotted a woman sitting on the curb, looking terrified with bruises on her wrists. I decided to help her, so I pulled out our powered cot to give her a comfortable place to sit. Just as I hit the release tab, a police car showed up—odd since we hadn’t called for help. The woman panicked, bolted into the ambulance, and I realized she was married to the cop. \n\nThe officer, let’s call him Officer Steve, demanded I open the doors to talk to her. I refused, knowing she needed protection. He got aggressive, threatening to charge me with obstruction. So, I stepped aside, but I hadn’t locked the cot in place. When he opened the doors, the heavy cot came crashing out, knocking him down. One deputy laughed while the other advised him to leave before his shift captain arrived. \n\nNow, the woman is safe, but I’ve been pulled over twice a week since then. The best part? The footage of Officer Steve getting bodychecked by my cot will always be a highlight of my career.\nTags: (work drama), (twist), (justice served), (domestic abuse), (police drama)",
        "tags": [
            "work drama",
            "twist",
            "justice served",
            "domestic abuse",
            "police drama"
        ]
    },
    {
        "id": "1hcwiea",
        "subreddit": "IDontWorkHereLady",
        "title": "\"Fired on the Spot!\"",
        "script": "My husband is a manager at a big grocery store, and we were down to one car while waiting for a new one. I was waiting for him outside when a crazy lady demanded I check her out. I barely said, \"Sorry, I don't...\" before she stomped off to complain to my husband. She accused me of being lazy and said I should be fired! My husband walked over with a big grin, winked at me, and dramatically \"fired\" me on the spot, saying loudly, \"You will never work here again!\" I covered my face, fake sobbing, \"My babies, how will I feed my babies?\" I hoped the crazy lady felt horrible, but when I peeked through my fingers, she just had a smug look on her face. Later, in the car, my husband said it was all he could do not to crack up!\nTags: (partner drama), (revenge), (twist), (unbelievable), (infuriating)",
        "tags": [
            "partner drama",
            "revenge",
            "twist",
            "unbelievable",
            "infuriating"
        ]
    },
    {
        "id": "86a35v",
        "subreddit": "IDontWorkHereLady",
        "title": "The Nurse and the Entitled Bitch",
        "script": "I was the charge nurse in the ICU, just finishing a grueling 14-hour shift. All I wanted was to grab some groceries for my slow cooker. As I walked into a big box store in my blue scrubs and stethoscope, I noticed an elderly couple struggling with a large TV. I offered to help, and while we chatted, an entitled woman interrupted us.  \n\n\"Hey! If you’re done, I need help over here!\" she shouted, pointing to her cart of bookshelves. I tried to explain that I didn’t work there, but she only got angrier, demanding I help her.  \n\nWhen her cart toppled over, she exploded in rage, blaming me for her mess. I snapped back, \"Pick them up yourself! I don’t work here!\" She was left speechless as I walked away.  \n\nJust then, the manager arrived, and the entitled woman tried to pin the blame on me. Thankfully, the elderly gentleman I’d helped earlier stepped in, explaining the situation. The manager apologized to me, while the woman continued to rant.  \n\nAfterward, the elderly lady approached me, thanking me for my help. She whispered, \"Don’t look yet. Wait till she leaves,\" and slipped something into my hand.  \n\nOnce the woman drove off, I discovered it was a bag of screws and hardware stolen from her broken box. I couldn’t help but grin as I completed my shopping, knowing I had a new petty revenge hero.  \nTags: (entitlement), (revenge), (work drama), (twist), (unbelievable)",
        "tags": [
            "entitlement",
            "revenge",
            "work drama",
            "twist",
            "unbelievable"
        ]
    },
    {
        "id": "1fzi6lw",
        "subreddit": "Bridezillas",
        "title": "Bride's Cold Hearted Demotion",
        "script": "My husband and I faced a sudden financial hardship while I was a bridesmaid at a friend's wedding. When the bride asked for a few hundred dollars for bridal events on short notice, we had to prioritize our rent. I tried to explain, but she got mad and demoted me to a guest, calling me a horrible friend for not budgeting better. I couldn’t believe she could be so cold-hearted. We haven’t spoken since, but thankfully, our financial situation is improving! Recently, I found out she and her fiancé both got laid off for missing work too often and are now drowning in debt. Meanwhile, we’re about to buy a house. I never wished her bad luck, but it’s funny how karma works. \nTags: (friendship fallout), (money problems), (twist), (karma), (infuriating)",
        "tags": [
            "friendship fallout",
            "money problems",
            "twist",
            "karma",
            "infuriating"
        ]
    },
    {
        "id": "1gf9idw",
        "subreddit": "Bridezillas",
        "title": "The Bridezilla Proposal",
        "script": "Yesterday was my first day back at work after two weeks off. One of my coworkers, who recently got engaged, asked to see me. She handed me a gift bag and asked if I would be her \"best man of honor.\" I told her that traditionally, that role goes to a close female friend, and she insisted that her wedding was anything but traditional. I thanked her but declined, saying I preferred to be a guest instead. Her demeanor changed instantly. She insisted I had to be part of her wedding, and when I reiterated my no, she walked away, clearly upset. \n\nThe next day, she returned with a list of responsibilities for me as her best man of honor. I told her again that I wasn't interested. She asked, \"Haven't you ever wanted to be part of something special?\" I replied that I was a nurse, which I thought was special enough. Luckily, my boss jumped in to help me out, sensing I needed it. I was baffled. We weren't that close, so why the pressure? My friend speculated that she might see our similar ages as a connection. But why is saying no to this kind of request seen as a bad thing?\nTags: (wedding drama), (friendship fallout), (infuriating), (unbelievable), (twist)",
        "tags": [
            "wedding drama",
            "friendship fallout",
            "infuriating",
            "unbelievable",
            "twist"
        ]
    },
    {
        "id": "7xftgg",
        "subreddit": "IDontWorkHereLady",
        "title": "Crazy Woman vs. Autistic Kid",
        "script": "I was working as a door greeter when I saw a young autistic boy organizing potted flowers, doing a fantastic job. Most people admired him, but one old woman decided he needed to help her. She stood behind him, arms crossed, tapping her foot. When he didn’t respond, she yelled at him to help her. I was about to intervene when she grabbed his arm. Startled, he jerked away, causing her to lose her balance and fall to the ground. \n\nBy the time I reached him, his mother had arrived, and the woman was already berating the boy, claiming he attacked her. The boy was on the verge of tears, and his mom looked shocked. I told her to calm him down, assuring her he hadn’t done anything wrong. The crazy woman then tried to twist the story, claiming to be the victim. I confronted her, stating I had witnessed the whole incident and that she had assaulted him. \n\nAs a crowd gathered, her story fell flat. Seeing no support, she quickly left the store. I turned to the boy and his mom, who thanked me for my support. She explained that arranging flowers calms him, and the boy gave me a light pat on the shoulder—his version of a high five. That was it; they were gone, but I felt good knowing I stood up for him. \nTags: (family drama), (unbelievable), (justice served), (heartwarming), (twist)",
        "tags": [
            "family drama",
            "unbelievable",
            "justice served",
            "heartwarming",
            "twist"
        ]
    },
    {
        "id": "ysarcg",
        "subreddit": "MaliciousCompliance",
        "title": "The Two-Cent Revenge",
        "script": "In 2019, I moved from an apartment in Celebration, Florida, and received my final bill. To my surprise, there was a follow-up bill for $0.02. My wife and I laughed about the absurdity of spending 50 cents on postage for two cents. I took two cents from the change jar and went to the apartment office to pay it.  \n\nI told the manager, \"It's two cents. Here's the bill, and I have the two cents if you want it.\" She replied, \"We don't take cash.\" I expected her to laugh it off, but she didn’t. I asked, \"You want me to write a check for two cents and mail it?\" She confirmed, then walked back into her office.  \n\nSo, I went home and set up an automatic monthly payment to the apartment complex for three cents. I also wrote code to send a letter each month saying, \"I'm so sorry - I've overpaid my bill. Please send me a check for the overpayment.\" I even used a service to send oversized postcards to make my point clear.  \n\nThe following month, I got a call from the regional manager, sincerely apologizing and pleading with me to stop. I never heard from them again. Did I spend hours on this for two cents? Yes. Was it worth it? Absolutely.  \nTags: (revenge), (unbelievable), (twist), (work drama), (infuriating)",
        "tags": [
            "revenge",
            "unbelievable",
            "twist",
            "work drama",
            "infuriating"
        ]
    },
    {
        "id": "qvkgvi",
        "subreddit": "NuclearRevenge",
        "title": "The Ultimate Revenge on My Abusive Father",
        "script": "In 1990, my dad abandoned my sister and me for his third wife, living on a derelict houseboat. He paid us $40 for groceries every two weeks. Years later, I learned he was living well while I struggled. Fast forward to 2019, I got a call from my dad’s brother that he was in a nursing home and needed my help. Curiosity pulled me to see him, and I discovered that his \"real\" family had left him in ruins. \n\nMy dad's wife had died from lung cancer, and his son, Shorty, was MIA while my dad was worried about him. I agreed to help my dad but demanded he sign over Power of Attorney to me. With that, I uncovered that Shorty had been stealing over $130K from my dad. I took action: I got a locksmith to access his hoarded house, called the cops, and hired a biohazard company to clean it up. \n\nI documented everything, including the state of the house and Shorty’s thefts. I even got a restraining order against Shorty. In court, I presented my evidence, and the judge granted the order permanently. I made sure my dad’s life insurance would go to my sister and me, not Shorty. \n\nWhen my dad died, I arranged for him to be buried far away, where no one would visit. In August, I learned Shorty was arrested for felony elder abuse and is facing 10 years in prison. He lost everything while I live well, and I couldn’t be happier.\n\nTags: (revenge), (family drama), (twist), (justice served), (unbelievable)",
        "tags": [
            "revenge",
            "family drama",
            "twist",
            "justice served",
            "unbelievable"
        ]
    },
    {
        "id": "jevhtt",
        "subreddit": "IDontWorkHereLady",
        "title": "Assaulted for Helping an Elderly Man",
        "script": "I’m an 18-year-old male, born deaf and mute, living with my sister since our parents died. Recently, she went on her honeymoon, leaving me to navigate the world alone. I decided to visit a new supermarket for some items. I wore a red shirt that looked similar to the employees' uniforms.\n\nWhile looking for batteries, I noticed an elderly man struggling to reach DVDs on a high shelf, so I helped him. Moments later, a woman in her late 40s grabbed my wrist and slapped me. She was yelling, but I couldn't follow her fast-moving lips. I signed to her that I was deaf, which only made her angrier. She threw my notebook and pen away and slapped me again, pushing me to the ground.\n\nFortunately, a store employee intervened. I tried to explain what happened, and the employee understood my signs. He told the woman what was going on, but she still tried to assault me again. I signed for him to call the cops, and he nodded. The security caught her trying to escape.\n\nWhen the police arrived, they spoke with the employee and reviewed the CCTV footage. They asked if I wanted to press charges, and I said yes. Karen was handcuffed and taken away. The store manager offered me a 50% discount for my troubles. I texted my sister about the incident, and she was furious. As a lawyer, she’s going to handle the case herself and ensure Karen gets what she deserves. Court is in 40 days. \nTags: (infuriating), (twist), (justice served), (disability), (assault)",
        "tags": [
            "infuriating",
            "twist",
            "justice served",
            "disability",
            "assault"
        ]
    }
]