[
    {
        "id": "1f7466d",
        "subreddit": "aitah",
        "title": "I Defended Myself Against a Creepy Stranger in a Grocery Store",
        "script": "I went to my local grocery store for a couple of items when I noticed a man in his 40s following me closely. He didn’t pick up anything or even have a cart, just trailed behind me as I moved from aisle to aisle. I felt uncomfortable but decided to check out anyway. As I reached my car, he approached me, trying to make awkward small talk about my age and my out-of-state license plate. I told him I wasn’t interested and asked him to leave me alone, but he got even closer.\n\nI have a significant issue with people crowding me due to past trauma, so I shouted, “Please back away from me, I don’t like this.” He laughed and moved within three inches of me. In that moment of panic, I slammed my palm into his nose, breaking it. He screamed at me while I was having a panic attack, and I just got into my car and drove off.\n\nI shared the story with friends, and opinions are split. Some say I overreacted, while others understand my response given my trauma. So… AITAH?"
    },
    {
        "id": "1f4vmjy",
        "subreddit": "aitah",
        "title": "I Won the Lottery, But My Son's Greed Shocked Me",
        "script": "I won the lottery—$1,000 a day for life. At 58, I thought I’d be generous with my 19-year-old son. I offered him the ticket, but I wanted half the money until I die. He needed time to think. When he came back, he argued that it wasn't fair for me to ask for half; I could live another 40 years. He suggested I take just 20% instead.\n\nI signed the ticket and claimed the lump sum, planning to set him up for life with education, a home, and a trust fund. But now he’s furious that I didn’t stick to our original deal. The kicker? He told my ex about the winnings, and now she’s demanding a cut too, even after years of divorce. I owe her nothing, and I’m realizing just how greedy my son really is."
    },
    {
        "id": "1ei3w4r",
        "subreddit": "aitah",
        "title": "I Refused to Be the Dad That’s Not Mine",
        "script": "I had a crush on this girl, but then she got pregnant by a random guy. While she's pregnant, she suddenly wants to date me and her parents expect me to step up and help raise \"our\" kid. They want me to get a job and a place for us to live. But I’m not the dad! My own dad told me to tell her to go f herself and focus on my dreams. He said HER baby is NOT my responsibility. I stood my ground and told her I wasn’t getting involved. After blocking her and her parents on everything, I got a temporary restraining order against them. Now, if they contact me again, the sheriff will be involved. I chose my future over their drama."
    },
    {
        "id": "1c9a3wl",
        "subreddit": "aitah",
        "title": "My Brother Tried to Steal My Wedding Day",
        "script": "My brother said he was going to propose at my wedding. I told him no—it was our day, and we didn’t want any distractions. My mom lost it, insisting he wanted family around for his proposal. I didn’t care. I told her I’d kick him out if he did it.\n\nHe went ahead and proposed anyway. My mom threatened to leave if I kicked him out. I was furious inside.\n\nFast forward to his wedding last weekend. Instead of giving a welcome toast, I announced that my wife and I were expecting our first baby. My mom was livid, but my grandmother told her to sit down and shut up. The rest of the reception turned into a celebration of our baby with family we wouldn’t see again for a while.\n\nNow my mom thinks I was the jerk for taking attention away from my brother. But I reminded her of her threat to leave my wedding if I kicked him out. I even have the screen cap of her texts."
    },
    {
        "id": "1ge4spg",
        "subreddit": "aitah",
        "title": "Lego War: The Family Feud That Got Out of Hand",
        "script": "My brother's family visited last month, and my kids and I love leaving Lego dioramas around the house—like Ironman battling Darth Vader on a loot llama. My nephew loved them and took a few home. When I asked my brother to return them, he brushed it off as \"kids being kids.\"\n\nSo, I decided to play a little game. At a BBQ at his place, I told my kids that unless we got our Lego back, anything in the house was fair game. They went wild! By the time we left, I don’t think there were any remotes, small electronics, or beer mugs left behind. I even had to sneak his dog back inside!\n\nOn the way home, I ignored my brother's calls. When I finally returned his call, he was furious about the missing stuff. I said I'd check with the kids, but he knew what happened. I told him I’d box up his things and return them next time—only if we got our Lego back.\n\nLater that night, he showed up at my house with our Lego, plus a few extra pieces he accidentally took. I returned his stuff and told him this is how we’d handle things with his kid in the future. Now, he’s livid he had to make a special trip, while my parents think there's a big difference between a kid taking toys and teenagers raiding their uncle's house. \n\nSo, AITA?"
    },
    {
        "id": "1ecd2g1",
        "subreddit": "aitah",
        "title": "I Overheard My Waitress's Racist Comment and Gave Her a Zero Tip",
        "script": "Last night, my mom and I went to a restaurant for her first meeting with my boyfriend’s mom. We arrived 30 minutes early and were seated right away, but it took the waitress 20 minutes to greet us. When she finally did, she didn’t even write down our drink order. After 15 minutes, our drinks arrived—wrong, of course. My mom pointed out the mistake, and the waitress rolled her eyes before disappearing with the glass.\n\nI excused myself to find the bathroom and overheard the waitress venting to some hostesses. She was furious about having to serve \"a black table\" because \"they\" never tip well. I was shocked but kept my cool and asked for directions to the bathroom without revealing I’d heard her.\n\nWhen I returned, my boyfriend and his white mom were already seated. Suddenly, the waitress was all smiles, taking notes and joking with them. The service improved drastically. At the end of the night, I decided to pay for everyone, but when she handed me the tip machine, I keyed in \"0%.\" She didn’t notice until the receipt printed out, and I was walking away.\n\nShe tapped my shoulder, asking if I made a mistake. I smiled and said her service was fantastic, but since I was a black woman, I don’t tip well. Her face went pale, and she laughed nervously. I walked out, and my boyfriend’s mom was furious, saying I should’ve tipped to show character. My boyfriend and mom are on my side, but now I’m questioning if I should’ve left even a small tip."
    },
    {
        "id": "1hb9rd8",
        "subreddit": "aitah",
        "title": "I Sold Taylor Swift Tickets After Discovering My Girlfriend's Affair",
        "script": "A few months back, I (27M) won some money on Stake and decided to surprise my girlfriend (25F) with Taylor Swift tickets for her Vancouver show. She’s a massive Swiftie, and I spent about $800 for two great seats.\n\nLast week, I discovered she’d been secretly meeting up with her \"work friend\" for months. I found out because she left her Instagram DMs open on my laptop and saw weeks of flirty messages and plans to meet up. When I confronted her, she admitted they’d kissed several times and had been having an emotional affair.\n\nDevastated, I couldn't bear the thought of taking her to the concert after this betrayal. Instead of letting the tickets go to waste, I sold them for $2,400—triple what I paid.\n\nWhen she found out, she lost it. She called me petty and cruel, saying I \"ruined her dream\" and that the tickets were a \"gift\" that belonged to her. Her friends have also been messaging me, calling me an awful person for using the tickets to hurt her.\n\nI feel I had every right to sell them, especially after what she did. But now I’m questioning if I took things too far. AITAH?"
    },
    {
        "id": "1flalvl",
        "subreddit": "aitah",
        "title": "My Girlfriend Called My Brother's Memory \"Stupid\"",
        "script": "I lost my younger brother to cancer when I was 22. Since then, I've honored him every year on the anniversary of his death by donating blood, visiting his grave, and watching his favorite movie. It’s a personal tradition that means everything to me.\n\nYesterday, my girlfriend Anna asked me to join her and her mom for lunch. I told her no, explaining it was the anniversary of my brother's death. She got upset and said, “You can do your stupid blood donation tradition any day.” I tried to explain it’s not just about the donation.\n\nLater, while I was watching my brother’s movie, she texted again, asking me to join them. I still said no and offered to meet her mom another time. She called me selfish and lazy, saying I embarrassed her in front of her mom. Since then, she’s been distant.\n\nI texted her to talk, but she never replied and blocked me on everything. I wasn’t sad about it; I wanted to end things anyway. Some people said my tradition saved me from a lifetime of misery, and that made me smile."
    },
    {
        "id": "18n0zbl",
        "subreddit": "aitah",
        "title": "My Husband Demanded a Paternity Test Right After Our Baby Was Born",
        "script": "I’ve been married to my husband for 2 years and just had our daughter 5 weeks ago. When she was born with blonde hair and blue eyes while we both have brown hair and eyes, my husband freaked out. He demanded a paternity test and threatened divorce if I didn’t comply, so I agreed.\n\nHe moved out for three weeks to stay with his parents while I recovered. During that time, my mother-in-law warned me that if the test proved I wasn't faithful, she'd ensure I got nothing in a divorce. Luckily, my sister was there to help me with the baby.\n\nYesterday, we got the test results. I was on the couch when he returned, and as we read the results together, his face went pale—he was the father. I couldn't help but laugh at his shocked expression, saying, \"I told you so.\" He got furious, and we argued until my sister intervened.\n\nLater, my mother-in-law called to scold me for laughing at him, saying I was kicking him while he was down. I received nasty texts from her this morning. I don’t think I did anything wrong, but I'm left wondering if I handled it poorly."
    },
    {
        "id": "1ji36pp",
        "subreddit": "aitah",
        "title": "Stepmom Tries to Erase My Mom, I Call Her Out in Front of Everyone",
        "script": "I (18F) live with my dad and my stepmom (43F). My mom passed away when I was 10, and while my stepmom came into the picture a couple of years later, we’re not close. She often acts like she’s competing with my mom, getting snippy when I talk about her or wear anything that belonged to her, like my mom’s old necklace.\n\nA few nights ago at dinner with my dad, stepmom, and her parents, her mom asked about the necklace. I said, “It was my mom’s. She gave it to me before she passed. I wear it every day.” \n\nSuddenly, my stepmom cut in, “Well, technically I’m your mom now. I’ve done more mothering in the last 8 years than she did in 10.” The whole table went silent. \n\nI just laughed and said, “If you think being a mom is about trying to erase the actual one, then yeah, you’ve been amazing.” She looked like she’d been slapped. Her mom gasped, and my dad told me to apologize, but I refused. I said I was done with her acting like my mom never existed.\n\nNow my stepmom is barely speaking to me, and my dad says I “need to be the bigger person” because “she’s just trying to connect.” But to me, that felt like erasure, not connection. AITA for calling her out?"
    },
    {
        "id": "1fzjnbr",
        "subreddit": "aitah",
        "title": "My Wife's Delivery Addiction Led to a Shocking Discovery",
        "script": "Nine days ago, I posted about my unemployed wife's outrageous spending—$1,176 on delivery apps in just a month. After canceling our credit card and moving money from our joint account, she accused me of financial abuse. She threw tantrums, threatened divorce, and even tried guessing my bank password to access our funds. \n\nBut then, it all stopped. I thought she had given up. That was until garbage day. As I took out the last bag, I found fast food bags and takeout containers hidden inside. She wasn’t supposed to have access to money, so I confronted her. At first, she denied it, but when I brought out the evidence, she confessed: she had taken out a payday loan. \n\nI was shocked—how was she even approved? I quickly froze my credit and drove her to the payday loan place, where I paid off the loan in cash, forcing me to dip into my savings for rent. \n\nSo cutting her off worked, but instead of ordering, she was now driving to restaurants with borrowed money, paying exorbitant fees. I told her we would be getting divorced. My marriage is over, and I can only imagine how she'll manage living under a bridge if Uber Eats delivers there."
    },
    {
        "id": "1baxuez",
        "subreddit": "aitah",
        "title": "I Told My Wife the Truth About Her Plastic Surgery, and It Destroyed Everything",
        "script": "My wife had plastic surgery recently, and despite our discussions, I was against it. Now, she looks weird—like she stepped out of an uncanny valley. She had fat sucked from her face, lip fillers, a neck lift, and more. \n\nShe wants everything to go back to normal, including our intimacy, but I dread looking at her. I’ve been avoiding sex, making excuses about being tired from work instead of telling her the truth. She finally confronted me, asking if I was having an affair. I let her look through my phone, knowing she’d find nothing.\n\nAfter hours of her probing, I finally admitted the truth: I’m not attracted to her new face. She asked if that's why I keep the lights off, and I confirmed. She broke down, cried, and left to stay with her sister. \n\nNow, I’m being called every name in the book. Her sister thinks I’m a piece of shit for insulting her looks. I didn’t want to hurt her; I just can’t force myself to find her attractive anymore. I still love her, but her new face? It’s like something out of The Fifth Element."
    }
]