[
    {
        "id": "apy6s3",
        "subreddit": "NuclearRevenge",
        "title": "CEO's Lie, Bitchboss's Downfall, and Sweet Revenge",
        "script": "I was headhunted by a CEO friend to save his struggling tech company. After landing $2M in sales, everything changed when the new VP of Sales, whom I loathed, tried to inflate my numbers to impress an investor. I refused to lie and exposed her deception during a critical pitch. Fast forward, I reported a creepy comment from the CIO about my appearance, thinking it was a minor issue. But when I casually mentioned my lawyer friend, the CEO flipped out, leading to retaliation from my bitchboss. They even canceled my health insurance right before my surgery. After months of harassment, I documented everything and ultimately resigned. My lawyer and I took my case to the EEOC, where we uncovered that bitchboss had forged my write-ups. They offered me $50k to settle, and I accepted. Sweet victory! But my revenge didn’t stop there. For 18 years, I’ve been sabotaging her new marketing company, inundating her employees with spam and chaos. Her firm is in ruins, just like she tried to do to me.",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "justice served",
            "infuriating",
            "heartwarming"
        ]
    },
    {
        "id": "ch761h",
        "subreddit": "NuclearRevenge",
        "title": "My Sister Took Down a Corrupt Job Corps Program",
        "script": "This happened to my sister, who has always formed friendships with her teachers. About 15 years ago, while studying hotel management at Job Corps, she was close with her teacher. One day, the teacher stumbled upon a paper-shredding session and discovered that over 60% of the center’s funds were being embezzled. Despite lucrative offers, the teacher refused to join in and was fired just before retirement, losing her package. My sister was furious and knew any report would be ignored, so she devised a plan.\n\nOver the next couple of months, she gathered evidence of the embezzling and crafted an email detailing everything, CCing over 2000 people including the Job Corps national director, Department of Labor officials, every member of Congress, and even the President's office. \n\nTwo weeks later, the investigation wrapped up with only 5 or 6 staff members keeping their jobs, while the rest, including the dean, faced major criminal charges for stealing millions over the years. The teacher received a generous severance package, and my sister was awarded her completion certificate despite not finishing the course—they just wanted her gone!",
        "tags": [
            "justice served",
            "work drama",
            "twist",
            "unbelievable",
            "revenge"
        ]
    },
    {
        "id": "rw9wr4",
        "subreddit": "MaliciousCompliance",
        "title": "I Got Pulled Over, But the Officer Didn't Expect This!",
        "script": "This morning, I was pulled over by a police officer after making a complete stop at a four-way stop. I turned my dash cam to face me as I rolled down the window and asked, \"What seems to be the problem, officer?\" He looked at me like I was gum on his shoe and said, \"You didn't make a complete stop.\" I adjusted my hearing aids and before I could respond, he said, \"Sir, take off your earphones when I'm talking to you!\" \n\nI took off my hearing aids and signed, \"I'm deaf and didn't understand you. Can you please communicate in ASL?\" He looked puzzled, pointed at my hearing aids like they were Apple AirPods, and motioned for me to put them back on. I replied, \"Without these, I can only communicate in ASL.\" \n\nFrustrated, he mumbled, \"For fuck's sake,\" then gave me a thumbs up to go. I rolled up the window and drove away, grinning all day.",
        "tags": [
            "unbelievable",
            "twist",
            "justice served",
            "road rage",
            "communication"
        ]
    },
    {
        "id": "fnxqdz",
        "subreddit": "NuclearRevenge",
        "title": "I Was Framed at Work, But the Fallout Was Epic!",
        "script": "I was fired from my job at an upscale restaurant after being framed for theft. The new general manager, Harvey, had a shady past and began replacing our managers, leading to a toxic environment. I often had to negotiate with Fredo, the kitchen manager, who tried to cut our hours. When I was set up for a meal I didn’t steal, I was fired on the spot. Before leaving, I recorded a conversation that revealed their plot to get rid of me. I quickly found a new job, and during the interview, I played the recording to prove my innocence. Months later, my old restaurant was under investigation after corporate received my video. Harvey was fired after his past of harassment surfaced, and Fredo was arrested for hiring undocumented workers. The fallout included mass layoffs and deportations, all stemming from my wrongful termination. What started as a personal vendetta against me turned into a corporate disaster!",
        "tags": [
            "revenge",
            "work drama",
            "twist",
            "justice served",
            "unbelievable"
        ]
    },
    {
        "id": "xzjiue",
        "subreddit": "NuclearRevenge",
        "title": "My Dad's Dark Secret: The Day Uncle Mark Tried to Kidnap Me",
        "script": "My favorite uncle, Mark, was always fun and loved to hang out with me. But one day, my dad got a call that changed everything. He screamed, stormed out, and I didn’t see him for a long time. My mom said he was just away for work. Nine months later, Dad returned, and I was thrilled. But he told us Uncle Mark was a bad person and we should ignore him. A year later, I saw Uncle Mark waiting for me after school. He wanted to take me for a ride, but I remembered my dad’s warning. Just then, my dad appeared and punched Uncle Mark in the face. After chasing him away, Dad hugged me but left again. Five years later, Mom revealed he was in prison for protecting us from Uncle Mark, who liked kids a lot. It turned out Uncle Mark had been abusing his wife and had tried to kidnap me. My dad had beaten him nearly to death when he found out. After my dad was imprisoned, Uncle Mark thought he could get away with it. But my dad found him again, and this time, he took justice into his own hands. He killed Uncle Mark in a fit of rage after discovering more evidence of his crimes. My dad was charged with manslaughter instead of murder, and he said he didn’t regret it. I told him I was proud of him.",
        "tags": [
            "family drama",
            "twist",
            "justice served",
            "unbelievable",
            "heartwarming"
        ]
    },
    {
        "id": "bc2jye",
        "subreddit": "MaliciousCompliance",
        "title": "My Neighbor's Revenge Backfired Spectacularly",
        "script": "We moved into a tight-knit community and wanted privacy in our kitchen, so my parents spent thousands on plants. A week later, my neighbor chopped them down, claiming they were on his property. Furious, my dad confronted him, but the neighbor threatened to report us if we crossed his line again. We called the plant company, and thanks to the warranty, they replanted them for free. But just a few nights later, we caught him chopping them down again at 2 AM. We called the police for obstruction of property. After a chat, he decided to get a professional to mark the property line. When I got home, I saw orange tape in his yard—his fence was 11 feet over our line! We watched him take down his fence, fuming. In the end, we got our privacy back, and he lost a quarter of his backyard, costing him almost $10,000 for the destruction. We replanted our plants and enjoyed our new space!",
        "tags": [
            "neighbor drama",
            "revenge",
            "twist",
            "justice served",
            "property dispute"
        ]
    },
    {
        "id": "tbta7d",
        "subreddit": "MaliciousCompliance",
        "title": "[The Call That Exposed My Ex-Husband's Lies]",
        "script": "I was working in the billing queue at a call center when a distraught lady called in about a $49 charge for a wireless access point. Confused, she insisted she didn’t have TV services, but I dug deeper and discovered her ex-husband had set up a contract for Optik TV and Internet—despite her living in a town without service. She broke down, revealing he had cheated, divorced her, and ghosted her completely. I felt for her and offered to remove his access and downgrade her services. Then, she had an epiphany: “Wait, you have his new address?” I confirmed I could provide it since it was her account. She was ecstatic! I shared his new address, phone number, and even the contact for the new woman. I couldn’t help but imagine his shock when he called in, only to find out he’d been cut off and exposed.",
        "tags": [
            "partner drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "ay7m8x",
        "subreddit": "NuclearRevenge",
        "title": "I Exterminated More Than Just Bugs for Mary",
        "script": "I was an exterminator for over a decade, specializing in severe infestations, especially bed bugs. One day, I was called to an apartment where I met Mary, a sweet elderly nurse from World War 2. When she opened the door, I was horrified to see her covered in bed bugs—her hair, clothes, and even her hands. I immediately called an ambulance, knowing she was in serious danger of toxic shock from the bites. \n\nAs she was rushed to the hospital, I felt a surge of anger. This infestation didn’t happen overnight; it had gone unchecked for years. I contacted local social services and Adult Protective Services, alerting them to Mary's dire situation. I also called the news and warned her neighbors. I encouraged anyone affected to file civil suits against the apartment management, who had been neglecting their responsibilities and falsifying maintenance records.\n\nIn the end, I helped get the apartment manager arrested for elderly abuse and neglect, and the entire staff was fired. I visited Mary often after that, and while her health improved temporarily, she eventually passed away. I’ll never forget her or those who let her live in such horror.",
        "tags": [
            "revenge",
            "heartwarming",
            "unbelievable",
            "justice served",
            "elder abuse"
        ]
    },
    {
        "id": "1kay4hv",
        "subreddit": "MaliciousCompliance",
        "title": "I wore a suit to work and got my supervisor demoted",
        "script": "Ever since I started my job, my supervisor, Josh, has been micromanaging me. He often criticizes my work without giving clear expectations. After a frustrating meeting with HR, Josh told me I needed to dress better, despite my professional attire fitting the casual vibe of our small company. \n\nSo, I decided to be petty. The next day, I showed up in a full suit—completely overdressed for the office. When coworkers asked why I was dressed up, I casually mentioned that I was told to “dress better” by Josh. Their reactions were priceless, and word spread quickly. \n\nLater, the CEO came to my desk and told me I'd be reporting to him from now on, meaning Josh was demoted to just another employee. I’m riding high on this victory and might just wear another flannel tomorrow!",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "justice served",
            "unbelievable"
        ]
    },
    {
        "id": "r1gwqe",
        "subreddit": "NuclearRevenge",
        "title": "I Exposed My Cheating Cousin at Christmas Dinner",
        "script": "I’ve always been the black sheep of my family, while my cousins became doctors and professors. I made a comfortable living with a part-time job and stable passive income, but my family judged me harshly, especially my cousin Randy, the stereotypical rich bro who always belittled my choices. One day, I spotted him cheating on his wife, and after following him for five hours, I decided to take action. \n\nAt Christmas dinner six months later, I dropped printed photos of Randy with his mistress right in front of everyone, ensuring his wife saw them. Chaos erupted—screaming, fighting, and I ended up with a black eye from Randy’s dad. My family cut me off for years, but Randy faced the consequences: he got divorced and lost custody of his kids after threatening his ex. \n\nNow, I have a good relationship with Randy's ex-wife, and the kids call me \"Uncle.\" I married my SO, and my family tried to reconnect, but seeing me thrive without them seems to eat at them. I’m living my best life now, free from their toxicity.",
        "tags": [
            "family drama",
            "revenge",
            "twist",
            "justice served",
            "unbelievable",
            "heartwarming"
        ]
    }
]