[
    {
        "id": "1f7466d",
        "subreddit": "aitah",
        "title": "I Defended Myself Against a Creepy Stranger at the Grocery Store",
        "script": "I (21F) was at my local grocery store, just grabbing a couple of items when I noticed a man (45-55) following me closely. He wasn't shopping, just trailing behind me. I felt uncomfortable but continued to check out. As I walked to my car, he approached me, trying to make small talk—asking my age, why my license plate was from another state, and if I had a boyfriend. I told him I wasn't interested and asked him to leave me alone, but he got even closer. I have a trauma response to being cornered, so I loudly said, “Please back away from me, I don’t like this.” He laughed and moved in even closer, so I panicked and slammed my palm into his nose, breaking it. He screamed, but I just got into my car and left. Now my friends are divided—some say I’m the asshole for not just walking away, while others say my reaction was justified. AITAH?  \nTags: (unbelievable), (infuriating), (twist), (justice served), (partner drama), (relationship advice)",
        "tags": [
            "unbelievable",
            "infuriating",
            "twist",
            "justice served",
            "partner drama",
            "relationship advice"
        ]
    },
    {
        "id": "1fpeavo",
        "subreddit": "aitah",
        "title": "**Cousin's Prank Costs Him More Than He Bargained For!**",
        "script": "My cousin, the golden child of the family, has always been the life of the party. He’s funny and outgoing, but I’ve never liked him. I have hearing problems and recently got a $6,000 pair of hearing aids. At my grandmother's birthday party, he thought it would be hilarious to throw me into the pool, ruining my hearing aids. I told him to stop, but he didn’t listen. When I asked him to pay for the damage, he just shrugged it off. My family sided with him because I earn more, but I took him to court and won. Now, his wages are being garnished, and it’s pushed him to drop out of college to make ends meet. My family is furious with me for making him pay, but he never apologized. Was I in the wrong for holding him accountable, even though it’s affecting his family?\nTags: (family drama), (revenge), (justice served), (twist), (infuriating)",
        "tags": [
            "family drama",
            "revenge",
            "justice served",
            "twist",
            "infuriating"
        ]
    },
    {
        "id": "1f4vmjy",
        "subreddit": "aitah",
        "title": "My Son's Greed Cost Him a Fortune",
        "script": "I won the lottery—$1,000 a day for life. At 58, I thought about my 19-year-old son and proposed a deal: I’d give him the ticket, and in return, he’d pay me half until I die, then keep everything. He said he needed time to think. When he returned, he claimed it wasn’t fair for me to want half. He suggested I take only 20% because I might live another 40 years and he might need the money more. I signed the ticket and claimed the lump sum instead. I’m seeing a lawyer to set my son up for life—paying for his education, a home, and a trust fund for his future. Now he’s furious I didn’t stick to our original deal. He even told my ex, who is now demanding money too. I owe her nothing, and it’s shocking to see how greed can blind people, even my own son.  \nTags: (money problems), (family drama), (twist), (unbelievable), (infuriating)",
        "tags": [
            "money problems",
            "family drama",
            "twist",
            "unbelievable",
            "infuriating"
        ]
    },
    {
        "id": "1ei3w4r",
        "subreddit": "aitah",
        "title": "**The Unexpected Baby Trap**",
        "script": "I always had a crush on this girl, but she got knocked up by some random loser. Now, while she's pregnant, she wants to date me. Her parents are pressuring me to \"step up\" and help raise the baby so they don’t have to deal with it for the next 18 years. But I’m not the dad! She thinks I should get a job and a place for us to live together and help raise \"our\" kid. \n\nMy dad told me to tell her to go f herself and not to sacrifice my dreams. He made it clear that HER baby is NOT my responsibility and he would be heartbroken if I took on this burden. He supports my plans to join the Corps instead. I stood my ground and told her I’m not interested. \n\nHer dad called me a “real man” for not stepping up, but I knew I had to cut ties. I blocked her and her parents on all social media and their phone numbers. I even got a temporary restraining order against them. If they contact me, the sheriff will be involved. \n\nWhat a relief it is to finally be free from that pressure!\n\nTags: (partner drama), (family drama), (infuriating), (twist), (justice served)",
        "tags": [
            "partner drama",
            "family drama",
            "infuriating",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "1c9a3wl",
        "subreddit": "aitah",
        "title": "My Brother Tried to Steal My Wedding Spotlight",
        "script": "My brother announced he was going to propose at my wedding. I told him no—this day was about my wife and me, and we didn’t want distractions. My mom flipped out, saying he wanted family around for the proposal. I didn’t care; if he did it, I’d kick him out. He went ahead anyway, and when I threatened to toss him out, my mom said she’d leave too. \n\nFast forward to his wedding last weekend. Instead of a toast welcoming him to the family, I revealed that my wife and I were expecting our first baby! My mom was furious, but my grandmother told her to sit down and shut up. We spent the reception celebrating our news with family we wouldn’t see for a while. \n\nNow, my mom’s calling me an asshole for stealing the spotlight from my brother. I reminded her of her threat to leave my wedding if I kicked him out. I even have the text messages to prove it!\n\nTags: (family drama), (wedding drama), (twist), (revenge), (infuriating)",
        "tags": [
            "family drama",
            "wedding drama",
            "twist",
            "revenge",
            "infuriating"
        ]
    },
    {
        "id": "1ge4spg",
        "subreddit": "aitah",
        "title": "AITAH for Teaching My Brother a Lesson with a LEGO Heist?",
        "script": "My brother and his family visited last month, and my kids love leaving silly LEGO dioramas around the house. My nephew took some home, and when I asked my brother to return them, he shrugged it off, saying it was just kids being kids. \n\nAt a BBQ, I told my kids anything in my brother's house was fair game unless we got our LEGO back. They raided his place, leaving with remotes and beer mugs. On the way home, my brother called, furious about his missing stuff. I played it cool and said I'd check with the kids. \n\nLater that evening, he showed up with our LEGO, plus some extra items he accidentally took. I returned his things and told him this was how we’d handle his kid in the future. Now he’s angry, and my parents think there’s a huge difference between an eight-year-old taking toys and teenagers raiding a house. AITAH?  \nTags: (family drama), (revenge), (twist), (unbelievable), (justice served)",
        "tags": [
            "family drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "1ecd2g1",
        "subreddit": "aitah",
        "title": "I Overheard a Waitress's Racist Comments and Gave Her a Zero Tip",
        "script": "Last night, I (30 F) was at a restaurant with my mother, meeting my boyfriend's mom for the first time. We arrived early and noticed the waitress didn’t want to serve us. After 20 minutes, our drinks arrived—wrong, of course. While I went to the restroom, I overheard the waitress complaining to the hostesses about having to wait on \"a black table\" because \"they\" never tip well. \n\nWhen I returned, my boyfriend and his white mom were there, and suddenly the waitress's attitude changed. Her service was perfect, but I decided to pay the bill and tipped her 0%. She tapped my shoulder, confused, and I told her I thought it was fair since I don’t tip well as a black woman. Her face went white, and I left. My boyfriend's mom thought I should have tipped her anyway to show character, but my boyfriend and mom are on my side. Should I have given her a tip? \nTags: (infuriating), (twist), (justice served), (racism), (restaurant drama)",
        "tags": [
            "infuriating",
            "twist",
            "justice served",
            "racism",
            "restaurant drama"
        ]
    },
    {
        "id": "1hb9rd8",
        "subreddit": "aitah",
        "title": "I Sold the Taylor Swift Tickets After Discovering My Girlfriend's Affair",
        "script": "A few months back, I (27M) won some money on Stake and decided to surprise my girlfriend (25F) with Taylor Swift tickets for her Vancouver show. She's been a massive Swiftie since forever, and I spent around $800 for two great seats.\n\nLast week, I discovered she’d been secretly meeting up with her \"work friend\" for months. I found out because she left her Instagram DMs open on my laptop and saw flirty messages and plans to meet up. When I confronted her, she admitted they’d kissed several times and had been having an emotional affair.\n\nDevastated, I couldn't stomach taking her to the concert after this betrayal. So, I sold the tickets for $2,400—triple what I paid.\n\nWhen she found out, she completely lost it. Now, she’s calling me petty and cruel, saying I ruined her dream and that the tickets were a “gift” that belonged to her. Her friends are messaging me, saying I'm awful for using the tickets to hurt her.\n\nI feel justified in selling them after what she did. But now I'm questioning if I took things too far.\n\nTags: (relationship advice), (infuriating), (twist), (heartwarming), (revenge)",
        "tags": [
            "relationship advice",
            "infuriating",
            "twist",
            "heartwarming",
            "revenge"
        ]
    },
    {
        "id": "1flalvl",
        "subreddit": "aitah",
        "title": "My Brother's Memory vs. My Girlfriend's Expectations",
        "script": "Every year on the anniversary of my younger brother's death from cancer, I honor him by donating blood, visiting his grave, and watching his favorite movie. It’s a deeply personal tradition that I hold dear. When my girlfriend Anna asked me to have lunch with her and her mom on that same day, I explained why I couldn't. She got upset, insisting that I could do my blood donation any day and called my tradition \"stupid.\" \n\nLater, while I was watching my brother's movie, she texted again, demanding I join them. I declined once more, and she accused me of being selfish and embarrassing her. After that, she grew distant and eventually blocked me from all social media. I realized I wanted to end the relationship anyway. It feels like I dodged a bullet.\n\nTags: (family drama), (heartwarming), (infuriating), (twist), (relationship advice)",
        "tags": [
            "family drama",
            "heartwarming",
            "infuriating",
            "twist",
            "relationship advice"
        ]
    },
    {
        "id": "18n0zbl",
        "subreddit": "aitah",
        "title": "DNA Drama: The Shocking Paternity Test Result",
        "script": "I (27F) gave birth to my daughter five weeks ago, but when she came out with blonde hair and blue eyes, my husband (28M) freaked out. He demanded a paternity test, threatening divorce if I didn’t comply. While I recovered at home, he stayed with his parents, who were ready to take me to the cleaners if the test proved he wasn't the father. \n\nWhen the results finally came in, I was on the couch, and he sat beside me. As we read the results together, his expression turned from shock to horror—it confirmed he was the father. I couldn’t help but laugh and say, “I told you so!” \n\nHe got furious at my reaction and we argued until my sister intervened. Later, he left to \"clear his head,\" and his mom called me to scold me for laughing, saying I was kicking him while he was down. I’ve never cheated, but now I’m left wondering if I was the jerk for my reaction. \nTags: (partner drama), (family drama), (twist), (unbelievable), (justice served)",
        "tags": [
            "partner drama",
            "family drama",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "1ji36pp",
        "subreddit": "aitah",
        "title": "Stepmom vs. Mom: The Dinner That Changed Everything",
        "script": "I (18F) live with my dad and my stepmom (43F). My mom passed away when I was 10, and my stepmom came into the picture a couple of years later. We’re civil but definitely not close. She’s always had this weird vibe, like she’s competing with my mom. \n\nA few nights ago at dinner with my dad, stepmom, and her parents, her mom asked about my necklace, which belonged to my mom. I said, “It was my mom’s. She gave it to me before she passed. I wear it every day.” \n\nThen my stepmom cut in, saying, “Well, technically I’m your mom now. I’ve done more mothering in the last 8 years than she did in 10.” The table went silent. \n\nI just laughed and replied, “If you think being a mom is about trying to erase the actual one, then yeah, you’ve been amazing.” Her face looked like she’d been slapped. My dad told me to apologize, but I refused. I said I was tired of her acting like my mom never existed.\n\nNow my stepmom is barely speaking to me, and my dad says I “need to be the bigger person” because “she’s just trying to connect.” But to me, that didn’t feel like connection — that felt like erasure.\n\nTags: (family drama), (twist), (infuriating), (justice served)",
        "tags": [
            "family drama",
            "twist",
            "infuriating",
            "justice served"
        ]
    },
    {
        "id": "1fzjnbr",
        "subreddit": "aitah",
        "title": "My Wife Took Out a Payday Loan for Fast Food",
        "script": "Nine days ago, I discovered my unemployed wife spent $1,176 on delivery apps in a month. I canceled our credit card and moved our joint funds into my account. She accused me of financial abuse, threw tantrums, and even tried to guess my bank password. Then, out of nowhere, she seemed to calm down. I thought she had given up. But on garbage day, I found half a dozen fast food bags in the trash. Confronting her, she initially denied it but eventually confessed: she took out a payday loan to fund her takeout cravings. I was shocked she even got approved. I immediately froze my credit, paid off the loan in cash, and told her we were getting divorced. My marriage is over, and I guess she'll be living under a bridge if Uber Eats will deliver there.  \nTags: (relationship advice), (money problems), (twist), (infuriating), (unbelievable)",
        "tags": [
            "relationship advice",
            "money problems",
            "twist",
            "infuriating",
            "unbelievable"
        ]
    },
    {
        "id": "1baxuez",
        "subreddit": "aitah",
        "title": "My Wife's Plastic Surgery Changed Everything",
        "script": "My wife had plastic surgery recently. We discussed it beforehand, but I was against it. Now, she looks... weird. She had fat sucked from her face, lip fillers, a neck lift—it's unsettling. \n\nShe wants to return to normal, including intimacy, but I’m struggling. I try to initiate sex, but only in the dark. It's been months, and I dread looking at her. She noticed my distance and asked if I was having an affair. I reassured her, but she insisted on checking my phone. I had nothing to hide, so I let her look.\n\nAfter an hour of searching, she found nothing. But when she pressed me about my feelings, I finally admitted the truth: her new face isn’t attractive to me, and I’m turned off. She asked if that’s why I keep the lights off. I said yes, and she broke down, needing time alone, and went to stay with her sister.\n\nNow, I’ve been called every name imaginable. Her sister thinks I’m a terrible person for my honesty. I never wanted to hurt her; I still love her, but I can't force myself to find her attractive anymore. She looks like the blue alien from The Fifth Element.\n\nTags: (partner drama), (relationship advice), (infuriating), (twist), (unbelievable)",
        "tags": [
            "partner drama",
            "relationship advice",
            "infuriating",
            "twist",
            "unbelievable"
        ]
    }
]