[
    {
        "id": "zru0nc",
        "subreddit": "NuclearRevenge",
        "title": "Guy behind me in traffic wouldn't turn his high-beams off, so I blinded him",
        "script": "I was stuck in traffic when a guy in an Acura behind me got mad because I was keeping my distance from the car in front. He started honking and flashing his bright headlights, which hurt my eyes. After a third flash, I decided to teach him a lesson. I grabbed my 14,000 lumen flashlight and aimed it out my rear window. I revved my engine to get his attention and then turned on the flashlight. It was so bright that his automatic headlights shut off! I could see him panicking, covering his eyes, and trying to find his sun visor. After about five seconds, I turned it off, and he backed way off and switched lanes. Was it unsafe? Absolutely. Was it warranted? Without question.",
        "tags": [
            "revenge",
            "unbelievable",
            "twist",
            "traffic drama",
            "funny"
        ]
    },
    {
        "id": "nq4eui",
        "subreddit": "MaliciousCompliance",
        "title": "HOA Banned Our Pride Flag",
        "script": "Our HOA decided we could only fly the USA flag, banning all other flags, including our Pride flag that we had displayed since 2016. The day after the ruling, we received an email saying we had to take down our Pride flag. We complied, but then we noticed that removable lights were allowed without restriction. So, we bought six colored flood lights and transformed our house into a vibrant display of Pride colors. A little less subtle than the flag, but a lot more fun for anyone complaining about the flag itself and what it represents.",
        "tags": [
            "revenge",
            "unbelievable",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "gbn0ka",
        "subreddit": "MaliciousCompliance",
        "title": "My landlord tried to sell all of my equipment to competitors",
        "script": "Our leisure company faced eviction during lockdown when our landlord gave us just 7 days to vacate. To make matters worse, he advertised our entire setup to competitors, thinking we'd fail to clear out. But we took his challenge head-on! With the help of local businesses, we sold, destroyed, and removed every piece of equipment and installation. We left him with an empty shell and a hefty renovation bill. When we handed back the keys, he didn’t dare mention our missing assets. Our legal team ensured we got our deposits back, and our company survived the pandemic while he’s left with a vacant building and no potential buyers.",
        "tags": [
            "revenge",
            "twist",
            "business drama",
            "malicious compliance",
            "justice served"
        ]
    },
    {
        "id": "nfcpai",
        "subreddit": "MaliciousCompliance",
        "title": "Get rid of my vacation? Have fun replacing me.",
        "script": "I worked at a company with amazing vacation time—8 weeks for those who’d been there over 25 years. Then the owner sold to a corporation that slashed benefits, cutting vacation down to 4 weeks and eliminating personal time. They fired many older employees, including Jimmy, a grizzled veteran who was the only one who could make a crucial part for our product. \n\nJimmy was furious. With the new policy allowing unscheduled vacation, he called in sick on the first day of training for his replacement and took 10 weeks off! During his absence, he applied for other jobs and found one. \n\nOn his return date, Jimmy didn’t show up. For two days, they tried to reach him, even visiting his home. Finally, on day three, he called to resign. The company panicked because they couldn’t just hire someone to make the specialized parts. They had to contract the original owner to teach the new hires how to produce them, and when he learned what the company had done, he charged them a seven-figure fee. \n\nDon’t mess with people’s vacation time.",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "cixf6s",
        "subreddit": "NuclearRevenge",
        "title": "I Lost Everything to My Ex, Now She’s Facing 37 Years in Prison",
        "script": "My ex stole almost 90k euros from me, which I saved for 9 years. When I took her to court, I lost due to lack of evidence and ended up paying her 55k euros for emotional damages. I sold my house and took a loan, staying with a friend who helped me find a good lawyer. In just one day, my lawyer uncovered suspicious transactions from my bank account on a date I wasn’t even in the country. \n\nThen, I discovered my ex had bought my house. I had a hidden safe in the bathroom, and I decided to ruin her life like she ruined mine. With the help of a friend, I hid drugs worth 400 euros in the safe, knowing it would lead to serious trouble for her. \n\nWhen the cops searched her house, they found nothing until my friend accidentally left the safe cover open. That little stash turned into a 5k euro fine and 12 years in prison for her. \n\nBack in court, we presented video evidence proving she transferred my money, and the account was in her name. The look on her face as the judge handed down a 37-year sentence for theft and drug possession? Priceless.",
        "tags": [
            "revenge",
            "twist",
            "justice served",
            "ex drama",
            "court drama"
        ]
    },
    {
        "id": "axs30k",
        "subreddit": "NuclearRevenge",
        "title": "My Father Abandoned Me, Then Asked for My Kidney",
        "script": "My dad vanished when I was in first grade, stealing my mom's ATM card and draining her account. Despite his betrayal, I still saw him as my hero. After a few visits and countless times waiting for him, he cut off contact when my mom remarried. He didn’t attend my graduation or send a card, but emailed me to thank God he no longer had to pay child support. That was when I realized he was a coward. \n\nYears later, my father reached out, needing a kidney. I pretended I wanted to help. I got tested, and shockingly, I was a match. The day of the surgery, I smiled in his face and told him I wouldn't go through with it. I watched his confusion as I said, \"You're no father to me and you're a waste.\" I drove home, feeling satisfied. \n\nMy mom was annoyed I took it that far, but I plan to attend his funeral just to let everyone know the truth about him.",
        "tags": [
            "revenge",
            "family drama",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "vsuaqu",
        "subreddit": "MaliciousCompliance",
        "title": "**The Most Expensive Office Party Ever!**",
        "script": "It all started when my IT team was told we had to work on the 4th of July. I pushed back, but the Bad VP insisted we show up. Frustrated, I planned an office party instead. I told everyone to invite their friends and family, promising a feast on the company credit card. On the 4th, we had no calls and instead of working, we celebrated with a BBQ feast—smoked brisket, ribs, pizzas, and desserts galore. \n\nThe Bad VP called me multiple times to check in, and I casually mentioned we were enjoying the party. When I submitted the expense report, it revealed the party cost over $6,000, sparking outrage from the CEO—not about the cost, but because IT was the only team forced to work. My actions led to new rules about spending and a scolding for the Bad VP, who now faced serious consequences for her dismissive attitude towards our team. \n\nIn the end, I didn’t just throw a party; I changed company policy and stood up for my team.",
        "tags": [
            "work drama",
            "revenge",
            "office party",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "owkndb",
        "subreddit": "MaliciousCompliance",
        "title": "**I Was Forced to Get a Doctor's Note and It Backfired on My Boss!**",
        "script": "When I was in my early twenties, I worked at a supermarket and was known for being a reliable employee. But one day, after a brutal night of being sick, I called my manager, Steve, to let him know I couldn't come in. Instead of understanding, he threatened to fire me unless I showed up or brought a doctor's note. Terrified of losing my job during a recession, I dragged myself to the doctor's office, where the doctor was furious I had come in. After hearing about Steve's demands, she decided to teach him a lesson. She wrote a note stating that I was signed off for two weeks due to the unnecessary trip, which was illegal. When I returned to work with the note, Steve panicked, claiming he didn't mean it. But the duty manager backed me up, leading to a disciplinary hearing for Steve. I ended up with a paid two-week vacation while Steve had to work overtime. All because he insisted I get a doctor’s note!",
        "tags": [
            "work drama",
            "revenge",
            "infuriating",
            "twist",
            "justice served"
        ]
    },
    {
        "id": "1k11dhg",
        "subreddit": "NuclearRevenge",
        "title": "My Neighbor's Smugness Cost Him $40,000!",
        "script": "I live with my mom, who's quiet and keeps to herself. A few months ago, our new neighbor reported her for having an “illegal shed” in the backyard. It was total BS; the shed's been there for years and has full permits. An inspector came out, checked everything, and left without a word. Meanwhile, the neighbor was smug, thinking he’d scared us. So, I did some digging. Turns out, his brand-new pool was illegally built too close to the property line and over a utility easement. I reported him, attached photos, and quoted city codes. Two weeks later, the city ordered him to either move it (impossible) or fill it in. He lost the whole $40,000 pool! Now he gets to look at our completely legal shed every day while standing over a pile of dirt where his pool used to be. Mom sleeps great now.",
        "tags": [
            "revenge",
            "unbelievable",
            "justice served",
            "neighborhood drama",
            "property dispute"
        ]
    },
    {
        "id": "bom51e",
        "subreddit": "NuclearRevenge",
        "title": "My Dad's Near-Death Experience and the Ultimate Revenge",
        "script": "When my Dad was 17, he was brutally attacked by a gang of five men who mistook him for his \"friend\" Dave. Dave had a gambling problem and set my Dad up to take the beating meant for him by buying him a matching leather jacket. One night after work, my Dad was ambushed and left for dead, but two bouncers saved him just in time. \n\nMy grandfather, a career military man and boxer, was furious. He rallied his old army buddies and local tough guys to track down the attackers. In a single night, they stormed the homes of all five thugs, leaving them bloodied and broken. The attackers were too scared to talk to the police, fearing my grandfather’s wrath.\n\nBut the revenge didn’t stop there. My grandfather learned about Dave's drug issues and orchestrated an anonymous tip to the police, leading to Dave's arrest for drug possession and other crimes. He ended up with a 15-year sentence, losing everything—his family, friends, and future.\n\nMy Dad recovered from his injuries, carrying scars as reminders of that night. Meanwhile, Dave’s life spiraled into ruin, while my grandfather, though flawed, proved he would always protect his family.",
        "tags": [
            "family drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "nejr3k",
        "subreddit": "MaliciousCompliance",
        "title": "I Outsmarted My Boss with a Simple Script",
        "script": "My company redesigned our work-from-home policies, and I was shocked when I got designated to work in the office full time while everyone else on my team worked from home. I argued with my boss, but he said I was \"idle\" too often on our company IM system, which tracks availability. I work efficiently, but my job doesn’t require me to be busy for 8 straight hours. So, I wrote a simple PowerShell script that simulates keystrokes every four minutes to keep my status green. I still do my actual work and enjoy my downtime, but now I never show as idle. After a few months, my boss noticed I was \"more available\" and changed my designation to work from home. All thanks to a little icon in the software! This is why low to middle management can be so clueless.",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "unbelievable",
            "infuriating"
        ]
    },
    {
        "id": "apy6s3",
        "subreddit": "NuclearRevenge",
        "title": "CEO's Lie, Bitchboss's Downfall, and Sweet Revenge",
        "script": "I was headhunted by a CEO friend to save his struggling tech company. After landing $2M in sales, everything changed when the new VP of Sales, whom I loathed, tried to inflate my numbers to impress an investor. I refused to lie and exposed her deception during a critical pitch. Fast forward, I reported a creepy comment from the CIO about my appearance, thinking it was a minor issue. But when I casually mentioned my lawyer friend, the CEO flipped out, leading to retaliation from my bitchboss. They even canceled my health insurance right before my surgery. After months of harassment, I documented everything and ultimately resigned. My lawyer and I took my case to the EEOC, where we uncovered that bitchboss had forged my write-ups. They offered me $50k to settle, and I accepted. Sweet victory! But my revenge didn’t stop there. For 18 years, I’ve been sabotaging her new marketing company, inundating her employees with spam and chaos. Her firm is in ruins, just like she tried to do to me.",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "justice served",
            "infuriating",
            "heartwarming"
        ]
    },
    {
        "id": "ch761h",
        "subreddit": "NuclearRevenge",
        "title": "My Sister Took Down a Corrupt Job Corps Program",
        "script": "This happened to my sister, who has always formed friendships with her teachers. About 15 years ago, while studying hotel management at Job Corps, she was close with her teacher. One day, the teacher stumbled upon a paper-shredding session and discovered that over 60% of the center’s funds were being embezzled. Despite lucrative offers, the teacher refused to join in and was fired just before retirement, losing her package. My sister was furious and knew any report would be ignored, so she devised a plan.\n\nOver the next couple of months, she gathered evidence of the embezzling and crafted an email detailing everything, CCing over 2000 people including the Job Corps national director, Department of Labor officials, every member of Congress, and even the President's office. \n\nTwo weeks later, the investigation wrapped up with only 5 or 6 staff members keeping their jobs, while the rest, including the dean, faced major criminal charges for stealing millions over the years. The teacher received a generous severance package, and my sister was awarded her completion certificate despite not finishing the course—they just wanted her gone!",
        "tags": [
            "justice served",
            "work drama",
            "twist",
            "unbelievable",
            "revenge"
        ]
    },
    {
        "id": "rw9wr4",
        "subreddit": "MaliciousCompliance",
        "title": "I Got Pulled Over, But the Officer Didn't Expect This!",
        "script": "This morning, I was pulled over by a police officer after making a complete stop at a four-way stop. I turned my dash cam to face me as I rolled down the window and asked, \"What seems to be the problem, officer?\" He looked at me like I was gum on his shoe and said, \"You didn't make a complete stop.\" I adjusted my hearing aids and before I could respond, he said, \"Sir, take off your earphones when I'm talking to you!\" \n\nI took off my hearing aids and signed, \"I'm deaf and didn't understand you. Can you please communicate in ASL?\" He looked puzzled, pointed at my hearing aids like they were Apple AirPods, and motioned for me to put them back on. I replied, \"Without these, I can only communicate in ASL.\" \n\nFrustrated, he mumbled, \"For fuck's sake,\" then gave me a thumbs up to go. I rolled up the window and drove away, grinning all day.",
        "tags": [
            "unbelievable",
            "twist",
            "justice served",
            "road rage",
            "communication"
        ]
    },
    {
        "id": "fnxqdz",
        "subreddit": "NuclearRevenge",
        "title": "I Was Framed at Work, But the Fallout Was Epic!",
        "script": "I was fired from my job at an upscale restaurant after being framed for theft. The new general manager, Harvey, had a shady past and began replacing our managers, leading to a toxic environment. I often had to negotiate with Fredo, the kitchen manager, who tried to cut our hours. When I was set up for a meal I didn’t steal, I was fired on the spot. Before leaving, I recorded a conversation that revealed their plot to get rid of me. I quickly found a new job, and during the interview, I played the recording to prove my innocence. Months later, my old restaurant was under investigation after corporate received my video. Harvey was fired after his past of harassment surfaced, and Fredo was arrested for hiring undocumented workers. The fallout included mass layoffs and deportations, all stemming from my wrongful termination. What started as a personal vendetta against me turned into a corporate disaster!",
        "tags": [
            "revenge",
            "work drama",
            "twist",
            "justice served",
            "unbelievable"
        ]
    },
    {
        "id": "xzjiue",
        "subreddit": "NuclearRevenge",
        "title": "My Dad's Dark Secret: The Day Uncle Mark Tried to Kidnap Me",
        "script": "My favorite uncle, Mark, was always fun and loved to hang out with me. But one day, my dad got a call that changed everything. He screamed, stormed out, and I didn’t see him for a long time. My mom said he was just away for work. Nine months later, Dad returned, and I was thrilled. But he told us Uncle Mark was a bad person and we should ignore him. A year later, I saw Uncle Mark waiting for me after school. He wanted to take me for a ride, but I remembered my dad’s warning. Just then, my dad appeared and punched Uncle Mark in the face. After chasing him away, Dad hugged me but left again. Five years later, Mom revealed he was in prison for protecting us from Uncle Mark, who liked kids a lot. It turned out Uncle Mark had been abusing his wife and had tried to kidnap me. My dad had beaten him nearly to death when he found out. After my dad was imprisoned, Uncle Mark thought he could get away with it. But my dad found him again, and this time, he took justice into his own hands. He killed Uncle Mark in a fit of rage after discovering more evidence of his crimes. My dad was charged with manslaughter instead of murder, and he said he didn’t regret it. I told him I was proud of him.",
        "tags": [
            "family drama",
            "twist",
            "justice served",
            "unbelievable",
            "heartwarming"
        ]
    },
    {
        "id": "bc2jye",
        "subreddit": "MaliciousCompliance",
        "title": "My Neighbor's Revenge Backfired Spectacularly",
        "script": "We moved into a tight-knit community and wanted privacy in our kitchen, so my parents spent thousands on plants. A week later, my neighbor chopped them down, claiming they were on his property. Furious, my dad confronted him, but the neighbor threatened to report us if we crossed his line again. We called the plant company, and thanks to the warranty, they replanted them for free. But just a few nights later, we caught him chopping them down again at 2 AM. We called the police for obstruction of property. After a chat, he decided to get a professional to mark the property line. When I got home, I saw orange tape in his yard—his fence was 11 feet over our line! We watched him take down his fence, fuming. In the end, we got our privacy back, and he lost a quarter of his backyard, costing him almost $10,000 for the destruction. We replanted our plants and enjoyed our new space!",
        "tags": [
            "neighbor drama",
            "revenge",
            "twist",
            "justice served",
            "property dispute"
        ]
    },
    {
        "id": "tbta7d",
        "subreddit": "MaliciousCompliance",
        "title": "[The Call That Exposed My Ex-Husband's Lies]",
        "script": "I was working in the billing queue at a call center when a distraught lady called in about a $49 charge for a wireless access point. Confused, she insisted she didn’t have TV services, but I dug deeper and discovered her ex-husband had set up a contract for Optik TV and Internet—despite her living in a town without service. She broke down, revealing he had cheated, divorced her, and ghosted her completely. I felt for her and offered to remove his access and downgrade her services. Then, she had an epiphany: “Wait, you have his new address?” I confirmed I could provide it since it was her account. She was ecstatic! I shared his new address, phone number, and even the contact for the new woman. I couldn’t help but imagine his shock when he called in, only to find out he’d been cut off and exposed.",
        "tags": [
            "partner drama",
            "revenge",
            "twist",
            "unbelievable",
            "justice served"
        ]
    },
    {
        "id": "ay7m8x",
        "subreddit": "NuclearRevenge",
        "title": "I Exterminated More Than Just Bugs for Mary",
        "script": "I was an exterminator for over a decade, specializing in severe infestations, especially bed bugs. One day, I was called to an apartment where I met Mary, a sweet elderly nurse from World War 2. When she opened the door, I was horrified to see her covered in bed bugs—her hair, clothes, and even her hands. I immediately called an ambulance, knowing she was in serious danger of toxic shock from the bites. \n\nAs she was rushed to the hospital, I felt a surge of anger. This infestation didn’t happen overnight; it had gone unchecked for years. I contacted local social services and Adult Protective Services, alerting them to Mary's dire situation. I also called the news and warned her neighbors. I encouraged anyone affected to file civil suits against the apartment management, who had been neglecting their responsibilities and falsifying maintenance records.\n\nIn the end, I helped get the apartment manager arrested for elderly abuse and neglect, and the entire staff was fired. I visited Mary often after that, and while her health improved temporarily, she eventually passed away. I’ll never forget her or those who let her live in such horror.",
        "tags": [
            "revenge",
            "heartwarming",
            "unbelievable",
            "justice served",
            "elder abuse"
        ]
    },
    {
        "id": "1kay4hv",
        "subreddit": "MaliciousCompliance",
        "title": "I wore a suit to work and got my supervisor demoted",
        "script": "Ever since I started my job, my supervisor, Josh, has been micromanaging me. He often criticizes my work without giving clear expectations. After a frustrating meeting with HR, Josh told me I needed to dress better, despite my professional attire fitting the casual vibe of our small company. \n\nSo, I decided to be petty. The next day, I showed up in a full suit—completely overdressed for the office. When coworkers asked why I was dressed up, I casually mentioned that I was told to “dress better” by Josh. Their reactions were priceless, and word spread quickly. \n\nLater, the CEO came to my desk and told me I'd be reporting to him from now on, meaning Josh was demoted to just another employee. I’m riding high on this victory and might just wear another flannel tomorrow!",
        "tags": [
            "work drama",
            "revenge",
            "twist",
            "justice served",
            "unbelievable"
        ]
    },
    {
        "id": "r1gwqe",
        "subreddit": "NuclearRevenge",
        "title": "I Exposed My Cheating Cousin at Christmas Dinner",
        "script": "I’ve always been the black sheep of my family, while my cousins became doctors and professors. I made a comfortable living with a part-time job and stable passive income, but my family judged me harshly, especially my cousin Randy, the stereotypical rich bro who always belittled my choices. One day, I spotted him cheating on his wife, and after following him for five hours, I decided to take action. \n\nAt Christmas dinner six months later, I dropped printed photos of Randy with his mistress right in front of everyone, ensuring his wife saw them. Chaos erupted—screaming, fighting, and I ended up with a black eye from Randy’s dad. My family cut me off for years, but Randy faced the consequences: he got divorced and lost custody of his kids after threatening his ex. \n\nNow, I have a good relationship with Randy's ex-wife, and the kids call me \"Uncle.\" I married my SO, and my family tried to reconnect, but seeing me thrive without them seems to eat at them. I’m living my best life now, free from their toxicity.",
        "tags": [
            "family drama",
            "revenge",
            "twist",
            "justice served",
            "unbelievable",
            "heartwarming"
        ]
    }
]