[
    {
        "subreddit": "aitah",
        "title": "My husband gave me a “warning tap” and I called it abuse. AITAH?",
        "selftext": "As I am writing this, I am laying in bed with my mom. She’s helping me gather my thoughts for some other opinions. \n\nI am f24 and my husband is m30. We’ve been together for three years and married for one. This is a throwaway account just in case. \n\nAbout a week ago my husband and I got into an argument over his phone, which he had misplaced. I was in the shower when he lost it and when I came out he was throwing a fucking fit over it. He was like “where did you put it, have you seen it?” Angrily yelling and snapping. \n\nI said I hadn’t touched it and I needed to get dressed. My husband was standing in the doorway looking behind the door so I couldn’t open it. I said “hello, move please?” \n\nApparently my tone was rude because my husband turned around and shoved me into the room. I was like okay you need to calm down, I can help you look but I gotta get dressed. He tells me to hurry up. I snap back “I’m not gonna hurry up, it isn’t my fucking fault!” \n\nMy husband turned around and hit me on my mouth with the back of his hand. It didn’t even really hurt but I was appalled. \n\nHe called it a “warning tap” because of “my attitude”. I left right then and there. \n\nI called my mom and came over. I haven’t left. My brother took me over the next day to get a few things. My husband asked me if all this really necessary and I said yeah, it is when you abuse your wife. \n\nHe was so stricken that I called it “abuse”. He screamed at me for it. He said I can ruin his career if I use that word. I know that I can and I know that he didn’t even hurt me, but that’s how I feel. He sent me several texts threatening to divorce me if I use that word again, or try to hurt his career by saying it someone “important”. AITAH for saying this, potentially citing this, and potentially ruining his career?",
        "score": 72967,
        "id": "1ehlrdd",
        "url": "https://www.reddit.com/r/AITAH/comments/1ehlrdd/my_husband_gave_me_a_warning_tap_and_i_called_it/",
        "created_utc": 1722531563.0
    }
]