[
    {
        "subreddit": "IDontWorkHereLady",
        "title": "She wanted to speak to my manager, so I called the person who manages my life.",
        "selftext": "This happened yesterday, I was in Canadian Tire, for all of you non-Canadians It's like a mix between a Wal-Mart, a home depot, a bass pro shops, and an auto shop. I was wearing jeans and an old red polo shirt. The employees there wear black pants and a red polo with a triangle and maple leaf logo on the chest.\n\nI was getting wipers for my car because mine aren't clearing the rain off my window anymore... It's a riveting story.  \n\nThey have this touch screen thing there where you select the vehicle and it tells you the specific sizes you need for each wiper and brand. I was fiddling with the screen and going through the different sizes and makes of wipers and reading reviews on each one (I research everything before I buy it, drives my wife crazy) I hear someone behind me say excuse me. I think she wants to use the screen to figure out what wiper to buy, so I move to the section that has the wiper brand I'm interested in and start looking for the size I need. \n\nMy assumption was wrong. \n\nShe followed me to where I was now poking through the very badly stocked wipers.\n\nFrom now on I'll be ME, and she'll be douchecanoe, which I'll shorten to DC. \n\nDC: \"Why did you walk away from me, that's very rude.\"\n\nI didn't even know she was talking to me at this point. So I kept looking at wipers. \n\nDC: \" This is unbelievable! I'm talking to you.\"\n\nI finally click in that I'm the one she's talking to. So I stupidly turn to face her while gripping a 28 inch wiper like a toddler holds a crayon. ME: \"You talking to me?\"\n\nDC: \"Yeah you. I need to know what size wiper to get for my Mercedes.\"\n\nME: \"That's what the screen is for.\" I said as I gesture towards it with the wiper in my hand and go back to searching for the second elusive 28 incher. \n\nDC: \"You are terrible at your job, this isn't proper customer service.\" She said all huffy.\n\nME: \" Umm, I don't work here. I'm gonna go back to this now.\"\n\nDC: \"I want to speak to your manager right now. This isn't how you treat customers. Ignoring me and refusing to help me, its disgraceful.\" At this point she kind of stomps off, but only a few aisles away, and the aisles in the automotive department aren't full height ones, they are like chest height so you can see right across the whole department. She just does a few laps of the aisles around where I am, she's looking all over the place for a manager but not going far, I think so she doesn't lose sight of me. \n\nME: \"Still don't work here. So going to be hard to find that manager... and you're not listening to me... ok... \" I say to her and trail off as she's obviously not caring at all. I go back to my wipers.\n\nWhile she's on her walk I find my wiper and start to head towards the check outs. She chases me down and gets in front of me, trying to stop my escape before a manager gets there. \n\nDC: \"No! You're not allowed to leave until I speak to your manager about you!\"\n\nI've had enough of this buffoon. I pull out my phone and call my manager. I'm self employed, so I call the one person in my life who could reasonably be called my manager. The wife, henceforth referred to as BOSS.\n\nME: \"I'll call her for you, you aren't going to be able to find her here.\"\n\nI put it on speaker phone so the crazy lady can hear. As the phone rings she's giving me this superior smirk like I'm about to get my ass chewed out. \n\nME: \"Hey, how's the trip going? (She's on a business trip)\n\nBOSS: \"Great, been having a some excellent meetings with the L3's (VP level people). What's up?\"\n\nME: \" Picking up some wipers.\"\n\nBOSS: \"And you're so jazzed about them that you needed to call me in the middle of the day?\"\n\nDC is getting really frustrated at this point, I'm obviously not getting to the me getting fired fast enough for her. \n\nME: \"Nope, got a lady here at Canadian Tire who wants to talk to my manager. I kind of thought you're the closest thing to that. Want to talk to her?\"\n\nBOSS: \"What the hell Labtc?! Am I on speaker phone?\"\n\nME: \"Oh yeah, the crazy lady can hear you, how else is she supposed to talk to my manager? Say hi to the crazy lady.\"\n\nDC is finally starting to realize that I don't have a store logo on my shirt, and that maybe I'm not an employee.\n\nBOSS: \"You're such a jackass. I'm sorry ma'am, my husband is an idiot. But he doesn't work there.\" I start to laugh at this point. \n\nME: \"It's cool hun, she seems kind of slow or something. She probably doesn't realize I'm laughing at her.\" I say through my laughter while DC makes some kind of appalled noise from the back of her throat and stalks off. \n\nI managed to get my wipers and leave the store after that without any further incident. My wife thinks I was mean to her. I say I was fighting stupidity with dumbassery. \n\nTl,dr: Crazy lady demanded to talk to my manager, so I called the one person in my life who can be called my manager. My wife.",
        "score": 22446,
        "id": "6pniev",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/6pniev/she_wanted_to_speak_to_my_manager_so_i_called_the/",
        "created_utc": 1501069914.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "My Future SIL is the reason I'm canceling my wedding, and instead doing a destination wedding !",
        "selftext": "Hi I'm am using a fake account because several of my in-laws are aware of my other account.\n\nSo I am F 31, my now husband is M 30; and my SIL is F 19. My husband does not have the best relationship with his sister due to his parents favoring her (MIL F 59, FIL 59). A Little background my husband parents where having marital issues, and heading for divorce around the time my husband sister was conceived, when they found out that they were pregnant; they decided to seek counseling and get help. In the end they resolved their problems and their relationship became stronger. They view I their daughter as the reason they were able to saved their marriage. \n\nShe is spoiled, some examples; they got her a car for her birthday she totaled in 4 days, she borrowed her mom's car after and had it totaled too. Due to her reckless driving the insurance company will not allow her to be insured under her parents. We were dating at the time when his mother asked my husband if he could please put her on his insurance and she would pay. My husband at the time was buying a new car and didn't want to deal with this situation and told his mother no. Another example was we had gotten tickets to see Taylor Swift in Europe for a vacation alone. His sister found out and demanded that she go instead of me, his father called and demanded that we change our plans and he takes his sister, my husband said he could not do that because he didn't pay for the vacation or the tickets (my parents did). We were harassed for month for this. Finally 3 months after we were engaged we visited his parents; at the time his sister had a friend living with her and her parents F17. This friend developed a crush on my husband; he was extremely uncomfortable with the girls attention towards him. His sister wanted them to date an ask his parents to talk to him about it; he refused and said he was engaged and is not interested is teen girls.\n\nNow to the wedding; my in-laws are only attending if I make my SIL a bridesmaid. I agree to keep the peace and gave it to her as a honorary roll and don't expect her to be involved as much as my other bridesmaids. The problems started immediately; first she was flirting with another bridesmaids boyfriend and sending him inappropriate text (we don't know how she got the number). She refused to walk with her cousin who is a groomsman; and tried to get her parents involved to switch to walk next to the Best Man and bump my MOH. Her reason was because she couldn't hookup with her cousin. The Best man is currently in a long term relationship with the MOH and they are how we met.\n\nThe finally straw was with what she did to my MOH; my MOH is my cousin and my best friend. My MOH is the same age as me, we are born 3 month apart to the day. We get mistaken as sister or sometimes our extended family mixes us up. Our Moms are sisters. I am protected of my MOH and the godmother to her children. My MOH is hard of hearing and has to wear hearing aids due to an infection she had as a child. My MOH sometimes talks loud because she can't hear and judge her own volume. She doesn't have any accent, she had to do speech therapy for years as a child and had to attend a school for children with hearing disabilities until middle school.  My SIL has been teasing my MOH nonstop, yelling and saying I just wanted to make sure she heard me. She made reference to my Godchildren being born out of wedlock, and said her boyfriend (the best man and the father of her children) will come to his senses and find a \"tight woman\". My MOH has been quiet about all this because she doesn't want to cause problems for me and my in laws. I found out because my other bridesmaids told me after the bridal shower. \n\nAt the Bridal shower my husband and myself both were aware and gave our blessing to have His best man propose, to my cousin the MOH. It happened and everyone was as excited except for my SIL; the final straw was when my MOH was heading back to the table (she took out her hearing aids because the music was causing her a headache) the hearing aids  where in a glass of water with my SIL laughing. I was done and removed her from the wedding party, and disinvited her from the weddings unless she is in therapy. \n\nMy In-laws were blowing up our phones; say that their daughter was only joking around and that's her sense of humor and my MOH can't take a joke. They said if she cannot come to the wedding they will not come. This has been going on for months. \n\n**** few updates ****** 24 hours later (from the bridal shower)\nI call my fiancé, my husband because we are technically legally married. We just didn't have a ceremony yet; this was done earlier in the year for insurance issues. \n\nTwo my MOH my cousin was able to get her hearing aids replaced by her audiologist; (she had them insured, my Husband covered the deductible; not for his sister sake but because he cares for my cousin an is embarrassed) \n\nMy Husband family is on our side; apparently we have been flooded with phones calls and messages of support from his family. The reason why, because they also have stories of how badly my sisters in law has acted towards them. My husband has already said that, my family is his and anyone who mistreats anyone I care about is not his people. \n\nWe have decided with the help of our wedding planning to due a destination wedding pushing the wedding date back six months In Hawaii; we got most of our deposits back, family is helping with the rest. My husband has called his parents and told them they are not invited and his sister will not be invited.  They are livid and have started as of an hour ago going to social media to tell their side of the story; they clam that their daughter was just making jokes and pranks. Nobody has been buying it. They tried to contact my parents who shut them down immediately; we have other family members who also hard of hearing or deaf due to a genetic condition that runs in the family, most of the family is hearing but everyone looks out for the members that are not. They are embarrassed and hung up the phone.\n\nThis is where we are now and will update if things change. \n\n*******Some small updates; 11/15.\nWe are No contact with my Husband Patents or Sister. We get updates from my Husband Aunt (his father sister). \nFirst my MOH hearing aids are replaced after talking to her and asking what she wants to do. She doesn't want to be involved in a lawsuit or anything going forward so long if she is left alone, by my Husband sister. She doesn't want any negative energy in her life. I am going to respect her boundaries on this matter; however if anything happens she will file a restraining order against my husband sister.\n\nAs for my MIL and FIL as per my husband Aunt they are in a bind. They came crying to my husband aunt. Apparently there insurance company found out they were letting their daughter drive their cars; even though they were warned she would not be insured under their policy and the insurance company dropped them. We don't know if SIL got into another accident or someone reported this to the insurance company. However they were sobbing to my Husband Aunt they are struggling to find an insurance policy they can afford. \n\nMy Husband Aunt was tired of hearing the sob stories, and brought up the bridal shower incident and how her own daughter has been bullied by SIL. She was embarrassed for her nephew (my husband). My MIL and FIL said that SIL confessed she was jealous of my MOH relationship with the  Best man. She apparently had a long crush on him and was upset that he was getting engaged to MOH. MIL and FIL tired to excuse this behavior as a teenager girl acting out. My Husband aunt was having none of it and told them they ruined their daughter and probably ruined their relationship with my Husband and any future with us. My Husband aunt asked them to leave and said she hopes they get everything they deserve for how they treat their children. She was not going to help them with their insurance problems. \n \nMy Husband cousin 20 years old and a lovely girl, she is a beauty queen, a makeup artist. My husband sister was known for breaking her makeup palettes and beauty supplies out of jealousy. My husband aunt doesn't allow my  SIL over the house and will lock the doors to certain rooms in her house during family gatherings because of several incidents in the past.\n\nNow for SIL; she still lives with my in-laws. She lost her job nobody knows why; and frankly I don't care to know. She is not in college due to poor grades and lack of direction. She blames me for her family not talking to her, and being kick out of the wedding party (and I'm proud I did so she can blame me as much as she likes). \n\nAs for our wedding celebration. We are doing a small ceremony on the beach and any family that wishes to come can book a hotel on the main island. We are not going to give the location of the wedding or the reception until the day of the wedding except for the wedding party and we will hire security. \n We I'll update you when it happens or anything else happens",
        "score": 4491,
        "id": "1g57ew9",
        "url": "https://www.reddit.com/r/bridezillas/comments/1g57ew9/my_future_sil_is_the_reason_im_canceling_my/",
        "created_utc": 1729105840.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "...You mean at this store?",
        "selftext": "I worked at Target and there was a Hobby Lobby across the street. I ran over to Hobby Lobby after a shift to grab something and I was still wearing my red shirt with the target symbols all over it.\n\nA 20 something girl comes up to and says \"Do you know where I can find a glue gun?\" I paused and just kind of looked at my shirt and I said \"... you mean at this store or... like... at Target?\" And she just stared at my name tag for a long time and sighed a heavy sigh and quietly said \"sorry, I don't know where I am.\"",
        "score": 21530,
        "id": "9rmbg0",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/9rmbg0/you_mean_at_this_store/",
        "created_utc": 1540571763.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Bridezilla ruined our friendship of 20+ years (long post)",
        "selftext": "Right so! Best friend of many many years got engaged, immediately asked me to be bridesmaid. Was thrilled for about 0.2 seconds until she said “ha! Now I get to make you dress girly!” \n\nHer list of requirement included: dress. Heels. I had to grow my hair to at least bob length. I had to dye my hair. I had to get a tan (fake or sunbed) and I definitely had to use body make up to cover all my tattoos.\n\nNow readers, this was a gut wrencher. Anyone who knows me knows I am an absolute tomboy who feels deeply uncomfortable wearing dresses etc. But hey it’s the brides big day right? I offered to do all except grow my hair. \n\nNot. Good. Enough. Apparently I would RUIN HER PHOTOS with my crap short hair. \n\nArguments started....texts and group chats aplenty telling me I was being stubborn and it’s for one day and I should suck it up. Back and forth for a while but around that time, my dad was diagnosed with a terminal illness. We mutually agreed my dad was my priority and I stepped down from bridesmaid to guest.\n\nShe asked me what me and my girlfriend would be wearing, I replied that we had tailor made suits from a wedding last year and they would be PERFECT! She told me she didn’t want everyone staring at the two lesbians in suits and that everyone would be talking about us and taking attention away from her. \n\nPeople, i was gobsmacked. Gf refused to even go. I told bride unless she was telling all the guests what to wear she could fuck right off.\n\n\nI went to the wedding (didn’t want to be the asshole who didn’t show up tbh). It went swimmingly. An absolutely grand affair with no expense spared. I left after the first dance to get home to my kid (had been there for 8 hours at this point!) and was told the next day that at the end of the party the bride was sobbing that I left early and ruined her day. She also text me to tell me the money I had gifted her was nowhere near the cost of hosting me.\n\nSo we don’t talk any more.\n\nUPDATE: I’m getting married. My fiancée proposed last week.\n\nWe’re both gonna wear suits and bridezilla ain’t invited.",
        "score": 4100,
        "id": "c0afu1",
        "url": "https://www.reddit.com/r/bridezillas/comments/c0afu1/bridezilla_ruined_our_friendship_of_20_years_long/",
        "created_utc": 1560455216.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Grandpa gave up what time he had left for revenge on my behalf.",
        "selftext": "(Tldr at the end)\nThis is a throwaway account for obvious reasons.\n(this story has a few refrences to some triggering things just fyi)\nNow ive been debating over posting this or not, but have finally decided i will. This is my grandpas nuclear revenge on my behalf. \n\nSo i guess lets begin its going to be long sorry: \n\nI grew up dealing with alot of mental health issues, as my mother is a drug addict and my father liked to ignore my Exsistence as im the result of a one night stand while he was married, so needless to stay his wife hated me and there children treated me horribly as well. The only good people i had in my life was my grandma and grandpa on my fathers side, i loved them and spent alot of time at my grandpas buisness (ill explain that a little later)  \n\nNow at 14 everything went further down hill, i wont go into details but my mother almost passed away and i met a man lets name him goat (he looked like one) long story short goat was 25 at the beginning and emotionally, physically and sexually abused me. While i was under the precent that i loved him and it was okay. He pushed me away from my grandparents and isolated me for two years until a friend helped me get out of it. During this next year goat stalked me, threatened me and had me absolutely terrified. I was afraid of going to the police as i didnt want to bring harsh light to my grandpas buisness, and because i was afraid.\n\nI was staying at my friends house for a while during this time, as my panic attacks and what i now know is ptsd was horrible and i hated to be alone. During this time my grandmother passed away, one of the only lights in my life left. So i became worse, i began drinking and going to parties and trying to forget my life. \n\nRight before my 18th birthday goat made a real life appearance again, on my way back from a big party he jumped me, beat me black and blue and almost killed me. I was found and taken to hospital where they began treating me and as i was underage they asked me to call an adult in my life that they could talk to. I tried to call my father but he didnt pick up, knowing my mother wasnt going to help i had to call my grandfather, he was at the hospital in lightning speed and for the first time in my life i watched this man that had built his own empire really break down, even at my grandmas funeral he didnt cry. I spent two months in hospital, with police questioning me and my grandpa by my side everyday. During this time he met my friend who helped me out of it all at the beginning and became very close to him. \n\nMy grandfather helped me get on my feet for a whole year, until one day he had a large family gathering and socialized the whole time, taking me with him, that night i will never forget, we went to get icecream and then he just hugged me for a very long time, holding me tight and reassuring me everything would be okay. \n\nThe next day my grandpa exacted his revenge. Now my grandpa was the owner of a well off law firm that also had private detectives in a smaller office in his building. He apparently tracked down goat and went about his revenge. My grandpa shot goat three times in the stomach and once in the chest. Goat passed away in the hospital later that day while my grandpa was taken in and soon put in jail for manslaughter which he pleaded guilty to. I never got the chance to visit my grandpa in jail as he passed away soon after in jail from complications.\n\n\nOne week after my grandpas death i got a call from his solicitor.  And he asked me to go in, i was met with a lengthy letter from my grandpa, which was nothing but loving and showed that he had found out he had terminal lung cancer and wouldnt live much longer, but he couldnt happily leave me alone in this world without goat being gone too. My grandpa left almost EVERYTHING to me. At 20 i would inherit the lawfirm and could do as i pleased with it and i inherited 95% of his savings, his house he lived in with grandma and his other assets. \n\nIncase anyones intrested, i turned 21 last week, im currently working at the lawfirm, my grandpas secretary (now the ceo) has taken over the important things in the building and makes most of the decisions. I spent half the money i was given in locked saving funds for all of the younger family members to go to college when its time. I cut all contact off with my father who tried to steal money from me during the death arrangements of grandpa. My friend mentioned earlier in the story is now my fiance and we are getting married next summer. Im still suffering from ptsd and depression, but its getting better everyday, im in therapy for my ptsd treatment. I got a tattoo for my grandpa and grandma on my back of two lions protecting a cub. I also opened up a safe house for anyone going through abuse of any kind. No matter the race, gender or age im trying to help anyone i can in that situatuion. Besides for what ive put away for later in life im also thinking of opening up the bakery i always wanted and employing the people that need the job and help the most, but im unsure at the moment about that.\n\nMy grandpa and grandma was a god send and to this day i miss them greatly but i know i couldnt have changed the stubborn old mans mind even if i tried. \n\nIm sorry this is long, i tried to make it shorter.\n\n\nTldr: my grandfather killed my abuser and left everything the law didnt take to me.\n\nEdit: i wrote a part wrong whoops. My mother didnt die, she almost did.\n\nEdit part two: thank you so much for the gold kind stranger! Also thank you to all these comments, its so uplifting and entertaining to hear people talk so highly of my grandpa. Thank you everyone for being so wholesome and amazing! ❤❤❤",
        "score": 6509,
        "id": "bxbbyu",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/bxbbyu/grandpa_gave_up_what_time_he_had_left_for_revenge/",
        "created_utc": 1559788105.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "I know it's your number, but...",
        "selftext": "Another post on here reminded me of this one.\n\nQuite some time ago, my girlfriend and I (now my wife of more than 15 years) moved in together, and had to set up all the things.  Cable, internet, phone, etc.  We got our home phone number, our 2 cell phones, and we were off to the races. \n\nAlmost immediately, we start getting calls for an establishment that does custom framing and various other art-related things.  Let's call them \"Expo for Art.\"  Of course, we had caller ID, and we had friends that would call us, but inevitably if we didn't recognize the number it was someone wanting to find out if their order was complete, or their frame was done, of what their hours were, or any of a thousand other questions.\n\nI'm sure anyone else who had had this happen will recognize this exchange.\n\n\"Sorry, that's no longer their number, this is a residence.\"\n\n\"Yes I'm sure\"\n\n\"No I'm not giving you my address.\"\n\n\"No I don't know their new number.\"\n\n\"Yes I have a phone book, but so do you.\"\n\nEventually, after a thousand of these, and changing the message on our answering machine to say \"This is not, I repeat not, Expo for Art.  If you are trying to reach Expo for Art, please hang up, look up their number, and try that, because we aren't them.\"\n\nEventually, I got my gazillionth call, and I asked the person on the other end of the line where they keep getting this number.  \"Well it's printed on my receipt.  I guess I'll just call this other number.\"  Any chance you can give me that one?  Thanks.\n\nI call it.\n\n\"Hello, Expo for Art.\"\n\n\"You guys are still giving out my home phone number on your receipts.\"\n\n\"Yeah.  So?\"\n\n\"Well, fucking stop it.  It's been at least a year since you haven't had that number.  At least cross it out or something.\"\n\n\"That's a pain in the ass, I'm not making my employees do that.\"\n\n\"So you're the manager?\"\n\n\"I'm the owner.\"\n\n\"So let me see if I have this right.  You, what was your name again?\"\n\nLet's call him Fred.\n\n\"You, Fred have decided that it's too inconvenient to cross my home phone number off of your receipts, so you're just going to keep giving it out?\"\n\n\"Yup.  What are you gonna do?  Sue me?\"\n\n\"Maybe.\"\n\n\"Whatever.  I've got shit to do.  Bye.\"\n\nI called a lawyer.  Didn't really have a leg to stand on.  \n\nI went to the store and asked for Fred.  \"Fred's not here.  He's hardly ever here, really.  You want me to call him?\"  \n\n\"No, I'm fine.  I know this is going to sound odd, but is there any chance I can see one of your receipts?\"\n\nShe picks up a receipt book, and shows it to me.  Sure enough, it's got my phone number at the top, above another one.  I say \"I thought so.  I couldn't get you at the other number, some guy yelled at me, and I didn't have my old receipt, so I had to come down here.\"\n\n\"We've been having that happen a lot.  Ever since Fred decided we didn't need two phone lines.  But he had just bought like 20 boxes of these receipt books and business cards, and he's too cheap to buy more until they run out.  I'd hate to be that guy.\"\n\n\"Yeah, that's gotta suck.\"\n\nSo I went home, and hatched my evil plan.\n\nNext phone number I didn't recognize:  \"Hello, Expo for Art.\"\n\n\"Hi, this is Mary Smith, I dropped off a thing last week to be framed.  Is it ready?\"\n\n\"Let me check.  Yup.  We finished it this morning.  I hope you don't mind, but we decided to upgrade the matting because of the weight of the piece.  It's the same color, and won't be charging you for it, since it was my decision.\"\n\n\"Oh, thank you.  I'll be down to pick it up later today.  What time do you close?\"  I look down at the business card, with my number and the hours clearly marked 11-4.  \"Take your time, we'll be here until 7.\"\n\n\"Thank you so much, can you tell me how much that was?\"\n\n\"$19.99 ma'am, plus tax so $21.39\"\n\n\"Wow that's cheap.  Are you sure?\"\n\n\"Of course.  If anyone has a problem, tell them you talked to Fred.\"\n\n \"OK, see you around 6.\"\n\n\"See you then.  Thank you for calling Expo for Art.\"\n\nFor WEEKS I kept giving out completely random information.  \n\nHow much is a 36\"x48\" matted frame?  Let's say $24.99.  Wow that's cheap, how much to have it done custom, how they want it?  Custom is an extra $10, so $34.99.  Wow that's cheap, I'll be right down, what was your name?  Fred.  See you in 10 Fred.  How much to have the entire front page of the New York Times from 9/11 mounted and framed?  $33.99, unless you want our special, proprietary newspaper frame and mat service, only $49.99 and guaranteed for life, only at Expo for Art, tell them Fred sent you.\n\nI can only imagine the number of pissed off people who showed up to pick up orders that weren't ready, and when they finally were, were given a price WAAAAY higher than what Fred had told them over the phone.\n\nEventually, someone let slip that \"they called the number on the receipt, and that's what Fred had told them.\"  Fred was NOT happy.\n\n\"Hello, thank you calling Expo for Art, this is Fred.\"\n\n\"YOU'RE NOT FRED, I'M FRED!!!  ARE YOU TRYING TO PUT ME OUT OF BUSINESS?!?!?!?!?!‽\"\n\n\"Why Fred, whatever do you mean?\"\n\n\"Someone has been giving prices to my customers, and telling them their orders are in when they're not due for weeks.\"\n\n\"Well, Fred, who called them?\"\n\n\"Nobody called them, they called us.\"\n\n\"Then what's the problem.  If someone called you, and got pricing information, that would seem to be your problem.\"\n\n\"They didn't call me, they called you.\"\n\n\"Well, how would that happen?\"\n\n\"Your number is on my receipts and business cards.\"\n\n\"My my.  It seems to me there's a very simple solution here.  Take my number off of your receipts and business cards.\"\n\n\"Do you have any idea how much promotional materials cost?\"\n\n\"Is it MORE than it costs to do these jobs for the prices you're quoting?  Is it more than it costs to lose customers, or less than that?\"\n\n\"This is extortion!!!\"\n\n\"Call it what you want Fred.  The choices, and consequences, are entirely up to you.\"\n\nA week later \"Hello, Expo for Art, this is Fred.\"\n\n\"I'VE ORDERED NEW RECEIPT BOOKS AND CARDS.  CAN YOU PLEASE STOP THIS BULLSHIT!?!?!?!?!\"\n\n\"Sure.  Bye Fred!\"\n\nETA:  Holy smoke!!  By far my most-liked post ever.  Thanks for the awards everyone!\n\nI didn't even know platinum was a thing!  Thanks guys!\n\nEdit 2:  Since a lot of people have asked this, no I didn't let him off the hook until the calls stopped, but it was only a week or so after he called me back.  He must have paid for expedited shipping.\n\nEdit 3:  Cross-posted on r/maliciouscompliance",
        "score": 21518,
        "id": "no8mm3",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/no8mm3/i_know_its_your_number_but/",
        "created_utc": 1622371633.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "I. DID. NOT. ACCEPT. THE. JOB. Now please let me enjoy my holiday",
        "selftext": "This happened about 4 years ago when i was looking for work.\n\nMy Second Interview was for a 'Marketing' position at a new firm. The interview went well and i was offered a trial shift the following Monday. On turning up it became clear that this wasn't a marketing job but a door to door sales job for what was basically a huge MLM. The 'service' was to sign people up for charities on monthly donations. To make matters worse we were told to lie to consumers about our pay status (we would make a commission effective to their first 2 months donation, my 'boss' would then get another month and the company would get the rest equivalent to 6 months donations). We weren't supposed to tell people that and had to tell them we were salaried (we weren't - i only found out during the trail it was commission only)\n\nSo far not so good. When they 'offer' me the 'job' I let them know I have another interview lined up the following day and tell them I'll let them know by the end of the week.\n\nThe interview goes well, it's a real (albeit temporary role) and I'm offered the job and inform the MLM of my decision. This is somehow a 30-minute call where he's still trying to convince me to work for him with me saying i'm not interested at all.\n\nFast forward to the next Monday and i'm rudely awoken at 9:15 with a phone call. I answer to this: (i hadn't saved his number)\n\nMe: Hello Me Speaking\n\nMLM: Where the hell are you?!?!?\n\nMe; Sorry? wh-\n\nMLM: You were meant to be here at 8:30 - this isn't a good start to your first day is it? Why are you so late?\n\nMe: Sorry but who is this?\n\nMLM: It's (not the interviewer) from \\*\\*\\*\\*. you know the company who YOU work for, it's too late now your team has left, you better be on time tomorrow\n\nMe: Sorry there must've been a misunderstanding, i got offered a job at xxx and accepted that role, sorry for this.\n\nMLM: well you should have told us this, it's not professional to just not turn up and we would've hired someone else, now your team is short staffed...\n\nme: I told \\*\\*\\*\\*, maybe check with him, anyway i need to go, bye\n\nHoping this is resolved i get up and go about my day. Tuesday morning i am again awoken to the same guy demanding reasons for me not turning up to work (Apparently not working for them isn't a valid excuse)\n\nThis amazing continued until the following Monday where i was 'let go' for 'unauthorized' absences.(when asked if this means he'll stop phoning me he told me to grow up and be professional about it)\n\nThink i dodged a bullet there...\n\n&#x200B;\n\nEDIT: Wow this really took of, thanks for the gold XD also updated spelling to Would've, Should've",
        "score": 21457,
        "id": "9unzwz",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/9unzwz/i_did_not_accept_the_job_now_please_let_me_enjoy/",
        "created_utc": 1541508401.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "couplezilla story",
        "selftext": "my husband was asked to be the best man at his friend’s wedding. the couple decided to not get married for 2 years so they had time to plan their dream wedding and save for their honeymoon to an expensive location. that’s cool, to each his own.\n\nthe planning process was a nightmare, several friends had dropped from even attending the wedding due to the bride’s awful attitude and the groom’s sense of entitlement.\n\nabout 6 months before the wedding, the groom asked my husband about the bachelor party. my husband told the groom that he and the other groomsmen would get a limo and do a bar crawl (with some adult entertainment) at a great spot close to home. the groom said nothing.\n\nthe following day, the bride sent a group text to all groomsmen, ripping them a new asshole, that they’re fucking useless and she can’t believe she’s doing their job for them. she said that they’ve had two years to plan and save, and the bachelor party needed to consist of at least a 3 day weekend in Vegas, renting a suite at Caesar’s Palace, and treating the groom like a king and footing the entire bill (i should note, “The Hangover” was a really popular movie at the time.)\n\nmy husband texted the bride outside of the group text and told her that some life issues had come up and we couldn’t afford an extravagant weekend in Vegas, but the bar crawl would be great and the groom would surely have a good time.\n\nnot good enough. she texted paragraphs about how our money problems were not her problem and if he couldn’t do this, they would find another best man who would.\n\nmy husband, never one to hold his tongue, let alone have a filter, said to her, “why would i spend all this money? you’ll be divorced in 2 years.” he was Jazzy Jeff’d out of the wedding party and we were uninvited.\n\nthe groom ended up having two bachelor parties - one in Vegas, the other in Montreal - with 2 people in attendance at each.\n\nthe “happy” couple filed for divorce 23 months after they were married.",
        "score": 3910,
        "id": "oj6fej",
        "url": "https://www.reddit.com/r/bridezillas/comments/oj6fej/couplezilla_story/",
        "created_utc": 1626143899.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "Husband goes full drill sergeant on a Karen",
        "selftext": "Before I start this story I have to tell you about my husband. I'm French and we met while he was on vacation in Europe, one thing lead to another and now I live in Ohio with him. He is a hard working gentleman, an army veteran of 2 conflicts, and thought he has a very serious and almost hostile demeanor (think resting bitch face, but angrier and on a guy) he is a big teddy bear, quick to make a joke or pull a prank and easy to laugh. He is also VERY protective of me. Since I'm not here to gush on him, I'll go on.\n\nWe were out getting groceries last week, as we were checking out I was bagging up all our stuff because the store now requires that you bag your own goods if you bring your own bags. No big deal. He pays, and I stay to help a very elderly lady behind him bag her groceries and put them in her cart (he had helped her unload them) and we offered to help her put them in her car. She shuffles away from the register and I move to follow, as I turn away I hear behind me \"Where the HELL do you think you're going?\"  \n\n\nI turn to see a very angry looking woman glaring at me. I told her politely that I didn't work at the store and I had just helped the elderly lady to be polite and that I was now leaving with my husband to go home. I had never met an American Karen before so I thought this would be the end of it, I turn to walk away and feel a vice grip on my arm. \"Don't be LAZY! Just do your job and help bag my groceries!\"  \n\n\nI didn't even have time to respond, she had barely finished speaking when my husband wrenched her hand off me and was yelling in her face. This was the first time in the 10 years we've been together that I saw the old soldier come out, his nose might have been 3 inches from hers and his voice was loud and frightening, \"WHO THE F\\*\\*\\* DO YOU THINK YOU ARE? HOW DARE PUT YOUR HANDS ON MY WIFE! SHE TOLD YOU SHE DOESN'T WORK HERE, ARE YOU TOO F\\*\\*\\*ING STUPID TO UNDERSTAND SIMPLE ENGLISH? GO PAY FOR YOUR SHIT, BAG YOUR OWN DAMN GROCERIES AND DON'T YOU DARE UTTER ANOTHER F\\*\\*\\*ING SOUND!\"  \n\n\nThe the silence after that was intense, a store full of people could hear a pin drop. The look on her face wasn't even angry, it was pure terror. She shuffled back to here isle and waited for the cashier. My husband went to the old lady and said, \"I am so sorry you had to hear all that, ma'am. I apologize if my language was offensive. I hope you will still allow us to help you load your groceries into your car.\"  \n\n\nIt was surreal, like he had just flipped on a switch and flipped it back off.  \n\n\nAlso, we got chased down by the store manager who suggested we could be banned because of the yelling and bad language. Husband just shrugged and said they had better ban the Karen too for assaulting me, and that there are other grocery stores in town, we just go to this one because it's close. Didn't get banned.",
        "score": 21071,
        "id": "gn0j3m",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/gn0j3m/husband_goes_full_drill_sergeant_on_a_karen/",
        "created_utc": 1589933053.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Update from Bridezilla ruined our friendship of 20 years",
        "selftext": "Remember this post? Well here’s an update \n\nhttps://www.reddit.com/r/bridezillas/comments/c0afu1/bridezilla_ruined_our_friendship_of_20_years_long/?utm_source=share&utm_medium=ios_app\n\nI’ve been no contact with Bride basically since her wedding. \n\nA lot of mutual friends have stopped contact with me because of what bride has been saying.... Bride has a habit of changing the narrative of any story to make herself look like the good guy (ex, for her wedding I was the asshole for not agreeing to all bridesmaid rules, her dress code for me as a guest, not helping with planning more because I was choosing to spend all my time with my gf. She conveniently leaves out the fact my dad was terminally ill then died during this time, leaving me with no parents and an autistic son who lost his bestest buddy in the world. Guess what was my priority).  \n\nSo I’ve been bombed out from friends engagements, hen parties, baby showers etc for the past year. Hurt that they chose to believe whatever she says but again lesson learned for me. \n\n\nSo here’s the update: Last weekend, my girlfriend proposed! Oh god we were so thrilled, immediately phoned fam and close friends and then officially changed our fb relationship status to engaged. So, what has bride from previous post got to do with this?\n\nShe texted mutual friends and claimed I had obvs blocked her from seeing our engagement post but she was so hurt that I would go out my way to do that to her.\n\nI took a screenshot of HER LIKE on our engagement post and sent it to all our mutual friends in a group chat and said uh no. She’s telling you lies again, it’s almost like someone else being the centre of attention annoys her isn’t it? I left it at that cos I ain’t wasting more head space than I already have on someone who squeezes the joy out of my life.\n\nBride will not be invited to any wedding related things. We are fucking off to Vegas with our families and having an absolute blast.\n\nPs we’re gonna wear suits",
        "score": 3659,
        "id": "cutrk0",
        "url": "https://www.reddit.com/r/bridezillas/comments/cutrk0/update_from_bridezilla_ruined_our_friendship_of/",
        "created_utc": 1566655423.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "This isn’t a dog daycare at all",
        "selftext": "*tl;dr at bottom* \n\nA while back I was working in an office that allowed dogs. It was an open floor plan and since customers never came into the office, we kept the dogs food and water bowls right by the front door just because it was the most convenient space and no one else would see them but us who worked there. \n\nOf the six of us who worked in the main office area, I was the only one who didn’t have a dog (no pets policy at the apartment) and always felt horribly left out. \n\nTo make matters worse, across the way was a doggie daycare. One day a very frantic woman came in and she had an absolutely massive basset hound with her. Usually the only people who came into the office were associates who had appointments with someone working there, but it was rare they brought their dogs. \n\nShe ran up to me and said “Do you work here?” And I said “Yes, how can I help you?” And she said “I wasn’t sure if you took walk ins but I read online I could just drop him off? I tried to call but no answer.” \n\nI didn’t know what she was talking about at that point and I said “Come again? Who did you call exactly?” Thinking if I could just saddle her off to whoever she came to see, I wouldn’t have to decipher her problem. \n\nShe said “Well it doesn’t matter now. Look, something urgent’s come up and I really need to leave him here. Here’s his food he likes and I’ll be back in a few hours and—“ at this point I wasn’t thinking of the doggie daycare. I thought maybe she was a friend of someone here. \n\nI said “Well alright, can I get your name please?” And she said her name and then asked if I needed her to sign anything and I was so confused at this point I just said “Why would I need you to sign something?” And she left almost immediately.  \n\nSo I took Otis (the dog) to the back and showed him to my coworkers and no one knew the woman or dog. I was worried she wouldn’t come back, but at the same time, my wish for an office dog had been granted! And Otis was supremely chill. All he did all day was lie around and drool onto his own ears. I just freshened him up every now and then, took him out every couple hours, and he was happy as a clam on a big cushy dog bed we thankfully had an extra of. He just loved attention from anywhere he could get it. \n\nAt the end of the day the woman, thank God, came back. She said “Thanks, you’re a lifesaver. How was he?” And I said “He was a champ.” And was about to say “But why is he here” when she said “Thats a relief. Most kennels say he gets anxious around other dogs. I heard you operated at a much higher capacity, I was thrilled to see you had so few clients in the room at one time. So, how  much do I owe?” And that’s when I realized she thought we were a dog daycare. \n\nNow, I probably should’ve corrected her. But I loved my day with the office dog and I did want to get paid for supervising this strange dog all day. I just threw out the number that sounded fair and appropriate “That’ll be $20.” I said. \n\nShe replied “Reaalllly?!” In this very high tone, and I couldn’t tell if I’d overshot or undershot. But she paid me and left. \n\nMy coworkers were laughing hysterically when they realized what had happened and we thought it would just be a good story for the future. \n\nBut the next week... she came back! She said we were so much more affordable and less overcrowded than her other place that she was happy to use us. I was glad for the company so just took him. I didn’t think there was any way she couldn’t have at least some idea we weren’t a dog daycare. The whole ordeal was so strange I just figured “don’t question a good thing.” (I was much younger and dumber then.)\n\nNot long after, Otis started getting dropped off two, sometimes even three or four days a week. I was in heaven. He was such a love. And he made fast friends with the delivery guys and visitors. \n\nOne day we took our office Christmas card photo and Otis was over that day, so we included him. In a Santa hat. It was pretty great. \n\nBut it turns out Otis’ owner was friends with one of our clients who I guess happened to have the card out on her table or was kind enough to display it alongside her other holiday cards. \n\nBecause one day Otis’ owner came in holding the card and walked up to me and said “I can’t even believe I’m asking this but... is that my dog in this photo? This isn’t a dog daycare at all. This is just an office, isn’t it.” \n\nShe said it with a note of surprise, as though she was looking around and putting it all together for the first time (no coincidence that this was the first time she wasn’t in some crazy rush either.) She was like “Then who are all these other dogs?!” And I explained. \n\nI was *terrified* she was going to demand her money back, or worse, take some sort of legal action against us for misrepresenting ourselves as a dog care business, or complain to corporate.  \n\nInstead she basically said “Why didn’t you ever say anything!” And I explained we just really liked having Otis around. She stopped for a minute and seemed to be thinking and said “Is that right?” And I said yes and told the story of how I was the only one in the office without a dog so loved the company. \n\nShe seemed a little flummoxed or hesitant, understandably, because the whole thing was so weird. She turned to my coworker and asked if I was telling the whole truth (I don’t know why she thought my coworker, also a stranger to her, was any more trustworthy than me, but hey.  Strange times.) Coworker backed me up. \n\nSo she said, “Well, I wish you’d said something sooner. Could’ve saved me a lot of embarrassment with my friend back there. Alright, I have to get going. See you at 4:00.” And she left Otis! I couldn’t believe it! \n\nI said “So he can stay?!” And she replied “Where else could I find someone to watch him one on one all day for $20?” And off she went. \n\nOtis stayed my office dog until his family moved away, luckily right around the same time I took a new job. \n\nWith all this time sitting around doing nothing, thought it was as good a time as any to tell that story.\n\n*tl;dr - Woman drops her dog off in our pet friendly office, thinking it’s a nearby dog daycare. It becomes a regular thing. She doesn’t realize the mistake until she spots the dog in our company Christmas card, months later.* \n\n*Edit: This was a while ago, corrected a couple minor misrememberances.*\n\n**Edit 2: Thank you so so so much for all the kind comments and awards! I am so happy you all could enjoy Otis as much as we did.**",
        "score": 20555,
        "id": "fnhqhe",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/fnhqhe/this_isnt_a_dog_daycare_at_all/",
        "created_utc": 1584959244.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Update.  Coworker asked me to be her Man of Honor.  I said no.  She went nuts.  What did I miss?",
        "selftext": "Hey everyone.\n\nFirst I apologize.  I never thought this was going to go as crazy as it did.  I want all of you to know I read all of your responses and responded to as many as I was able to.  Thank you all for your amazing insights and comments.  Many that made me laugh.  Which I needed.  I have been sick and that really helped to cheer me up.\n\nI had to meet with my lawyer today regarding family issues.  My neighbor/best friend/coworker L took me.  I really felt awful and driving wasn’t a good idea.  We were talking about this on the way and we both were asking a lot of the same questions that all you were asking. The big one was that we were asking about the circumstances of her transfer.  She went from Med Surge 4W to the ER.  That is a huge change.  I have to work tomorrow so we will see what happens.  But L and I are going to ask K about the transfer and raise a couple of other concerns. After I got home from the meeting with my lawyer I slept for the rest of the day.  \n\nMany of you asked about if C and I hang out outside of work.  The answer is no.  I really don’t know anything about her.  I have helped her a few times with patients and different things.  But our relationship is 100% purely work related. That was why I was so surprised that she asked me to do this. That is why I was so surprised that she asked me about being the Man of Honor. I have a very small friend base and in all honesty I like to keep it that way.\n\nI really have no interest in being a part of this.  I’m not a wedding person.  After reading so many Bridezilla stories and hearing about over the top weddings they have become a huge turn off to me spending tens of thousands to hundreds of thousands of dollars with insane unrealistic demands that turn people against each other.   Why???? I would rather use that money and spend that time planning my next trip or vacation. \n\nMany people said that I was being used as a token or prop in a wedding. Or a gay Best Friend.  I never really thought about it.  I admit that I’m out and proud. But I’m not going to just pretend to be someone friend just so they can fulfill some kind of fetish they have for wanting to have a gay best friend or some kind of status she feels the need to fulfill.  It takes me a lot to get offended but if this were actually the case then I would really be rather offended.  I was not put on the face of the Earth to be someones play toy.\n\nA lot of people have said that maybe she doesn’t have a boyfriend.  She does. She has brought him in before.  If she has any insecurity I don’t understand it.  She is attractive, smart and knows he stuff.  So I’m at a loss as to why she is acting like this.\n\nA lot of people say go to HR.  I’m starting that process with my boss K. She is completely aware of the situation being with us when all this happen.  She has told me that she is watching the situation and will jump in if I need her to. I trust her completely.  While K and HR can control the situation from the hospital they can’t control the situation from a personal level if she were to maybe follow me home or a situation like that.\n\nSo I think that covers it all. I wish I could say this is over.  But most likely there is more to come.  Set your update me.",
        "score": 3643,
        "id": "1gfziei",
        "url": "https://www.reddit.com/r/bridezillas/comments/1gfziei/update_coworker_asked_me_to_be_her_man_of_honor_i/",
        "created_utc": 1730328095.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "CAVEMAN SPEAK",
        "selftext": "So in the '90s I rented a large workshop with two friends. I was a woodworker and the other two were metal workers so obviously none of us resembled the previous business, which had installed skylights, in any way.\n\nCue the customer of the previous business. C. I have condensed this as the verbatim conversation went on for a \\*very\\* long time.\n\nArrives at my door. A real \"Karen\".\n\nC: \"I need repairs done to the skylights you installed\"\n\nMe: \"Sorry, that business has moved and I don't know where they are now\"\n\nC: \" No, I need you to send someone over NOW. The Skylights are leaking\"\n\nMe: \" As I said, that business has gone. We are a different company.\"\n\nC: \"No, RIGHT NOW!\"\n\nRepeat the above a half dozen times...\n\nAbout now I am realizing I am dealing with either  genuine looney or else someone too entitled to listen to plain common sense. I try another tact, caveman speech, who knows it might get through.\n\nMe: \"Skylight business gone. New business come. You talking to new business now. Unnerstand?\" (Ook)\n\nC: \".........uhhh?\"\n\nMe: \"Nooooo skylight here!!! Try look in fucking phone book! You bugger off now!\"\n\nC leaves in a big huff.\n\nIt's all about communication folks.\n\n&#x200B;\n\nEDIT Ok, all replies must be in caveman speak!!!\n\nEDIT 2. Wow! This has turned out to be popular! Thanks for the gold, it was delicious!",
        "score": 20421,
        "id": "atv9fz",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/atv9fz/caveman_speak/",
        "created_utc": 1550926771.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Revenge is a dish best served cold, mine has been cooling for 10 years and counting.",
        "selftext": "I(40F) have been married to my husband (44M) for 20 years now. We have 2 kids 16F and 13M. My husband is what I would consider a high earner by middle class standards. Also, strap in folks, this is going to be long. I've never told anyone, so...\n\nTldr: my husband cheated on me, I dragged the guilting for almost a decade, then ruined his life and chased him out of town.\n\n10 years ago, and by complete coincidence, I found out that my husband has been cheating on me, with men, and that from before we got married.\n\nWe live in a small-ish town in the south of the USA, him coming out as gay will have consequences. I believe that that is the only reason he has not come out to anyone.\n\nFirst, here's how I found out he was cheating on me: he got sloppy, left a credit card bill (for a secret card) in the pocket of a coat. While going through it I found all the telltale signs of infidelity: payments to a hotel in a nearby county, restaurant bills, gifts, flowers, condoms and lubricant...etc. I started camping outside the hotel on days he told me he would be late, and I saw him bringing different men there.\n\nI am very good at compartmentalization an have a great poker face (comes with growing up in an abusive household), so I was able to give myself the time to cool off, and to come up with what I should do.\n\nFirst thing I did was getting an STD panel, since I didn't know how safe he was with his partners. It came out negative. Then I convinced him that we should use condoms, since I was having side effects from the pill. He was ok with it.\n\nI had a long think, and I came up to the decision that I was not going to confront him, nor was I going to leave him. He was able to provide me a really good lifestyle, one that I would never be able to afford with my highschool diploma (a cleaning lady, a nanny to help with the kids, regular spa days and a country club, a new car every other year, luxury family vacations every year...); he was a good dad, a good partner (the cheating aside), and really good in bed.\n\nBut I was not going to let him have a single guilt free week in his life. That would be my revenge.\n\nI started small, planning great date nights for us, telling him that I felt our relationship has cooled, that I wanted the spark back. Then I would sometimes slip into conversation some *tea* about a cheating husband, a *gasp* gay man that has been using his poor wife as a beard, complimenting the only gay couple we know for having the courage of being real men, who were out and proud of themselves... On the other hand, I would praise him as the perfect husband to anyone and everyone, especially if he was in earshot. The amount of guilt gifts I got was astounding. The man was even sending me flowers weekly.\n\nIt continued the same way for years, I could literally see how much it was weighing on him. Me? Well, my parents were part of a commune with the concept of free love, I was the same. I just considered myself in an open marriage. It seems that cheating is easier to ignore if you are not that big on monogamy in the first place. And my husband was keeping me satisfied, so I felt no need to find a partner of my own.\n\nThen four years ago, I guess he met the love of his life. He started seeing just the one guy. I was seriously thinking of ending the whole thing, especially since I have started a business by then, and was able to bring in enough money to support myself and my kids, while maintaining my lifestyle. But then he went and introduced his side piece to us. He fucking brought him into our house, introduced him to our kids, and that was enough for me to keep tormenting him. Apparently he was a new *friend* he made while *golfing*. \n\nHe started hinting at moving to another state, one where it would be easier for him to come out. I refused, I told him that my business was here, and I was not going to start over in another state. Also the kids had their friends and extended family here, it would be unfair to uproot them.\n\nThen he started trying to start arguments, I guess he wanted us to fight, then for me to ask for a divorce. I just stopped all those arguments in their tracks. I would just agree with whatever he said: he was right, I was wrong. And to make it up to him, how about a nice dinner and some great sex? He hated that. I knew from spying on his phone that having sex with me felt like *cheating* on his BF (the audacity of this man). I also knew that his BF was pressuring him to leave me almost every day.\n\nHe was stuck between a rock and a hard place. He started drinking, and when it got too heavy, that was when I decided that enough was enough. I wanted to ruin his life, not his health. Also, I grew up with an alcoholic father, and did not want that for my kids.\n\nSo I gathered all the evidence of his infidelity over the last 9 years, photos with different men, conversations, his Grindr profile (even though he no longer had one)... Everything. Then I hired a divorce attorney, and mailed the evidence to his employer (he has a morality clause in his contract, and adultery breaks it), all his relatives (including parents) as well as our church (his actually, I was never big on religion like him).\n\nIt was like a bomb exploded. He was fired, the congregation turned on him (for cheating, not for being gay, let's keep that straight. I would never allow me kids to be part of a church that discriminated against their father, even if he was not out), his parents wouldn't take him in after I kicked him out, and he was shamed publicly (gotta love that small town gossip mill).\n\n And the cherry on the top? his BF was run out of the town, and he couldn't follow him because he wanted to fight for custody of our kids.\n\nNow almost a year later, I am a free woman. I got to keep the house, my car and my business. He got 75% of the retirement and investments accounts, but he won't be paying alimony. I got full custody, he got visitations. I also got child support.\n\nHe had to move 6 hours away to find a new job, couldn't put the last job he worked at his whole life as a reference, his relationship with his family is rocky, his reputation in town is ruined (so he can't move back amy time soon), the *love of his life* left him for good, and my kids only tolerate him because I did my best to shield them, and to tell them that he is still a good father to them. I also made sure to treat him politely, never talked bad about him, and had a lengthy talk about how their father being gay is ok, it's who he is and that it was not his fault. That the only wrong thing he did was hiding it from me.\n\nSo I guess the results of his cheating was years of guilt followed by a ruined life.\n\nEDIT: Let's make something clear. I am not the good person in this story. We were both bad. I am not here trying to get pats on the back, or to be told that I did well. I know that what I did was messed up. I am here because I wanted to tell someone, and I can't do that IRL.",
        "score": 6493,
        "id": "11pkl6z",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/11pkl6z/revenge_is_a_dish_best_served_cold_mine_has_been/",
        "created_utc": 1678642878.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Bridezilla wanted a refund from all vendors/services, months after the wedding",
        "selftext": "I'm currently finishing up a commission of handpainted wedding signs for a friend of a friend. So far the bride to be has been super lovely and very understanding of some issues faced along the way. \n\nAs a background, I'm really good at what I do, but am not a trained 'professional'. I'm very open and honest with this. I also suffer from nerve damage in my upper back, neck and left shoulder, plus frequently get RSI. So small tiny texts in print style font can be difficult to accomplish. Something I'm also honest about. If you want print style text, it will not be 100% perfect and look like it's been printed.\n\nAnyway. A few years ago I was commissioned by a coworker to paint 2 large signs for their daughters wedding. She wanted print only text, I explained how it wouldn't be 100% perfect but she said she was fine with it. That it gave it that handmade feel.\n\nAbout 35 hours later and a lot of physical pain, the signs are completed. She's happy with them, gushing over them when I delivered them in person. The signs were completed, delivered and paid for ($200 including canvases and paint) with 2 months left until the wedding.\n\nThe big day comes and goes, I see photos from my coworker, the signs looked beautiful, as did the whole day. \n\nAbout 6 weeks later I get a message from the new bride. Stating she had noticed imperfections in the signs, some of the letters were slightly uneven or bigger than others. She agreed it wasn't too noticeable but others had apparently commented on it. She was requesting a partial refund of $100. \n\nSo I explain that to give her a refund, meant that I'd only be paid $30 for my work. $30 for 35 hours of work and physical pain. She had 2 months to tell me she was unhappy but didn't. That she herself loved the signs. I also reminded her of our earlier communication. Because of the style of font she chose, it would not be perfect and she was aware of this. I also denied her refund. She blocked me and I thought that was it. Until a few days later when I recieved a notification from my bank, she had requested a charge back. This was easily disputed with my screenshots of our conversation and photos of the actual signs. Her charge back was denied.\n\nThat coworker stopped speaking to me at work, I figured that anyway. Turns out, the new bride had requested partial refunds from every single vendor and service recieved for her wedding. The venue, the catering, the photographer, her hair and makeup artist, the list goes on. She had chosen to leave her job and become a full time dog breeder, it didn't work out. The majority of her wedding was paid for by her credit card, now she was in debt, fighting with her new husband over her excessive spending. Apparently he'd given her full reign to do whatever she wanted as long as she didn't pester him with organising it. \n\nTo go into debt over one day is ridiculous in itself, but to try and scam small businesses and people doing you favours, is another.",
        "score": 3550,
        "id": "1iwk30t",
        "url": "https://www.reddit.com/r/bridezillas/comments/1iwk30t/bridezilla_wanted_a_refund_from_all/",
        "created_utc": 1740343571.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Update Conclusion:  Coworker asked me to e her Man of Honor.  I said no.  She went nuts.  What did I miss?",
        "selftext": "***Edit***\n\nThis is copied and pasted from a prior comment. \n\nA 14 gauge needle/IV catheter is the biggest that you can use. If they are ever used it's mostly on EMS sites and if it's being used it's usually for rapid infusion or the patient is shutting down and you need to get fluids in in a hurry and can't get a vein with the standard size.  Realistically you should never have a reason to use a 14 gauge. And if you do in my opinion then you better have three other people with you to help do this.  I hope in my lifetime I never have to use one. \nAlso.  The HIPPA notice. It's one of the first things you learn at the beginning of Nursing School or Med School.  Basically HIPAA is keeping a patients privacy.  What you can do is talk about the case as long as you don't reveal any information regarding the patients identity. Also opening a patients file that you have no reason to open in also a violation of HIPAA as well. \nThese are serious offenses and could result in loss of license.  \nWith that being said take this information and do with it what you will and form your own opinion.\n\nHi Everyone.\n\nFirst I apologize for not responding sooner.   I have always tried to do what I can to stay engaged with all of you and to respond as often as possible.  Truth of the matter is that I hit a brick wall.  Between everything with my parents, being sick and then the Bridezilla I just kinda lost all my motivation to keep the conversation going.  But I will say this.  I read all of your comments everyone one of them and there are not enough words in any language to say thank you for all the amazing support, feedback and suggestions. I am truly grateful for everything all of you brought to the table.\n\nI went back to my lawyer the other day and told him everything.  I told him I only had her name but I did not have her address and since he has resources that I don’t I wanted him to find her and send her a Cease and Desist letter to not contact me. He was looking into this.\n\nThe good news.  C has been terminated.  While I am not able to talk about all of the details, I can say that this goes a lot deeper than what she did to me and after K did some digging it brought out some information that could have put our hospital in a serious position.   When this information was brought out in the open it gave the Director of Emergency Nursing (DEN) no choice but to terminate her and it could put the DEN in a serious position as well. Honestly it has K, L and myself looking at potentially looking for new jobs if this doesn’t get properly corrected.  None of us want to change hospitals, because then we have to start all over with seniority, and benefits.  It's a last resort, but it's still something to consider.\n\nI guess I can say that this is closed.  At least I hope it is.  I need to move on with my life.  I doubt that C will be dumb enough to contact me.  She is in enough trouble and this would only make it worse.  Again I apologize for not being able to keep up with responding back to all of your comments, but again.  I can assure you that I read all of them and value all of them as well.  Thank you again for the amazing support!!!",
        "score": 3439,
        "id": "1gnp4eg",
        "url": "https://www.reddit.com/r/bridezillas/comments/1gnp4eg/update_conclusion_coworker_asked_me_to_e_her_man/",
        "created_utc": 1731201324.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "“I don’t care if he is dead, put him on the phone.”",
        "selftext": "I was sent here on a recommendation from another sub with a story you guys might like. First time poster, on mobile, etc. TLDR at the bottom.\n\n My father died on Father’s Day 2012. He was divorced and living alone, and I am an only child. So that means that I had to wrap up all of his affairs. This story centers around us trying to get his utilities canceled.\n\nI called in to see what we had to do to get them to cancel. The lady I spoke with on the phone said to send in his certified death certificate. I sent in the certified copy of his death certificate the next day. The next month got another bill. I called again and a new woman answered. She said that because I wasn’t on the account that she had to speak with the account holder. I informed her that the account holder was dead but she wouldn’t budge. I had to make an appointment with a supervisor so she could speak to him herself in person. \n\nI showed up at the board of public utilities with another death certificate and HIS ASHES IN THE CLEAR BAG that they returned his remains in. I plopped them down on the center of her desk and said when she talked to him to tell him that I loved him for me. The woman went pale, flew out her chair, and called the cops. \n\nWhen they showed up she claimed that I had assaulted her. And yes my dads remains were still sitting in the middle of her desk with the death certificate. The cops questioned me as to why I would do that. I told them the story. The supervisor’s boss was called in and they all stepped away from the desk for a private talk. While they were talking the cops came over to talk to me. They said that I shouldn’t take human remains out in public, but there was no laws that were broken. I said that I agreed with them that it was extreme, but she insisted to speak with him in person. By then they were done talking between themselves. The supervisor’s boss kissed up to me and got it taken care of.\n\nBut the story isn’t over yet! I had to call back a few days later to get utilities back to the house in my name. When the person on the phone saw the address and my name, I was immediately put on hold. The supervisors boss that finally helped me got on the phone. She sucked up to me and waived all of the fees that come with setting up utilities. Just as the call was ending, she informed me that she was again so sorry for the employees lack of compassion. She said that the employee was terminated and again she is so very sorry. \n\nTLDR: Ignorant employee asked to speak to dead dad. Had a meeting in person, brought his ashes, got her fired.\n\nEdit: I can’t believe this blew up! I’m so grateful for all of the love and support in this post. And for those who doubt the validity of the story, I hope when you are in my shoes and doing the same that you have an easier time than I did.",
        "score": 56737,
        "id": "ab5k9a",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ab5k9a/i_dont_care_if_he_is_dead_put_him_on_the_phone/",
        "created_utc": 1546247353.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "!!! UPDATE: AIO for demanding to be paid after wearing something inappropriate to babysit",
        "selftext": "Hi! So this is an update to the post I made last night about a babysitting fiasco. First of all, I had no idea it would blow up like that, from the bottom of my heart, I am so grateful for every single person who took time out of their day to write out a reply, it truly was so helpful!! \n\nIf you didn't see that post, I'm Mae, I'm 15, and a parents I was babysitting for refused to pay me because they found my outfit inappropriate.\n\nAround the same time the post started to blow up, my mom sent out an email to my neighbor/the mother, she never got a response, which was not very surprising, as they do not get along very well due to opposing political beliefs and religions, etc (my mom is jewish, she's very catholic). A lot of people suggested taking my neighbor to small claims court, but where I am at, the price of even filling a claim is half the money I would have made, as well as the fact that we live in a small town and my neighbor is a huge member of her church and very 'popular' (not really sure how to phrase it in a non highschooler way haha) so it just would not have been worth it.\n\nAnyways, I sent another text, got a response, etc etc, and the rest of the story is included over the texts. Again, thank you so so much for all the kind words. \n\n(Side note: a lot of people have asked where I got my tanktop, its from brandy melville, the \"skylar stripe lace tank\"!!)",
        "score": 68185,
        "id": "1k5p62f",
        "url": "https://www.reddit.com/gallery/1k5p62f",
        "created_utc": 1745377708.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "AIO my fiance spent 600 on gacha",
        "selftext": "My fiance spent $600 on a gacha game without asking. I flipped out and now his entire family are calling me abusive and encouraging him to call off the engagement. For context, I work 55 hours a week and he drives uber during the day while I’m at work. We are paycheck to paycheck.",
        "score": 67981,
        "id": "1jem774",
        "url": "https://www.reddit.com/gallery/1jem774",
        "created_utc": 1742349160.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "A Mother's Instigation. A Daughter's Completion",
        "selftext": "I have promised my late friend that I wouldn't share this story until at least a year after her death. That time has passed. And this is nothing short of beautiful. Cruel. But beautiful.\n\nI'm going to switch to first person POV. This is the story as my late friend told me.\n\nXXX\n\nI was an only child to two loving parents.  Mom had a difficult pregnancy and an even harder labor. It was so bad that the doctor advised that they never try again. Because he didn't want his wife to die, Dad got a vasectomy that was successful. I was sad that I didn't have any siblings but I had a happy childhood until I was a young adult.\n\nWhen I was in the middle of college, Mom was diagnosed with Stage IV HGSOC (high grade serous ovarian cancer). It's the most aggressive form of ovarian cancer and Mom's older sister and mom both died from it. We knew her odds weren't good.\n\nI don't know what Dad was thinking. I really don't. But he started an affair with his coworker, a woman just a few years older than me. Coworker started integrating herself into my and Mom's life. She'd go shopping for us, keep the house in order, help me with homework and even sit with Mom when Mom was going through chemo and Dad and I weren't there.\n\nAnd no, I had no clue. At all. I just thought it was Coworker being kind to a family going through hard times.\n\nMom fought. She fought hard. But the odds just weren't in her favor. One day, I was visiting her in hospice and we were playing Chutes and Ladders. Mom got real quiet and then she told me \"You do know your Dad isn't planning to reverse his vasectomy, right?\"\n\nI was surprised, wondering what she was talking about. \"Yeah, I know.\" I said. \"Why?\"\n\nMom just looked at me and said \"I think you'd best keep it in mind.\" We continued playing and when I left for the night, I kissed her and she said \"You'll be fine on your own.\" She died that night. I believe she knew she was going to die that night and didn't want to scare me.\n\nOnce again, Coworker was right by our side. She helped us plan the funeral, brought us food, helped out around the house...and slowly started moving her things in. It was like putting a frog in a pot of water and having the temperature raised. It was slow. It was gradual.\n\nA year or so later, she had completely moved herself in and was part of our lives. I don't remember what made me suspicious enough to start digging. But start digging I did. I learned the affair began shortly after Mom's diagnosis.\n\nI was sickened, furious and saddened. I took out my cell, ready to confront Dad and Coworker with the knowledge. But something else struck me.\n\nSee, during one of her visits, Coworker mentioned to Mom and me that she wished to have children with her fiancé. Mom \\*knew\\* that the affair was going on. And she trusted me to spill the beans.\n\nBut I wanted to twist the knife further...as a result I decided to play the long game. It was a gamble. One that had a good chance of not paying off. But it was one I was willing to take.\n\nI kept my mouth shut. I watched as they courted, got engaged and married three years later. I squealed with delight when they announced their engagement to me, wore a proud smile on their wedding day and made a toast at the reception. I even took extra steps to hide test results from Dad's urologist in such a way that Coworker wouldn't find it but Dad would.\n\nBelieve me. I was internally screaming. I wanted the world to know the way they hurt Mom and me during her darkest hour. I got dangerously close several times.\n\nBut I said nothing, knowing the payoff would be worth it.\n\nTime passed. We played happy family. I got married to my awesome Husband and had children. Dad and Coworker played doting grandparents but I knew from the pained look on Coworker's face that she was bemoaning her empty nest.\n\nJust as I was beginning to give up hope, the day came.\n\nCoworker and I had started the tradition of getting together for coffee shortly after Mom's death. We'd talk \"girl things\" (again, as I internally screamed). Laugh, cry, love, live. That sort of thing. That day, Coworker was sad and sullen. I could tell she had been crying. I asked what was wrong.\n\nI couldn't believe my ears when I heard why.\n\nShe was struggling to get pregnant for years but assumed it was stress from work. Then her periods started coming fewer and farther between. She decided to go to the doctor and find out why. It turned out she was entering perimenopause and her chances of successfully getting pregnant had dwindled. The doctor told her, in essence, her childbearing years were over.\n\nAs I crooned sympathetic noises, Coworker said \"It doesn't make sense....we tried so hard to have kids...but I wasn't able to get pregnant. I don't know why.\"\n\nIt was then that I knew it was time.\n\n\"You mean...Dad didn't tell you?\" I said.\n\n\"Didn't tell me what?\" She asked.\n\nI was fighting every chance to smile as I tried playing the \"it's not my right to tell\" and \"I can't believe he didn't tell you\" cards until she practically begged me. I should've won an Oscar for my performance. I told her about the vasectomy and that Dad had no intention of reversing it.\n\nYou should've seen Coworker. She completely deflated like a balloon. Her shoulders slumped, she bowed her head and she sobbed in her hands.\n\nI wanted to rejoice. I wanted to rub her face in it. I knew though that would make me look like the bad guy. So I hugged her and rubbed her back, telling her Dad was horrible for not telling her, that she deserved a different outcome and that he completely wasted her time. Again, I was fighting to not smile. When she left, I told her I would always be there for her...but I knew she wasn't going to be part of my life anymore. Why would she? I was the daughter of the man who betrayed her.\n\nOnce she had left and I was alone, I wept with joy and relief that it paid off but also deep sorrow that Mom hadn't been there to see it.\n\nThat was the last time I saw or talked to Coworker. A few weeks later, Dad called me in a fury. Coworker had packed her bags and left, slapping him with divorce papers. She yelled at him for not being honest with her that he had a vasectomy he had no intention of reversing. That he knew she wanted kids and that she had wasted all of her childbearing years. And that he had left it to me to tell her.\n\nHe then said \"How could you do that to us?! We loved you!\"\n\nI then said in a cold tone \"You and Mom did a good job teaching me how to keep secrets.\" I hung up and that was it. I never spoke to him again either. Last I heard, he and Coworker were divorced and everyone shunned him because of his keeping the secret.\n\nI know I won't be joining Mom after I die. What I did was cruel. It was horrible. I should've done what Mom wanted and spilled the beans beforehand instead of wasting Coworker's youth and childbearing years. Even if she could adopt, she'd probably die before her children were fully grown.\n\nAlthough...it's hard to have compassion and mercy for a woman who integrated herself into my dying mom's life as she was screwing Mom's husband.\n\nXXX\n\nTLDR: My friend's father had an affair as his wife was dying of cancer. His AP wanted children while he had a vasectomy he had no intention of reversing years before the affair began. Friend waited until AP's chances of getting pregnant were nil before telling her about the father's vasectomy. AP filed for divorce and Friend cut off contact with both the AP and her father.",
        "score": 6401,
        "id": "1d0v6m3",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/1d0v6m3/a_mothers_instigation_a_daughters_completion/",
        "created_utc": 1716704507.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Your bully son meses with us and you kill our dog? Prepare for dad...",
        "selftext": "I posted this on r/prorevenge but was referred to this sub instead after I posted a rage comic on r/memes\n\nThis happened in 1995 on a small rural town in Chaco Province, Argentina. Everyone knows each other here until this very day. My father was an electrician, the only one in town, so he was constantly meeting people and as he was born and raised here, he was very well known by everyone. He grew up with many of the police officers from back then and they even had asados together (Argentinean bbq) at least 3 times a months for years. My father was not a violent man. That was the only time I saw him do something like that.\n\nRhe other man with his busy son, they were not from town. They had moved here a year or so prior, they were from Buenos Aires. I don't really knew the guy, only his kid who was an absolute asshole to almost every kid in the block and he constantly picked on me and my brother since we were the youngest of our neighborhood, therefore couldn't defend ourselves.\n\nBucky wasn't trained since we knew nothing about training, but he was loyal and playful with every kid. One thing for sure, though, he was protective.\nOne afternoon we were playing in the park and out came bully kid, who at first threw rocks at us, then got closer and started calling us names and us being little got scared. He was bigger than us. We tried to leave but he blocked us and started hitting my brother, I tried to stop him but he did the same to me. Bucky heard us crying and came running, jumping and getting the bully's arm at once. He bit, shook and released, staying between us and the bully barking like mad until the kid left running. We saw hi get inside his house and a few seconds later came father with the sledgehammer. Bucky stood in front of us, hairs raised and barking but the man didn't stop. He got close, raised the sledgehammer and went straight down to Bucky's head. He did not him once, he hit him FIVE times. The first blow I'll never forget. The sound of the steel connecting with the skull, the painful whimper of our dog... Bucky got knocked with the first blow. By the fifth and final his head was caved in.\nMy brother and I were frozen in place, scared to death, crying a lot. The asshole dad say something which I don't remember now, and left. We were unable to move for a moment, such was our fear. Finally I grabbed my brother and went home.\n\nDad was fixing a fan and hen he saw us asked us what happened. We told him and just said \"Right. OK, let's wash your faces and grab some ice cream.\" Yes. That's what our dad did. Took us for ice cream. He did a pretty well job to mask his emotions and showed himself cheerful to us. That night, when brother was asleep and I was playing in the kitchen,  he grabbed the wrench, told mom and I he had to fix something in the neighbor (I assumed it was another neighbor since it was a common thing for my dad to get asked by neighbors to fix things), nodded to mom, mom nodded back (yes, she knew) and left. He came back some minutes later, told me to go to bed and the was it.\n\nA decade later we came to know what happened. He went to the guy's house, knocked on the door and punched the dude so hard it rocked his head back. Told him he would break one limb for each of his children whom he made cry (I can only imagine what he would've done if we were more than 2 kids) proceeded to beat the guy some more IN FRONT OF HIS FAMILY and then took the wrench and broke his legs. He then left the house, went home, asked me to go to bed, talked to mom and went straight to the police, turned himself in and was actually delayed until the police went and checked with the other guy. My dad also showed our dead dog to them and the police found the sledgehammer on the bully's house still with blood on it and they let my father go. They also spoke with the dude when he got better and suggested him to leave the town since if they weren't liked before, they wouldn't ever be now. To this, you gotta understand the mindset from some small rural towns. We looked at outsiders with mistrust back then and it took a while for people to get used to you if you were new in town. However these people came and weren't very much liked. Apparently because of the kid and the father was also an asshole.\n\nI do not condone the actions of my father, nor am I justifying in any way the events that transpired then, but as a father myself I can totally understand to what extent can a man react when hheir kids are at play. I loved my dad and I have mad respect for him. R.I.P. dad, we miss you greatly!\n\nSo there, that's the full story. Sorry for my bad English, it is not my native language.\n\nThanks guys!\n\nEdit: Wow! When I posted this I wasn't expecting this to get this much attention! Thank you all for your kindness and compassion! Recently and because of a message I received by one of you, kind people, I felt the need to include a part of the story that I originally left out involving Bucky, our brave dog. This is it: Bucky has defendants!\n\nMy brother has what would be Bucky's grand-grandpup now, and he's been adopting Bucky's lineage (if that's the correct term) for a few generations now. He did a good job at tracking down Bucky's litters (he had 2 litters in its short life, with the first being of 5 pups and the second one of 8). My brother, Leandro, remembered everyone who got to adopt Bucky's pups and to his surprise, he found Bucky's blood carried on and is still strong. He adopts a decendant from Bucky every time there's a new litter and has adopted 2 generations so far, every one a straight decendant from a male. All praise goes to my brother, who worried himself with keeping Bucky alive in his life.\n\nAgain, excuse my English if I couldn't express myself the correct way or if it caused any confusion upon reading. I'll try to explain better in the comments if asked to.\nThank you all very much and sorry for taking long to post this part!",
        "score": 6274,
        "id": "w5khw1",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/w5khw1/your_bully_son_meses_with_us_and_you_kill_our_dog/",
        "created_utc": 1658521669.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
        "selftext": "My very good friend made...some slightly dumb mistakes and sent some pictures to someone that she reasonably thought she could trust, but not knowing much more than than his first name, his screen name, and roughly where he lived and the type of work he did.  He is not in our country but had indicated that he would be traveling for work to near us shortly, and they had made some plans to meet.\n\nAnd when she got some red flags and backed out, the dude threatened to publish these pictures online.\n\nI am, incidentally, an attorney.\n\nSo, some searching later, and gathering up any pictures he sent her of him, that could possibly identify him, his online handle let me to a TikTok page, which lead me to an instagram page with his name on it.\n\nThat lead to a linkedin page with his place of work that matched a picture he sent with a branded polo he was wearing.\n\nSome more searches got me the email of the CEO, VP of HR, operations manager, and public relations manager.\n\nI just fired off an email on behalf of my client of the screenshots of him threatening revenge porn, snippets of the conversation showing that username while he sent that exact picture of him wearing his company's branded apparel, links to how I know it's him, along with pictures he sent her of his motorcycle with the license plate showing, as further proof it is him.  I also included screenshots of him discussing a workplace incident that were time stamped, along with pieces of dialogue discussing how he had sex with an ex at his place of work, and discussing plans to have sex with her in his office as well.\n\nI also included a picture he sent her showing his work laptop with his entire outlook calendar, along with proprietary information (which he sent to \"prove he was busy\") along with other pictures he took of his workplace with non-consenting employees.\n\nI further informed his employer that I will be forwarding all this information to local (to them) law enforcement and since he had indicated that he would be traveling to the United States soon, will also forward this to the local office of the Federal Bureau of Investigation as, since my client is a US citizen on US soil, these threats constituted a federal crime.  So that should they continue with his employment, and continue with their plans to send him to the United State for work, I will ensure, on behalf of my client that federal law enforcement is waiting for him on arrival.  Which I will do, as one of the assistant US attorney's for this region is a law school buddy of mine.\n\nSince I have his license plate # I know where he lives, and will be contacting his local authorities tomorow.\n\nYou dumb mother fucker thinking you were hiding around anonymity thinking you could threaten my friend?  It took me 45 minutes to destroy your life.",
        "score": 6125,
        "id": "1bvc68q",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/1bvc68q/threaten_my_friend_with_revenge_porn_ill_ruin/",
        "created_utc": 1712198462.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "AIO. My bf shamed me over having my hair removed",
        "selftext": "My(F18) boyfriend (M20) of only 3 months. recently asked me how l'm always completely hairless. I told him honestly that I did full body laser hair removal for nearly two years. I got this done when I was 15 to 17. He got weird and literally called me a 'whore' for it. I was shocked and I'm not sure how to feel or if I should be hearing him out on this? Was I overreacting? It felt really disrespectful",
        "score": 67142,
        "id": "1kmnhn6",
        "url": "https://www.reddit.com/gallery/1kmnhn6",
        "created_utc": 1747249340.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Ex and Boyfriend hurt my daughter tarnish my friends reputation and I seek revenge.",
        "selftext": "To start off this is a throwaway as I don’t want it to tie back to me. Also buckle up this is going to be a long ride; these events took place over several years; I hope it is worth the read.\n\nI am going to begin with the main players: Me, my ex-wife Pepper (revenge target number 1), her boyfriend Steve (revenge target number 2), the boyfriends ex-wife Maria (copartner in the revenge), my daughter Sarah, and my friend Jason (accomplice in the revenge). With that set let’s get some backstory out of the way.\n\nSo, Pepper and I had a very up and down marriage. It was one of those that I was madly in love with her but looking back I think she was in it more for the money and convenience. She had one son we will call Drug (because he was and still is a major drug addict) before we got married and I also had one son (name is unimportant) that I had full custody off. While married we had Sarah. I toughed the marriage out for as long as I could but eventually, we just couldn’t keep it together. We separated and due to traveling some for work and having custody of my son I moved back to my hometown a few states away so my parents could help but kept an apartment in the town that Pepper and Sarah lived in so that I could still spend as much time with my daughter as I could. At this time, I asked my best friend Jason who is a lawyer and owns his own firm to do up a child support agreement for us. It is very important to note that we only addressed child support it had nothing about custody or visitation or any thing else in it. So, for about a year this was how it would work. I would spend a month with Sarah while my parents watched my other son then I would spend a month with my son. Almost exactly a year later I could no longer afford keeping two households and Pepper was wanting to move back to her hometown which was in a different state but closer to where I lived so I gave up the apartment and she moved.\n\nThe new situation continued for a couple more years. Pepper and I remained friendly and even tried to reconcile the relationship a couple of times, but it wouldn’t work out. I was still deeply in love with her, but we couldn’t come to an agreement on things like where to live and such. I forced myself to try and move on and started dating. She had been dating basically from the day after I moved out. Even though I still loved her our relationship moved more into good friends than husband and wife. So, she finally meets Steve. I never was told much about Steve other than he was a certified ethical hacker and that is what he did for employment (important later). While they were dating, she would send me texts about their dates. She even texted me the day they first had sex together. This hurt deeply and looking back I think this is what she wanted but I tried to play the part of good friend and confidant.\n\nSteve and Pepper had been dating for six months when out of the blue she tells me they broke up and she realized that she is madly in love with me. Since its at the beginning of summer she packs some suitcases and heads to my state. They were going to spend the summer with me and see if they like it or not. We had an amazing summer. All the kids are getting along, Drug even loved it here, so she makes it official we are back together, and they are moving in. We went and registered my daughter for school, we even were able to get her on a pewee cheerleading team for the summer. She made several friends and was loving being here. There was only one problem Pepper still had an apartment that had all her furniture and stuff in it. I offered to go up with my truck and help load everything, but she insisted that her and Drug can get it done. So off they go to pack up and then head to their new home.\n\nAs you can guess things didn’t go as planned. She was home for about 3 days when she informs me that under no circumstance will she move and that her and Steve are in love and are moving in with each other. To say I was destroyed was an understatement. I couldn’t understand why she had done it. The worst part was she left it to me to tell Sarah the bad news. When I told her the devastated look on her face started turning my feelings of hurt into feelings of anger. Then Sarah broke down and started begging to stay with me and started spilling the beans. She told me things about how her mom would leave with Steve for days and leave Drug in charge. She had to learn how to cook for herself at 8 because Drug would spend the money on well drugs and spend the whole time high. If Drug wasn’t left in charge Pepper would use her multiple convicted felon niece to watch her. She also told me about the first time that she had met Steve. He came to their house basically said hello and Him and her mom disappeared into the bedroom and started having loud sex. Sarah was outside the door bawling and they just ignored and continued. This is how my 8-year learned of sex and she is still in counseling trying to recover 7 years later.\n\nAt this point my anger has turned to rage. I immediately notified Pepper that there was no way Sarah was coming back and I would fight her to the death to keep her out of that situation. Pepper responded by getting an emergency hearing in her state to force Sarah back. I had to scramble but I managed to get a lawyer and easily won the hearing (which Pepper showed up late for and told the judge it was due to a disability). The judge agreed that since there was no custody agreement and with the troubling accusations  that I had gathered it was best for now for Sarah to stay with me. I had won the first battle, but it was short lived. Within an hour of the hearing, I started getting tons of Phishing emails and texts, I was also getting password resets and MFA codes from my bank, Facebook, Reddit, and any other accounts. I knew that Steve was behind it.\n\nThe very next day Jason calls. His law firm’s website, email, and phone account had been hacked. Because he had to disclose the hack to the court and because he was working on a semi high profile case at the time the FBI got involved. To say I was enraged was an understatement these two people had destroyed me, harmed my daughter, and tarnished the reputation of my lifelong friend. It was time for them to pay and pay dearly. I was a man on a mission. I spent hours digging up as much dirt as I could on Steven and Pepper. I had a lot of luck with Pepper. I found social medial posts of her out late drinking that correlated to tardiness and missed days at school for Sarah. I found tons of pics of Her and two strange kids doing fun activities. I found neighbors that were willing to testify that Sarah had to come beg for food because she was left with either Drug or the felon. I knew I could bury her. Steve on the other had had all his accounts locked down. I couldn’t find any dirt and it was driving me crazy. Then it hit me try LinkedIn. It paid off. There wasn’t much posted but through his account I found Maria his ex-wife’s account. I reached out to her, and she happily accepted.\n\nMaria and I became fast friends. She hated Pepper (for good reason as they had both abandoned her kids like my daughter) and didn’t want her around her kids. I learned so much. To keep it short Maria and Steve had recently divorced. As part of the custody agreement Steve got the house, car, bank account, savings, and a lower than usual child support. Maria had traded all that money to have control of the kids. She knew he was a scum bag and all she was concerned about was keeping her kids safe. They had a very detailed custody agreement with rules for Steve to follow. As part of that agreement if Steve broke any rules, then he had to pay and pay dearly. He had to sell the house and give her half of everything. His child support would also double, and Steve would be financially ruined. Steve also didn’t have her blocked on the social media and would regularly send texts bragging about how great his life was without her. Many of those texts had pictures of Pepper in them. We compared notes, we swapped evidence, we came up with a plan. \n\nAnd now it is time for revenge. First, I got with Jason, he let the FBI investigator know that I had also had some hacking attempts and we believed it was the same person. The investigator called quick. I gave him all the information I had and who I believed was doing it, and he asked a weird question. Do I know where Steve worked? Well yes, I did (thanks to Maria). So apparently Steve wasn’t as good as a hacker as he thought himself to be. They had already traced back the hack on Jason to a business. The very same business Steve worked for. As soon as my conversation with the FBI was done, I called his work to lodge a complaint. I told the manager that someone was trying to hack me, and I was sure it was Steve. They or course did not take it to seriously because I had no proof. What they didn’t know was they were soon going to be getting a visit from a Special Agent.\n\nThe next week was absolute hell for Steve and Pepper. Pepper got served with the divorce papers and her lawyer got served with all the evidence I had gathered. My lawyer said it was the most complete investigation he had ever seen. I had all 40 tardiness and 19 absences tied to nights out drinking with Steve.  I had hard proof of them abandoning my daughter for days at a time. Maria even gave me a picture that was taken at 2am the night before the emergency hearing with Steve and Pepper dinking in a tattoo parlor. The same hearing, she was late to and said it was due to a disability. Steve got served that he had violated the entire custody agreement. Maria had pictures from me proving he was with Pepper on nights the kids were with him, and they were left alone. She also had proof that there was contact with Pepper that violated the custody agreement. The fall out was awesome to watch. Steve was fired, between my complaint, another older complaint of him hacking, and the FBI showing up they had no choice but to fire him. He did avoid any legal issues as the FBI could never tie it directly to him. The word spread of why he was fired, and no one would hire him in an IT job again. He had to sell the house, liquidate all the investments, and bank accounts and give half to Maria. His child support got to stay the same since he no longer had a source of income. Last I heard he was working at a grocery store. So in total his income went from 200k+a year to less than 40k.\n\nAs for Pepper, the divorce was swift and painful for her. The judge ruled in my favor for all counts. I got sole custody and sole decision making. She was forced to go to counseling and her and Drug can only visit Sarah with a third-party supervisor paid for by Pepper. \n\nSarah is doing much better. She still needs counseling, but she thrives in school and has many friends. She very rarely sees her mom, but She is much better off without her.",
        "score": 6098,
        "id": "sld8bd",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/sld8bd/ex_and_boyfriend_hurt_my_daughter_tarnish_my/",
        "created_utc": 1644084824.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "That time I was the only white guy at an all black wedding and the mother of the bride thought I was a waiter.",
        "selftext": "This story is a little more light-hearted compared to the usual ones that get posted daily (but I like reading those too).\n\nMy good friend got married last year and invited me to his wedding. I put on a nice suit on, black tie, shined shoes, all that jazz. I didn't realize I was the only white guy there until the ceremony ended. I went \"...huh...\" and thought nothing of it.\n\n---\n\nAt the after party, I also didn't realize the waiters were dressed exactly like me. White shirt, black tie, shined shoes.\n\nI'm walking around and a nice older lady (who would turn out to be the mother of the bride) approached me as I passed her table. She needed an extra seat for her table.\n\nHer: \"Excuse me...can we move this chair over here?\"\n\nMe: \"Uh...yeah. Go ahead.\" \n\nHer: \"Do you think that will inconvenience the other table?\"\n\nMe: \"I mean, that sounds like that's the other table's problem.\" *(yes, I really said this)*\n\nHer: \"...uh...alright. Are there extra chairs in the back?\"\n\nMe: \"...probably? I mean, they know there is a wedding going on so I think it'll be okay.\"\n\nHer: \"...o-okay.Well, thank you.\"\n\nMe internally: (that was weird)\n\n---\n\nLater, I had to go to that same table to drop off my portion of the wedding purse. And that nice lady was there with her sister.\n\nMe: \"Hello again.\"\n\nHer: \"Oh hi. Great timing. Do you know when we'll be eating?\"\n\nMe: \"No, but I can't wait. Wedding food is the best, isn't it?\"\n\nHer: *somewhat annoyed*\"Well, with what we're paying for this, I'd imagine it would be.\"\n\nMe: \"And thank you very much for paying for it. Really, I'm so happy to be here.\"\n\nHer: \"....\"\n\nMe: \"...um, so is this where we leave the wedding gifts?\"\n\nHer: \"Oh my god, I'm so sorry! Haha. You don't work here!\"\n\nMe: \"I....What?\" \n\n2 seconds later, a waiter dressed like me walks by I understand. We all had a good laugh about it.",
        "score": 19717,
        "id": "7ywag0",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/7ywag0/that_time_i_was_the_only_white_guy_at_an_all/",
        "created_utc": 1519137245.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Her next wedding...",
        "selftext": "So... I’ve got some stories.... read until the end, there’s a payoff...\n\nI was a bartender for years (14) at a private club that was a popular wedding venue, and worked probably about 800-1000 weddings total. \n\nOne stands out that I’ll never forget. I was the head bartender and manager on duty for most of them, and I worked with the in-house events coordinator (EC) who handled all the logistics on our end prior to the event, booking, catering, bar service, in house decor etc... she’d typically give me a heads up about guest requirements on my event sheet, and let me know if the client was being a headache beforehand.\n\nFor this case we were doing a 3rd marriage for the bride (in her mid 40’s) and a first marriage for the groom. The EC gave me a heads up that the bride was a serious bridezilla, she’d been emailing or calling about minor details 3-4 times a day for 3 months solid, and I was told to expect the worst.\n\nThe day comes, and the bride and her party is there to oversee set up a few hours before the wedding, (not out of the ordinary), and everything is running smoothly until the flowers arrive (floral is not our domain, arranged privately), and she FREAKS out because it’s not exactly what she ordered. (They’re gorgeous btw, and way over the top for what I’d expect for a 250 person wedding). I have to calm her down and use my standard lines “No one is here to celebrate flowers, they’re here to celebrate you, etc...”\n\nWe get over that and I’m expecting the worst for the night and...\n\nIt’s lovely.\n\nShe’s radiant the whole evening, everyone’s happy, the event runs smoothly, and I’m stoked to not have to be dealing with drama.\n\nAt the end, when they’re packing up I go up to them to do my standard “How did everything go, is there anything I can assist you with?” conversation with her while her hubby stands a few feet away talking to a friend.\n\nShe turns to me with stars in her eyes and says:\n\n “It was perfect, I want to do my next one here.” \n\nHubby does a neck-snapping double take, while I’m kind of speechless and manage to mumble out “I’m glad you enjoyed it.”\n\nThey leave and I try to process what I just heard.\n\nWait, it gets better...\n\nOften wedding parties show up the next day to pick up things they left behind so they don’t have to spend an hour packing up late at night. When they do we let them come down to the club bar for a drink if they want. \n\nThey show up and come down to the bar where I’m working. At this point I figure her “next one” comment was just a slip of the tongue, she’d had some wine (though wasn’t what I’d call inebriated), etc...\n\nBut no, talking to her straight sober, with hubby in tow, she told me again how it was everything she’d hoped for and she’d definitely come back next time. \n\nThat’s when I realized. \n\nShe didn’t want to get married, she just loved being a bride and having a special day all about her...",
        "score": 3412,
        "id": "bzppfz",
        "url": "https://www.reddit.com/r/bridezillas/comments/bzppfz/her_next_wedding/",
        "created_utc": 1560336668.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "HOA wants me to join, so I do. Just not how they expected.",
        "selftext": "**TL;DR At Bottom**\n\nSo this story is about a property I own, but rent out.  This may sound strange, but I don't think I could afford to live there these days - it's become somewhat exclusive.\n\nI guess this could also go in pro revenge.\n\nI've used dollars here, because it's what most people reading this will relate to.  This doesn't take place in the US, and I've given an approximate dollar value for local currency.  To answer the most commonly asked question, this is in South Africa.\n\nThis is going to be VERY LONG.\n\n**BACKGROUND**\n\nA million years ago my property was part of a large farm.  I bought it about 30 years ago, long after the farm was broken up, but before there was any development near it.  The piece of land I got was near the back entrance that joined into a dirt road that ran past. The more expensive plots were near the tarred road in the front.\n\nI originally bought a large chunk of the land intending to do some farming, but that never happened. About 20 years ago some of the owners got organised (We'll call them the Organised Owners - OO) and had the area designated as a municipal suburb. The municipality agreed to put in tarred roads, water and electricity if a certain percentage of the properties were developed.  A construction company (linked to the OO) went around contacting the owners who had land but no buildings offering to build houses for us at a very (very) reasonable price - contingent on them getting a certain minimum amount of people signing up. While this was happening, one of the OO approached me and offered to buy half of my property.  I agreed, and the money I got for the sale (which was about 4 x what I'd paid for the entire chunk of land 10 years prior) combined with a small loan from the bank gave me what I needed to pay for a house to be built, and it was a fairly large and nice house too.\n\nI stayed in the house for a few years, and my mom moved in with me.  I had decided to subdivide the property again and build her a house next to mine, but unfortunately an un-diagnosed tumor took her before the house could even be started (well, it was diagnosed, but too late to do anything).\n\nSoon after she died, we moved out of the house and started renting it out.  About a few weeks before we moved out the OO I'd sold the land to started talking about starting an HOA.  I wasn't interested, and left soon after.  About two years later, the neighbour OO contacted me. There were two roads entering the area these days - the original tarred road that was near where the farmhouse had been and was entered from a fairly busy main road, and my \"dirt road back entrance\" which was now a tarred entrance from a wide but not very busy municipal road.  The HOA was trying to get the old farm road blocked off to inprove security and decrease through-traffic, and wanted the road next to my property to be the main (and only) entrance to the HOA community.  And they were pressuring me to join.\n\nI said no, and I was adamant, and eventually they accepted that, but told me they wanted to have a sign near the road welcoming people to the neighbourhood, and the only practical place to put it was on the edge of my property.  They also wanted to build a little guard hut and have a security guard permanently monitoring who went in and came out, and they wanted to build his shed on my property. We came to an agreement whereby they would mow the lawn and pay the equivalent of about $35 per month in exchange for the land they needed.  I was very happy with this arrangement, since the property was fairly large, and it didn't really cost them anything since they already had a full time gardening service servicing the HOA.\n\nThis all happened a over a decade ago. They eventually got the other main road blocked off, and the HOA is paying for rent-a-cop to be permanently stationed close to my property, as well as mowing my lawn and paying me enough money for takeaways for the family each month.  I'm occasionally contacted by members of the HOA to get me to sign up, but I'm really not interested.  My property has been rented to the same tenant for all these years and everything there is going well for me.\n\nUntil about 3 years ago, when someone scared the crap out of my tenants young daughter by making strange noises and shooting a gun close to her bedroom window three or four times over about a month.  This scared my tenant and I guessed it scared the HOA because they AND my tenant contacted me with a proposal - I join the HOA and they give me exclusions from the HOA rules, including exclusions from paying the monthly fees, and in addition they will build a wall around the ENTIRE HOA neighbourhood, including electric fencing and security cameras.  They told me they had wanted to do this for a while but were unwilling to build the wall on property that was not in the HOA.\n\nI couldn't see the downside, and so agreed.\n\n**THE DISHONEST DEALINGS**\n\nIt took a little over a year to build the wall and get everything completed, which is quite fast. And then a month to the day after everything was done, my tenant got an HOA warning about his dogs barking.  He told the HOA that while the property was in the HOA, it was exempt from the rules.  The HOA told him that they had cancelled the exemptions, and that he had 30 days to comply.  He contacted me, and I opened some mail I'd gotten from the HOA (I'd ignored it since I was supposed to be exempt from the rules and fees).\n\nMan, did I get a surprise.  They had retroactively cancelled the exemptions, and were claiming:\n\n1. That I pay late fees going back over a year\n2. That the easement agreement had been cancelled, and that they were retroactively canceling it a year back because the HOA contract allowed them to use \"small unused portions\" of HOA members land for the common good for free\n3. That I refund them the money they had paid for the easement over that period,\n4. That I owed them money for the garden service mowing the large lawn, and\n5. That I would be fined for each infraction my tenant failed to remedy.\n\nThis started an expensive process involving lawyers and the court system, that ended with a judge  telling me that what the HOA had done was mostly legal - they had the right to revoke the exemptions, but that they had to give me 30 days notice.\n\nAs I was walking to my car the neighbour OO (the one who bought half my land so many years ago) told me that I was stupid to have refused to join when the HOA started, as I could have been a founder member (whatever that means), and that next time I should be sure to understand the documents I sign before signing them.\n\n**THE MALICIOUS COMPLIANCE**\n\nNeighbour OO was right, I should have read the contract (better).  Also, I was interested in what it meant to be a \"Founding Member\" (spoiler: Nothing), and so when I got home I grabbed the HOA contract I'd signed, as well as all the other documentation they had provided me with, and started reading.  I was determined to break every rule I could find a loophole to break.\n\nI didn't get past the first page.\n\nWhile the street address of the property is used to identify it for all *practical* purposes, in the city records it has a unique property number that has to be used on *legal* records.  When my mom moved in, I'd subdivided the remaining property but hadn't yet started building on it.  And when I gave the HOA the easement all those years ago it had been on the property I'd sliced off for my mom.  And when the HOA set up the contract, they had simply used the property number from the easement.\n\nThe next afternoon the neighbour OO delivered (and had me sign for) two documents - one telling me that my exemptions would expire in a 30 days, and one letting me know that the easement would no longer be required after 30 days.  I think he was being a bit malicious here, because I lived about an hour away from the property, and he drove out himself.\n\n**THE REVENGE**\n\nEXACTLY 30 days TO THE HOUR after the HOA had given me the 30 days notice, I knocked on the neighbour OO's door (did I mention he was the president of the HOA?) and had him sign for two documents.  The first was that I planned to build a house on my HOA property (which confused him) and the second was notice that they had 30 days to remove from the property the guard shed, the parts of the electric boom that were on my property, as well as the sign.  He tried to engage me but I ignored him, climbed into my car and drove off.\n\nEarly the next morning I got a call from the HOA lawyer who explained to me that their junk would be staying on my property since it was in an \"unused\" part of my land.  I explained that I was building a house there, and that the land would not be unused anymore.  I could hear the smirk as he told me that building a second house to be spiteful would not be accepted by the courts. I sure hope he could hear the smirk in my voice when I told him that the property in question did not have a house, and was, in fact, barely large enough for a house to be built and would not be large enough for any extraneous buildings.  I then told him to go look up the property in question and call me back. (I had sliced off just enough to be legal, which was just enough to build a small house).\n\nIt took them just under 5 days to get back to me. Their lawyer told me that the terms of the easement meant that I could not cancel without their permission, so I emailed him a photo of the document they sent to me cancelling the easement. That afternoon Neighbour OO invited me to lunch (his treat) to discuss the problem.  I said \"No thanks\".  He extended the offer again two days later, and again I said \"No thanks\".  Others of the original OO contacted me to try to talk.  Some sounded aggressive, some sounded sympathetic.  I said \"No thanks\" to each of them.\n\nEventually the lawyer phoned and asked if we could come to some sort of arrangement.  I asked what he had in mind, and he told me that he was prepared to discuss exclusions in exchange for access to my property.  So I said \"No thanks, and please don't call me again\".\n\nAbout 9 days before their 30 days was up I got a call from a different lawyer.  He said he wanted to \"negotiate a surrender\" (his words, not mine).  I agreed to meet him at his office the next day.  I'd already had documents drawn up, and the meeting was as simple as me giving him the documents and him reading them over.  My new easement offer:\n\n1. Included everything offered by the old easement offer,\n2. I changed the line \"mow the lawn\" to \"get the property to HOA standards and keep it there\" since it was now in the HOA.\n3. Would cost them about $500 per month instead of \\~$35,\n   1. This amount would increased with inflation (the previous contract didn't include that bit).\n4. When cancelled, for whatever reason, the HOA would have to pay me a cancellation fee of around $7500.\n5. The contract automatically terminated 30 days after\n   1. any disciplinary action was taken against the me, my tenant, or the property (\"the property\"),\n   2. any complaints were levied by the HOA against the property,\n   3. any legal action was taken against the property by anyone in the HOA,\n6. That \\[lawyer who had offerred to negotiate surrender\\] would be allowed to mediate any disputes between us, at HOAs expense, and that\n7. The HOA would pay all my legal fees if any legal action was taken against me.\n\nI'd deliberately left some insane things in there so that I could appear to \"concede\" some points or be negotiated down when the HOA got indignant about the points I actually cared about.\n\nThe lawyer didn't look happy. He said that my proposal sounded unfair, but that he'd have the HOA president look at them.  I reminded him that in 8 days I'd be setting a group of men armed with sledgehammers and anger management issues lose on whatever of theirs was still on my property.\n\nThat evening I got an irate call from the HOA president.  He told me he was never going to sign the new contract.  I said \"OK\".  He then told me I was charging too much per month, and that it should be at the same rate as the previous contract. I pointed out that when I signed the previous contract the area was under development, and there was at least one other road leading in and out, but that now there was only mine.  And besides, mine was now developed with everything they needed.  He told me that I was forcing them to sign a document they didn't want to sign.  I told him that he was free to not sign it. He whined about everything he could think of.  And then eventually told me I'd be hearing from his lawyer.\n\nThe next morning Surrender Lawyer called to ask if I'd be willing to come to their offices to sign the contract.  I agreed. When I got there that afternoon I learned that Surrender Lawyer was not a lawyer, but a Paralegal.  He handed me the contract and asked me to sign it.  He laughed when I told him I'd have to read through it first to make sure nothing was changed, and mumbled something that sounded like \"I'm sure you would\".\n\nI read the contract.  Nothing had been changed. NOT A SINGLE THING. And the HOA president had signed it, with the Surrender Paralegal signing as witness.  I looked at him and said \"Why did he sign this?  It was stupid to sign it!\" and the paralegal looked at me and said \"I started telling him that signing it would be a bad decision, but he told me I wasn't being paid to think or give legal advice, and to shut up.  So I shut up.\"  I said \"Do you understand what he's signed here?\" He looks at me and nods.  He said \"I asked him if I should have one of the lawyers look at it before giving it to you, and he told me that we had already billed enough for this, and that he'd sign it and sue me after their easement was safe.\n\nThis happened about a year and a half ago.  It took 6 months for the HOA to find out how screwed they were.  They wanted to sue me, but their lawyers explained to them that there was no way to win. Even if the court sided with them, all they would get is the easement contract voided, and they did not think that the court would side with them.  The lawyers were adamant about one thing - the HOA could not live with the \"HOA pays my legal fees if legal action was taken against me\" since it didn't limit the people taking legal action against me to the HOA - as worded, the HOA would be fordced to pay for my legal fees if ANYONE took legal action against me.  They argued that the courts would probably not enforce that, since the context of the agreement was to do with the HOA, and I told them I was prepared to find out since the HOA would definitely be the ones taking action against me if they challenged it.  I eventually signed an addendum to the contract that said that the neighbour OO (HOA President) would personally pay all my legal fees *unless he held no position at all in the HOA*, and that the HOA would pay all legal fees if the HOA took legal action against me.  He resigned from the HOA at the end of that meeting. I politely told him in front of everyone that he should not sign documents unless he understands what he's signing.  He didn't look pleased.\n\nIt came out during the mediation (you cannot imagine how happy the lawyers were that their paralegal was mediating) that without the ability to control access to the HOA neighborhood through the security boom (partially) on my property (the HOA had become a \"gated community\" a number of years back) the HOA would be in breach of their own articles and would be dissolved. I also learned (should have been obvious to me) that all the security cameras were wired, and all terminate in the guardhouse / guard shed.  So basically, it was my way or the end of the HOA.\n\nThat first mediation was really quite funny. My paralegal looked more than a little glum as we assembled and he called everyone to order.  I suspected that he had been told to work against me, so I took the initiative.  I reminded everyone there that I had agreed to let Paralegal mediate, but that I had agreed to no arbitration at all.  If I didn't feel like the proceedings were fair I'd leave and they could go ahead and sue. Paralegal brightened up and things actually went quite well.\n\nI'm writing this after getting home from the latest mediation.  I built a \"paddling pool\" for the neighborhood dogs.  As in I made it myself.  I dug a hole, packed it with stone, and added a concrete finish.  It was my first attempt, and if I say so myself, it looked ... well, terrible. The HOA called for a mediation meeting (what they do now instead of taking official action.  I've declined their mediation requests in the past) in which they told me, as nicely as they could, that the paddling pool was an eyesore right at he entrance of the HOA.  I asked them to create a list of what needed to be fixed and how it needed to be fixed to give to me at the next meeting.  The list was extensive.  It basically required the pool to be rebuilt from scratch,  I asked them if there was any way to reduce costs on the work they needed to get it up to HOA standards, and they assured me there was not.  I thanked them, pulled out a copy of the agreement where they had agreed to \"get the property to HOA standards\" (which I'd highlighted) and handed it to them with the list.  I told them the HOA usually preferred if these things were dealt with within 30 days.  They started arguing until the mediator reminded them that they could not force me to comply without causing the easement to end.  I should mention that their lawyers usually no longer attend these things. They said they would get it done.\n\nI also learned a lot about neighbour OO today:\n\n1. I found out that Neighbour OO sold his property about 3 months back, and is apparently leaving the country for Australia.\n2. I found out that the HOA had successfully sued him for a crapload of money they had lost to his mismanagement as part of his vendetta against me.\n3. I also learned that he had a vendetta against me. I have no idea what I did to upset him.\n\nI'm not sure if I will screw with the HOA any more.  I already think I'm so close to breaking them the only thing stopping them from canceling the contract is the massive financial loss if they do.  I guess a lot depends on how they treat me and my tenants going forward.\n\nAlso, I do like the monthly payments, though, so I'm motivated to play nice.\n\nNeighbour OO was right, though, in the end.  You really shouldn't sign documents unless you understand what you are signing.\n\n**TL;DR**\n\nHOA President gets me to join the HOA under false pretenses that get upheld in court, then finds out that that he signed up (literally) the wrong property and has to resign after getting the HOA into an incredibly expensive situation that it cannot get out of.\n\n**Thank You Every One**\n\nWhen I posted this here it was because I felt like I could fly and wanted to share. Now the adrenaline is gone and I feel like I've been kicked by a donkey. I thought some people would like the story, but also thought it was too long for most.  It seems I may have been very wrong.  There are so many people commenting and sending messages that I cannot keep up. Thank you all so very much!\n\n**Picture**\n\nStupid picture drawn using a potato.  I guess you will soon know I'm not a graphic designer: https://upload.vaa.red/2pJM58#5f6eb17da1a2bc865f8c5839b711600d\n\nPlease let me know if the picture helps or not.",
        "score": 55947,
        "id": "q426qi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/q426qi/hoa_wants_me_to_join_so_i_do_just_not_how_they/",
        "created_utc": 1633713219.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "HR tried to Get Rid of my Dad right before he was able to get his pension",
        "selftext": "My Father worked for a Forbes 500 company since the 70s.  Moved up the ranks as a software engineer and management, has patents for the company that saved it millions of dollars.  He's almost to pension age and suddenly HR starts making his life miserable.  He noticed this trend was happening to some of his coworkers when they were getting close to age 60 as well.\n\nHR Lady calls him into the office and says that he was not punching in and out at the correct time.    My Father, an engineer, is very very detail oriented.  He knew that these were false accusations and asked HR to prove it.  They came back a week later and couldn't prove it.  And he said,  \"Of course you can't.  I have been driving the corporate carpool bus from \\[A major city 40 miles away from the company\\] for the last 15 years.  I always have 16 witnesses on my clock in time and I haven't been late in 15 years.\"\n\nHR Lady came back a week later and they said that they were going to fire him for letting people into the building without badging.  He asked to see when and where he was letting someone into the building without badging.  They showed that he held the door for his best friend who had also been working there since the 70s who had his foot cut off after having type 2 diabetes. He was in a wheelchair.\n\nPrior to this my dad took the chief of security out for lunch and told him about how this company wanted him to leave before he got his pension so he got some footage of his own.  My dad said, \"That is very interesting.  You are going to fire me for holding the door for my best friend of 35 years after his foot was amputated and he was in a wheelchair?  Fine then I hope you fire the CEO and yourself as well!!!\"  He then proceeded to show footage of the HR lady holding the door for his friend and the CEO holding the door for his friend.\n\nMy Father ended up staying there until he got his pension.\n\nEdit:  I don't know his finances and he probably wouldn't have lost the whole pension but there was a definite financial difference from being fired prior to reaching age 60 and making it to age 60.\n\nEdit 2:  So this blew up so much that my brother who didn't know I was on Reddit texted me and said \"You are reddit famous.  That's a story about Dad!  I knew this was you.\"  Also some of you are wondering why a Software Engineer would have to clock in and out, well he didn't.    I meant to use the word badge in and out of the building, they went that far to talk with security to see his badge timestamps.  There are more things that led to this getting bad and I didn't want to write pages and pages but it definitely escalated to this point.  Lastly for those of you that have been saying that my dad must have worked there as a child, this whole thing happened roughly 9 years ago.  My father is 68 right now.  If you want to know what company it was: this sentence is the most general hint I can give you but it may drive people from that company to be mad at me.  \n\n\nFinal Update:  Dad quit that job a while ago and made his own company in his retirement.  He has used his own money to patent a new invention that desalinates seawater and provides clean solar energy.  He has patents for this in America, India, and China and is looking for some capital to provide clean water and power to 3rd world countries.  If interested in helping him build his first power plant please send me a message.",
        "score": 54770,
        "id": "o76kzv",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o76kzv/hr_tried_to_get_rid_of_my_dad_right_before_he_was/",
        "created_utc": 1624558354.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "AIO - My “friend” wants to kick me out after I lost my home in the LA wildfire",
        "selftext": "Throwaway account, my main has too much personal shit on it.\n\n\nLong story short, I’ve known this dude for 15 years… he’s always been a little flakey but we’ve been friends forever… when he lost everything I gave him a place to sleep and live, I literally didn’t charge him a cent until he figured his life out and moved out. \n\nI, like many others, lost my home in the LA wildfires. You can’t even imagine how fucking terrible this has been for so many of us. I’ve literally been in tears most days… I have nothing except a car and some clothes… I’ve only been staying on his fucking couch for less than 2 weeks, but he has zero awareness.. suddenly it’s 3 fucking weeks, and now there’s a mystery girl who has priority. I’m just sad man. This dude was my friend. I feel betrayed. \n\nAm I overreacting here or am I in the right to be absolutely pissed and want to remove him permanently from my life after this ?",
        "score": 63464,
        "id": "1iazjin",
        "url": "https://www.reddit.com/gallery/1iazjin",
        "created_utc": 1737951266.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "1 Year Update: Mom changed wedding cake behind my back and doesn’t know that I know",
        "selftext": "I’m baaaack, with a one year update on how my mom changed my wedding cake order without me knowing. \n\nPeople have reached out for an update, and coincidentally I’ve had several friends get engaged who have similar family dynamics as mine. I’ve shared all of this with them, but I feel the need to blast this out online too. \n\nNow that I’m a year out, I can acknowledge that I love my husband and our life together, but having a traditional wedding was a BIG mistake. When I think back on our wedding day, I am devastated to admit that the few emotions I remember from that day were not how much I love my now husband and excitement over our future together, but anxiety over my mom and whether shit was about to blow up. \n\nIf you’re recently engaged and have difficult family relationships, or aren’t completely sold on shelling out a ton of money on a wedding, please let this be yet another loud voice yelling at you: elope! have a courthouse wedding! don’t invite problematic guests! do whatever you want to do but for the love of god avoid that family drama at ALL costs! I wish would’ve stuck to what I originally wanted (eloping somewhere abroad), but alas, I made my decision and have to accept it. \n\nWhat I didn’t mention in my initial posts was that my relationship with my mom immediately and irrevocably changed as soon as I became engaged. Even though I knew she could be “a lot”, I had no idea what I was in for. If I could do it all again, I would’ve stopped that wedding planning train in its tracks after the first few signs of craziness. The cake was, unsurprisingly, just the last straw of craziness that happened. \n\nGreatest hits include: \n\n-telling literally (and I mean literally) everyone she knew that we were getting engaged, less than 10 minutes after my husband told my parents he planned to propose \n-upon sharing the proposal photos with her, commenting on how big I looked in the photos (which are, to this day, ruined for me) \n-told a family member, who commented on how beautiful I looked at a pre-wedding event, “yeah well she’s gained a lot of weight”\n-tried to crash my first look the day of my wedding and acted hurt that she wasn’t invited\n-did crash my first look and thew a fit when my wedding coordinator wouldn’t let her in\n-made the wedding all about how she never had a say in anything and that I was the controlling, immature one \n\nWe do still have contact today, but it’s limited and I am very guarded with what I choose to share. She never genuinely apologized or acknowledged the stress and hurt she caused. Short of some major changes on her part, I don’t see that happening. \n\nSo yeah, moral of the story is to absolutely soak up the fresh excitement of getting engaged. But seriously, ask yourself if there’s anyone in your life who will make wedding planning hell on earth. If you’re oh so fortunate to have a character like that, have a plan to handle it — and be prepared to enforce those boundaries. And for the extra crazy families out there, maybe just elope.",
        "score": 3303,
        "id": "1givjsj",
        "url": "https://www.reddit.com/r/bridezillas/comments/1givjsj/1_year_update_mom_changed_wedding_cake_behind_my/",
        "created_utc": 1730663550.0
    }
]