[
    {
        "subreddit": "IDontWorkHereLady",
        "title": "I got promoted while shopping at a store I don't work at.",
        "selftext": "So yesterday I was at my favorite local supermarket. I've been shopping there pretty much once a week for the past 6 years. I know the place like the back of my hand. I know most of the employees by name (I live in a small town of ~4000 people).  \n\nAs I'm standing in the taco aisle, trying to decide exactly how hard to punish my bathroom later (I picked Ghost Pepper salsa, so a lot), I am approached by a woman who must have been 75 if she was a day. SL will be sweet lady, and M will be Me. \n\nSL: \"Son, can you help me locate the aluminium foil?\" \n\n\n\nM: \"Sure, it's right up this way.\" \n\n\n*walks her to aisle 7b*  \n\nM: \"It's pretty high up, let me grab it for you. Do you want the Reynolds, or the store brand?\" \n\nSL: \"The name brand please.\"  \n\n*hands her a 200 foot roll* \n\nM: \"Do you need help finding anything else? I'm a walking directory of this store.\" \n\nSL: *Hands me her shopping list* \n\nI spent about ten minutes filling her cart with heavy/hard to reach items, and then I got back to my shopping with a smile and a \"have a great day\".  \n\nAs I'm standing in the checkout, I see the SL arguing with the floor manager (Greg, he goes to my church, we're pretty familiar with each other) over by the express line.  \n\nI pay for my groceries, and walk over to be nosy, and maybe help out. \n\nSL is telling Greg that \"The big guy with the red beard\" helped her, \"I didn't get his name\" and she wants to see him get a bonus, promotion, or employee of the month, something. \n\nGreg is insistent that no one with that description works there. \n\nI get to the counter, and before I can explain that I don't even work there, Greg pipes up.  \n\nG (to SL): \"Oh, you mean Mark? Yeah, he's one of our best employees.\" \n\nG (to me): \"Mark, this lady has been over here singing your praises for the past 5 minutes. I didn't even know you were working today.\" \n\nMe (Lying through my teeth): \"Well, Sharon (a cashier I know) called me and said we were slammed, so I came in on my day off.\" \n\nG: \"Well that's some real initiative, how would you like to be Assistant to the Regional Manager (we're both huge Office fans)?\" \n\nM: \"Oh my God, thank you! Are you sure?\" \n\nG: \"Well, you've definitely earned it.\" \n\nSL: \"See, this is why I shop here instead of Walmart, even though you guys charge more. You care about your employees, and your employees care about your customers.\" \n\n\nSo that is how I became assistant to the regional manager at a store I am not even employed by.",
        "score": 45493,
        "id": "7qjmcj",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/7qjmcj/i_got_promoted_while_shopping_at_a_store_i_dont/",
        "created_utc": 1516022409.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "HR said “we can’t make exceptions” so I took all my PTO at once",
        "selftext": "New manager comes in loud, talking about “structure” and “consistency”. Suddenly no WFH, no flex hours, no swapping PTO. I asked to move two days. My cousin’s wedding, she just goes,\n\n“Sorry, we can’t make exceptions to anyone. It wouldn’t be fair”\n\nAlright then, I put in a request for all 23 of my unused PTO days. Straight through end of quarter. No overlap, no coverage. It got approved in like…10 minutes? Lol okay.\nCouple days later she’s in full panic mode:\n\n“Wait who’s handling your workload?”\n“Dunno. I assumed you had a plan. No exceptions right?”\n\nShe had to cover me and deal with fallout. Stuff piled up, clients got pissy, two people quit. I came back to a new HR memo:\n\n“Managers can now approve flexible PTO on a case by case basis.”\n\nTurns out fair looks different when you’re the one getting screwed.",
        "score": 103147,
        "id": "1khxmhk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1khxmhk/hr_said_we_cant_make_exceptions_so_i_took_all_my/",
        "created_utc": 1746729426.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "Am I Overreacting bc I’m upset my husband cheated on me? :/",
        "selftext": "I (20f) found out that my husband (54m) had cheated on me 1482 times while I was getting treated for cancer resulting from him forcing me to take some foreign weight loss pills because he didn’t like my stomach was getting bigger since I’m 4 weeks pregnant with our child … it really hurt my feelings so I asked if we can talk about it and come up with a compromise maybe letting him sleep around and having some sort of open relationship (only on his end though because he is possessive of me and I’m not allowed to exist on the same planet as another man lol) but he didn’t take it well.\n\nI think it was also kind of a red flag when he sent me to the hospital last month because he strangled + threw a beer bottle at me as well as shot my dog because I accidentally sneezed when he was playing league of legends (he says I can sneeze when he’s at work but he’s unemployed and we live in his moms basement) so any advice is welcomed, how can I make my husband stop hating me for existing? :/\n\n(Obviously satire but this is how some ppl on here sound)",
        "score": 93625,
        "id": "1hi0rdy",
        "url": "https://i.redd.it/ty19k33rvu7e1.jpeg",
        "created_utc": 1734636112.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "I'm a teacher. Give me back my phone.",
        "selftext": "This happened a few days ago. Sorry for the formatting, I am on my phone.\n\nI work as a substitute teacher at various local highschools, I am 24 but obviously look younger according to this teacher. \nAT = angry teacher. Me = self explanatory.\n\nAT: \"why aren't you in uniform? And no phones during school!\"\n\nI thought he was talking to a student so I ignored him.\n\nAT: \"Excuse me, don't ignore me.\" He said as he snatched my phone out of my hand.\n\nMe: \"What the f**k, give that back, I'm not a student.\"\nAT: \"thats detention for swearing at a teacher, you will get your phone back at the end of the day, now you will come down to the office and tell the principle about how disrespectful you are being.\"\n\nBy this point I thought it would be funnier to let him complain to the principal who I play netball with and watch his reaction. He was raging. Saying I deserved to be suspended and that students always had their phones out yada yada. The principle and I were just trying not to laugh before she told him I was a teacher too.\n\nMe: \"now give me my phone back. Don't you have a class to teach? Because I do.\"\n\nI have never seen anyone go so red.\n\nEdit: English is my fourth language, so one or two spelling mistakes seems pretty decent. Also thank you for the nice comments.",
        "score": 30955,
        "id": "7dj4go",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/7dj4go/im_a_teacher_give_me_back_my_phone/",
        "created_utc": 1510902538.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Police Officer attempted to intimidate my patient, loses fight to physics.",
        "selftext": "I'm a paramedic. A few months ago, we're coming back from a routine patient transfer when at an intersection about four blocks from the base I notice a woman sitting on the side of the road with her arms wrapped around herself and her head down.\n\nI nudge my partner who's driving, and we flip on the lights and I see her head come up real fast, and she looks terrified. I get out and she relaxes when she sees the ambulance. After I approach, I notice bruising on her wrists and other similar signs of domestic abuse. \n\nShe seems hesitant to get up off the curb.and into the ambulance, so I decided that I would at least pull the cot out of the back and give her something a little more comfortable than concrete to sit on. \n\nNow a few important details. All the cots in my service are Stryker powered cots. You've almost certainly seen these before. They're bright yellow with black handles and side panels. These cots have a motor and battery built in to allow us to raise and lower the cot at the touch of a button instead of throwing out our backs having to physically lift the cot up after loading someone. They're usually paired with an automatic loading system built into the ambulance that lifts the cot up to the right height to be pushed inside and also secures the cot when loaded. There's a little red tab at the end of the track, just inside the doors, that you press down to free the cot and allow it to slide out. When you press this tab, it simply releases the cot and the loading carriage it's connected to and it's up to you to keep it under control until it reaches the unload position and locks into place again. This can be problematic because these cots weigh about 125 pounds, about 55kg. \n\nAs soon as I hit the release tab for the cot, I hear lights and sirens behind me. It's a city police car. Which is weird because we had not yet requested police, and we were outside the city, in the sheriff's department jurisdiction. We merely informed dispatch that we were stopping to check on a woman at such and such intersection. The woman says something along the lines of \"oh god he's here\" and moves faster than me seeing free food being distributed at base. She dashes past me and pretty much hurls herself into the ambulance, sitting on the bench seat. The cop is approaching and he's pissed. I put two and two together and slam the ambulance doors shut. Let's call this officer Police Officer Steve, or POS for short.\n\nPOS: Is that bi-Is she in there?!\nMe: Who?\nPOS: You know damn well who I am talking about.\nMe: You mean my patient? I'm afraid I haven't gotten a name yet. \nPOS: Open those doors, I need to talk to her.\nMe: You're not using my rig as an interview room. You can talk to her at the hospital.\n\nWe go back and forth like this for a few minutes, my partner at some point came back to see what the hold up was, but overhead my stonewalling and went back to the cab to call our chief. I continue my routine of deny and delay until a pair of deputies (likely specifically requested for this by the chief) arrive. Oh good, now I have witnesses. \n\nSee, we had stopped on an upwards incline. I had hit the release tab on the cot and it wanted to slide back. I had to close the doors so swiftly, I didn't bother pushing the cot back against the stops and locking it in place.\n\nEmboldened by the presence of two deputies, he gets in my face. \"Get out of my way or I'm gonna have to charged with obstruction!\". Okay. I step out of his way, and he opens the double doors. Between the cot, the monitor, and the jump bag, I'd say there was probably close to 160 pounds contained by those doors. All of which comes barreling out and hits POS square in the chest. He goes backwards and falls on his ass. One of the deputies laughs aloud. The other walks up and kneels down beside the guy. He says \"Your shift captain is going be here in five, I wouldn't be here then if I were you.\" POS gathers himself up and scowls at me, then stomps off.\n\nThere is a limited amount that I can say about the aftermath as the trial is not settled yet, but we all know how well charges stick to cops. The woman is now living elsewhere, the cop is still a cop, and I have been getting pulled over at least twice a week ever since then. But the video footage of him getting bodychecked by that cot remains one of the best things I have seen.\n\nEDIT: For clarification, yes the woman was/is married to POS. And yes, he is allegedly responsible for the abuse.",
        "score": 63672,
        "id": "okmqi2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/okmqi2/police_officer_attempted_to_intimidate_my_patient/",
        "created_utc": 1626329105.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "Hubby fired me from a job I don't work!",
        "selftext": "My husband is a manager at a local big name grocery.  We were down to 1 car at the time as the other clunker died and had not yet been replaced.  I was waiting in the front of the store for my husband's shift to end, when a crazy lady demanded I check her out.  I had barely gotten out a \"Sorry, I don't ....\"  when she stomped off to a manager to complain!  I over hear her complaining to hubby \"That lazy employee (pointing to me) refused to help me and she should be fired!\"  Hubby walks over to me with a big grin on his face, that crazy lady couldn't see, winked at me and \"fired\" me on the spot.  He said very loudly \"You will never work here again!\"  I played along, covered my face with my hands and started fake sobbing saying \"My babies, how will I feed my babies!\"   \n\n I would like to think crazy lady felt horrible, but I peaked through my fingers as I ran to the back only to see her smug face.   Later in the car, hubby said it was all he could do not to crack up!",
        "score": 28919,
        "id": "1hcwiea",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/1hcwiea/hubby_fired_me_from_a_job_i_dont_work/",
        "created_utc": 1734040474.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "Some assembly required. Good luck.",
        "selftext": "On mobile so apologies for any formatting issues.  First post as well.\n\n\nThis happened several years ago.  I was the night time charge nurse over the ICU.  I’d just finished a 12 hour shift at my hospital that had turned into a 14 hour shift because of a rapid response right before shift change.  (Patient responded well). I was exhausted and had to return for a 4th shift in 9 hours.  All I wanted were some items to drop in the slow cooker so I’d have something to eat when I got up tonight.\n\nI stopped at a well known big box store that sells groceries, clothes, electronics.. the works.  \n\nI’m wearing royal blue scrubs, a name badge with a big RN under it and forgot to take my stethoscope off so it’s hanging around my neck.  The employees here... well... don’t.\n\nAs I’m walking towards the store I see an elderly couple struggling to load a large box in their SUV parked at the front of the store.  And I mean old. 90+ Shaky hands. Teetering around with limited mobility. The kind I see with a med list 3 pages long...   no way would his hips take the weight without snapping... and I’ve worked enough tonight.\n\nI approach quickly and address the female half of the couple offering help.   It was gladly accepted and I got their TV loaded with very little difficulty. It was more cumbersome than heavy.  I’m chatting with the woman who is explaining it’s a gift for their son and her husband hadn’t wanted to wait for help.  (I’d wondered why an employee wasn’t helping.). That’s when it happened. \n\nI will be RN.  She will be EB for entitled bitch.\n\nEB:  hey.  Hey!  \n\nStartled, We stop our conversation and look over.  It’s a lady in her 50s dressed in a cheap looking beige pant suit with a get your manager hairstyle standing about 15 feet away with a hand on her overly broad hip.\n\nEB:  IF you are ABOUT done. I need help over here.\n\nShe then points to her cart with two boxes of bookshelves.. some assembly required. I realize she thinks I work here.  \n\nRN:  Oh Sorry.  I don’t work...\n\nEB:  You are already making me late! Just get it done!   ...and DON’T scratch my paint up.\n\nThe elderly lady and I exchange looks of disbelief and I try again. \n\nRN:  I don’t work he...\n\nEB:  Just get it done! \n\nShe then steps away from her cart to grab her purse grumbling about “Fucking idiots” and is digging for her keys when the cart rolls further away and one wheel goes off the curb.  The entire uneven load causes the cart to topple over.  I instinctively jump forward to try to prevent everything from falling...  \n\nI was unsuccessful.  EB, who has now turned to see her particle board bookshelves spilled out on the cement. Corners of the boxes crushed and one has torn open with a few pieces and packaging now exposed.  EB completely loses her shit and becomes a raging thunderc*nt.\n\nEB:  What the fuck!  You fucking moron!  Pick them up!  God dammit.   Fucking...  I’m going to have you fired!  You owe me new bookshelves! And I’m late!\n\nAt this point. I’m done.\n\nRN: Pick them up yourself!  I  Don’t  Work  Here!\n\nI then turn to go inside when I feel her grab my sleeve and try to yank me around.  I jerk my sleeve out of out of grip and turn to face her now violently red face.  She opens her mouth to start screaming again but I put my finger in her face and say... \n\nRN:  No!  Don’t touch me!  Shut the hell up!  I do not work here, and even if I did.  I’d quit before I help you clean up your shit!\n\nEB stands there speechless.  Mouth opening and closing. Sputtering in shock that I’ve dared raise MY voice at HER.\n\nThat’s when the manager and an employee come out.  As EB sees the manager and finds her voice. \n\nEB:  Are you the manager?  This man damaged my bookshelves and is refusing to pay for them.\n\nI just stare in shock.  Seriously?!  Having realized that a man in bright blue scrubs with a stethoscope and a big RN badge really doesn’t work here. Instead of apologizing, she chooses to double down on the craziness and now accuses me of breaking her stuff.\n\nBefore I can voice my denial the elderly gentleman I’d helped earlier steps in and explains the situation to the manager.  EB is still voicing complaints but the manager realizes the real situation and apologizes to me and the couple.\n\nI’m still standing by watching angrily as the manager deals with EB and inspects the bookshelves.  They are not damaged. He offers her two new boxes but EB is now done with the whole situation.  She says no. She’s already to late because of me.  Just glares over at me and says to the manager\n\nEB:  Just load them. I’m already late enough because of this!\n\nThe manager and employee then lift the boxes up and get them wedged into the ladies car.  \n\nAs I shake my head and go to enter the store I’m stopped by the elderly lady I’d helped earlier.\n\nLady:  Sir.  Thank you so much for helping us with the TV. I’m so sorry some people are so rude.\n\nShe then reaches for my hand to shake.  As she folds both her fragile hands around mine, I can feel something in her palm she’s giving me.\n\nLady whispering:  Don’t look yet. Wait till she leaves.\n\nI slide the package into my scrub pocket and Lady walks away.  EB then gets in her car and (without apologizing or thanking anyone) peels out and drives away.  \n\nI finally enter the store to grab my food items and when I reach in my pocket I pull out a plastic bag with a bunch of screws and hardware. \n\nI realize immediately that the sweet little old lady took advantage of the commotion to steal the hardware out of EB’s ripped box.\n\nI couldn’t believe it.   I had the biggest grin on my face as I did my shopping.  And I have a new petty revenge hero to idolize.\n\nEDIT:  Thank you for the gold and front page!  Had no idea.  Little overwhelmed. Gone from 12 karma to still counting.  Thank you all. \n\nHeya, Just wanted to let you know we turned your story into a video  🎥\n\nhttps://www.youtube.com/watch?v=4Y3mTg4S-aE&t=5s take a look.",
        "score": 26954,
        "id": "86a35v",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/86a35v/some_assembly_required_good_luck/",
        "created_utc": 1521709201.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Lost my friend because I couldn’t afford her wedding and now karmas coming around",
        "selftext": "Don’t want to bore anyone with the details but my husband and I went through a financial hardship out of no where while I was a bridesmaid of a friends wedding a few months ago. As we were going through this hardship the bride wanted a few hundred dollars for bridal events on short notice and my husband and I had rent to pay. We couldn’t pay both on such short notice, obviously we chose our rent. I tried to explain this to her, she  didn’t understand, got mad, and she demoted me to a guest over it claiming I was a horrible friend and should of budgeted (keep in mind we have children and I’m a SAHM, trust me, we budget) and we haven’t spoke since. I couldn’t believe such a good friend of mine could be so cold hearted. But thankfully happy to say our financial situation is starting to get better!\n\nI recently found out her and her about to be husband just got laid off at the same time because they both missed so many days at work and kept calling off and we’re pretty much not doing their jobs. They are in a ton and ton of debt too and we’re about to buy a house. I know she’s a bridesmaid in a few weddings as well right now, maybe she can feel how I had to feel for a little bit. I never wished anything bad for her despite everything, but wow. Funny how karma comes around.",
        "score": 7095,
        "id": "1fzi6lw",
        "url": "https://www.reddit.com/r/bridezillas/comments/1fzi6lw/lost_my_friend_because_i_couldnt_afford_her/",
        "created_utc": 1728443860.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Coworker asked me to be her man of honor.  I said no and she went nuts.  What did I miss?",
        "selftext": "This happen yesterday and I'm still confused. \n\nYesterday was my first day back to work after being off for two weeks.  This is kinda important.  One of my coworkers had gotten engaged the week before I left. When she announced at work we all did the congratulations and happy for her type of things.  I thought it was over.  So when I left for vacation the last I knew no plans had yet been made.  Then yesterday when I went back to work my boss K and best friend L said that coworker C was looking for me.  I asked what was up and they weren't sure but she was carrying a little gift bag. \n\nA few minutes later C found me and asked how my vacation was. I was telling them about it and she cut me off and said she had a very important question to ask.  She handed a little gift bag and asked if I would be her best man of honor for her wedding.   I thanked her and told her that typically this would traditionally go to a close female relationship.  She responded that there was nothing traditional about her wedding so it was good.  I looked over at L and K who were both trying to keep from laughing.  I again thanked her congratulated her and told her that I wasn't interested in being part of her wedding party and that I would be happier being a guest in the audience. \n\nI swear when I said this it was when we watched her entire demeanor changed and a switch flipped.  She went off saying that I have to be in her wedding and that she doesn't understand why I would say no. I told her that we only knew each other for a short time and that I had no interest in trying to plan parties, dinners, and shopping trips.  She told me I needed to think about it and she would get back to me later.  I told her go for it but my answer will be the same. \n\nShe walked away and I looked at K and L and asked what the ever loving fresh creepy hell was that???  K started to laugh and said she didn't know.  But saying no like I did might have saved me a lot of headaches in the future.  L made the comment that she went straight to bridezilla and this was a look into what she was going to be like.  \n\nC came back today however she went with a different approach and handed me a list of what she wants me to do and her vision of how she sees things.  I asked her why she gave me this and she said that as her man of honor these were my responsibilities.  I told her again that I was not going to do any of this.  She started again that she needs me to do this and \"How much fun it was going to be.\"  Then she asked \"Haven't you ever wanted to be part of something special?\"  I told her I was.  I was a nurse.  Enter K who could sense that I needed help and told C one of her patients needed her help. I told K that if this keeps  up I might need her help.  She said she was already watching it and and would intervene if I needed it. \n\nWhat did I miss??? We aren't that close.  She just transferred down to my unit from a different unit six months ago.  I had no idea who she was until that point.  L is saying that she is close in age to me and she might feel that to be enough of a connection. Did I miss something???  When we are asked are we supposed to automatically gush and jump up and down in excitement?  Why is saying No a bad thing?",
        "score": 6131,
        "id": "1gf9idw",
        "url": "https://www.reddit.com/r/bridezillas/comments/1gf9idw/coworker_asked_me_to_be_her_man_of_honor_i_said/",
        "created_utc": 1730246725.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "Entitled old woman grabs autistic kid.",
        "selftext": "This story is kinda different, in the way that I (employee) witnessed a autistic young man, ( maybe 14years old) get caught up in some crazy lady Idwhl situation.\n\n\nLet me set the scene for ya,\n\n\nI, working as door greeter watching out for lost Customers and folks with returns, working in lawn and garden section, I see this autistic young man ,( I guess he is autistic, as he seems predominantly focused on his action and kinda has the actions of an autistic individual.)\n\n\nThis young man is sorting and moving potted flowers around putting them in a very specific order, matching colors, size of pots, and height of the flowers themselves, ( doing an amazing job at it too I may add.)\n\n\nHe is bothering noone and most folks are just noticing him doing a bang up job,\nBut this one old crone of a woman sees him \"working\" she stands behind this young man arms folded and tapping her foot, (at first I was thinking maybe it was her son or someone she was shopping with, but the next thing she did proved to me I was mistaken.)\n\n\nShe clears her throat in that dreaded fashion we all know, \" ahem...excuuuuuuuse me You need to help me.\"\n\n\nThe young man pays her no mind, continuing with his task, she doesn't like this, she clears her voice and replies louder,. YOU ARE NOT LISTENING TO ME, YOU ARE GOING TO HELP ME NOW!!!.\n\n\nBefore I can walk to her and ask her what she needs she reaches out and grabs this young man by the right arm just above his elbow, I guess the sudden action of this and the young man's condition caused him to spin around and jerk his arm away from this lady, and the sudden movement startled the old woman causing her to step backwards and lose her balance causing her to sit down on her butt.\n\n\n(It was like in slow motion watching her go from standing to sitting on the ground)\n\n\nBy the time I reached the young man to see if he was ok, his mother had shown up and was asking what had happened, before I could say anything the woman who had caused this was up and berating this young man. Saying he attacked her and she will have him fired and arrested, meanwhile this young man was almost crying and his mother was shocked.\n\n\nI told the mom to take her son and calm him down, that he has done nothing wrong and just make sure he is ok.\n\n\nCrazy old women didn't like that I took his side, she began to lie and tell me she was the victim and she didn't do anything, that the employee (young man) attacked her.\n\n\nI told her not so kindly \n1. she was a liar and I had witnessed the whole incident\n2. The young man you forcibly grabbed does not work here and you assaulted him.\n\n\nBy now a crowd has gathered, and the crazy woman has noticed that noone is giving her looks that they believe her side of the story.\n\n\nShe just puts her head down and walks quickly out the store.\n\n\nWhen I turn to check on the young man and his mother She was smiling at me and was thanking me for my help, she shops here regularly and the young man likes to arrange the flowers, it's calming to him, I express my regrets about the whole incident, the young man walks over to me and Pats my shoulder once and goes back to the flowers, the mom informed me that was the equivalent of a high five from him.\n\n\nThat was it, then they were gone.\nIf this story doesn't qualify for this sub, mods feel free to delete.\n\n\nJust wanted to share.",
        "score": 25978,
        "id": "7xftgg",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/7xftgg/entitled_old_woman_grabs_autistic_kid/",
        "created_utc": 1518586007.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Apartment manager \"doesn't take cash\" for $0.02 bill. Malicious compliance ensues.",
        "selftext": "In 2019 I moved from an apartment complex in Celebration, Florida, to a condo.  As usual, when you move out of an apartment, you get a final bill, which includes your last month's pro-rated rent, deductions for damages, security deposit refunds, and the like.  We paid it.\n\nThe next month I get a call from my wife who says we've got a follow-up bill in the mail from the apartment management company, for $0.02.  We're both in the tech field, so we laughed that this company's IT deparment didn't catch the edge case of spending $0.50 in postage to collect $0.02 in revenue. But it happens.\n\nMy wife prints out a copy of the bill.  I grab two cents from the change jar.  The apartment complex is on my daily drive, so I swing by the office.  I walk in and tell the manager that I want to pay my last bill.  \n\nI say \"It's two cents. Here's the bill, and I have the two cents if you want it.\"\n\nThe manager says \"We don't take cash.\"  Nothing else.  There was an awkward pause.\n\nI say \"I don't expect you to take cash. I expect us both to have a laugh about how silly computer systems are, and for you to write off the two cents, because it'd cost you more to process the payment.\"\n\nShe says \"I'm not going to do that.\"  Again, awkward pause.  \n\nI say \"So you want me to write you a check ... for two cents.  And mail it?  And you're going to process that check?\"\n\nThe manager says \"Yes, send us a check and we'll process it.\" and then WALKS BACK INTO HER OFFICE to end the conversation.\n\nSo I go home and set up an automatic, monthly bank payment to my apartment complex.  For **three** cents.\n\nAnd then, because I'm a programmer, I write some code to send a letter once per month, saying \"I'm so sorry - I've overpaid my bill.  Please send me a check for the overpayment.\"  And I use an online service that sends post cards in ridiculous sizes - up to around 18\"x24\", figuring that'll be my escalation strategy.\n\nThe first of the next month, I get a call from the apartment company's regional manager.  After introducing himself, the next two minutes were the most sincere, \"Oh god, we made a mistake - please don't do this, we'll never contact you again\" apology anyone could've hoped for. \n\nI stopped the mail and never heard from them again.  Did I spend several hours on MC for two cents?  Yes.  Was it worth it? Absolutely.",
        "score": 62150,
        "id": "ysarcg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ysarcg/apartment_manager_doesnt_take_cash_for_002_bill/",
        "created_utc": 1668173942.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "No Room For Child Killers In This Cell Block",
        "selftext": "This story was told to me by my friend's dad. He is a personal trainer and was training this guy in the gym who just got out of prison a couple months prior, and told him this story. \n\nIt spread through the prison like wild fire about this man who got what was coming to him. A man was convicted for raping and killing 2 girls (a 5 year old and 9 year old). He mutilated their bodies and traces of semen was found inside them. This was the worst of the worst and other prisoners found this out within the first week of him arriving. \n\nThe man was only serving life, but didn't get the death penalty. This angered the other prisoners who decided to take revenge. The prisoners started taking broomsticks from the janitor closet, and after collecting a few they went into his cell at night. (No one knew how the doors opened, but it was said prisoners had connections with the guards) When the doors opened the prisoners went into the guys room, gagged him, tied him up, and proceeded to shove 14 broomsticks in his ass. Violently and forcefully. \n\nThe body was found in the morning bound and gagged. It was said that he bleed out over a period of hours. A gruesome, painful death for someone who deserved it. \n\n(Thank you for 5k upvotes and make it the 8th best post of all time on this subreddit.)",
        "score": 7490,
        "id": "b5lenv",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/b5lenv/no_room_for_child_killers_in_this_cell_block/",
        "created_utc": 1553575464.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Hell Hath No Fury Like Me Scorned",
        "selftext": "This story starts 31 years ago, but the revenge part was pure serendipity that began two years ago.  I'm going to shorten some (most) parts because it's a crazy ride, but I'll be happy to answer any questions y'all have.  I learned a fuckton on this journey, and part of the reason for this write-up is to share that with others.\n\nThe beginning:\n\nIn 1990 when I was just out of middle school and my my sister was still in elementary, my dad met his third wife at the only gas station in our town.  They soon moved in together, and my dad abandoned us in our basement apartment to live on a shanty houseboat, that didn't run, to live with her.  He would show up every other week and give me $40 for groceries.  Eventually, someone figured out the situation and called my mom.  We went to live with her which was, believe it or not, worse.\n\nMy dad and his shanty wife got married in 1991.  Not long after, she called me and told me my dad's brain tumor had returned (it hadn't) and that he couldn't handle the stress of being around us.  That the only people he could bear to be around was her, and her son, \"Shorty,\" who was my age.  When I called my dad to ask if this was true, he said it wasn't, and he just couldn't believe that she would say that to begin with. That was one of our last conversations until two years ago.\n\nThe middle:\n\nThere's not much in this part.  I worked my way through college, living in my car from time to time.  My dad and I were no contact, but I heard from family that he'd bought a house and put his \"son\" through some vocational classes. When my grandmother died, Shorty and Shanty Wife showed up in a truck and took all the furniture and anything else that wasn't tied down or already gone.  Eventually, I went no contact with my dad's side of the family.  I struggled for years, decades really, but I **made** it.  And I have a great job and a good family now.  The best revenge is living well, right?\n\nThe pre-end warmup:\n\nTwo years ago (Oct 2019) I got a call from my dad's brother, \"Allen.\"  He told me my dad was in a nursing home in another state (great!) and I needed to go see him because he needed my help (WTF?).  Shorty had ghosted him (aahahahahHAHAH!).  The nursing home, coincidentally, was about 20 minutes from my house. And I saw an opportunity and I went.\n\nThe reunion was underwhelming.  I didn't want to make amends, but I DID want to hear how he wound up dumped and all alone in another state.   And it was a really, really good story.  Shanty Wife got lung cancer and put my dad in a nursing home before she died in 2017.  She suffered, and I was happy to hear it but sad it wasn't ass cancer.  Shorty became his power of attorney (POA) when she died, and had been visiting my dad, living in my dad's house with his two children, and \"taking care\" of my dad's affairs since his mom died.  But now he was MIA, and my dad was worried about him.  He asked me to drive the hour and a half to his house to check on everything.  That's all he wanted.  He never even asked me how I had been.\n\nI agreed to go; I think out of morbid curiosity.  I'd never even been to my dad's house.  I did want to see where he lived with his \"real\" family for 30 years. I wanted to see what could have been my life. It was 50 shades of fucking awful. The grass hadn't been cut all summer.  You couldn't get to the front door for the overgrowth.  There were three pickup trucks in the yard; two were full of trash.  Cabs and beds and backseats, just trash.  Mail, clothes, paper, shoes, garbage bags.  I couldn't understand it.  My dad's handicapped-modified SUV was on four flats and full of garbage, too.\n\nI didn't have a key, so I just walked around.  From what windows I could look through, the inside was in shambles and hoarded to hell.  On the front and carport doors were dozens of notices from the city that they were going to condemn the place.  The carport was also hoarded.  Boxes and boxes stacked on each other, most rotting from the rain.  The yard was full of garbage.  Broken Christmas ornaments, more shoes, rusted tools, old toys.  There was a letter in the mailbox notifying him that since the house was abandoned, mail would not be delivered anymore. That night, I googled Powers of Attorney and how to use them.\n\nI went back the next day and showed my (bedbound) dad the pictures on my phone.  He vowed to \"beat Shorty's ass,\" then asked me to help more. I told him I would, but he'd have to sign Power of Attorney over to me.  All of it, durable (financial) and medical.  If he didn't, he could figure this shit out by himself.  He agreed, so I set about finding a lawyer who would drive to another state and do the paperwork in the nursing home.  Bless that lawyer for being so good at his job, because all I did was tell him what I knew, and he put together a beautifully bulletproof POA. It was full of stuff I didn't even know I would need.  He also filed the paperwork to revoke Shorty's POA. And now I'm unstoppable.\n\nWe're from a small, rural town and it's the kind of creepy, landlocked place that, no matter how long you've been gone or how far away you've been, when you go back, you'll see someone you know.  Even if you don't know you know them.  It's like playing Seven Degrees of Everybody, all the time.  It's suffocating.  But it can also be helpful.\n\nThe beginning of the end:\n\nI got to work the next morning.  I didn't know how scorched the earth would be when I finished, and I didn't want Shorty or anyone from his prolific, inbred family trying to find me, so I made sure nothing I did had my name on it. \n\nI opened a google account for my dad and got a google number.  I opened a PO Box for him in his town.  I put in a mail forwarding notice. I pulled his credit report.  I took the POA to my dad's small town bank, changed the address on his accounts and got new account numbers.  I requested copies of every transaction back to the day Shanty Wife had died (about 13 months worth).  I had to go to the main branch, two hours from my house, the next day to pick the records up.  I sat in the lobby all afternoon, going through the account.  I cornered a service rep and got a crash course in his debits and deposits.  This is when I figured out the extent of Shorty's staggering stupidity.\n\nMy dad got about $5K a month in disability and social security every month. Twice a week, Shorty was going INTO a branch and withdrawing cash.  ALL of the cash.  For 13 months.  And every time he did it, as the POA, he had to sign a form stating that he was acting on behalf of my dad, and that form was notarized by the bank. I went through every withdrawal and got the bank to confirm that every one of them was made by Shorty.\n\nThen I went to the house and called a locksmith.  I knew it was bad, but I had no idea what was waiting for me there.  He got the first door open, and the stench rolled out like a fog bank. We both gagged.  Two locks later, I was so embarrassed by what he had to see and smell, I gave him a $60 tip. And, with shiny new keys in hand, I called the cops.  I told them I was POA for my dad, was checking on his house, and there were three vehicles there that didn't belong to him.  He asked me if I knew who they belonged to.  I said no, and I wanted them towed.  He told me to call a tow company and he would meet them there.\n\nThey showed up with two wreckers.  The tow truck guy got out and asked me for a signature.  I only signed my first name.  As I was signing, he asked, \"Do you know Shorty?\" Running on pure hatred at this point, I surprised myself.  \"Do you?' I asked.  He said he did, and that \"...he's an asshole.\"  I responded, \"He might be. Hey, can you do me a favor?  If you see him, will you tell him MNWNM is coming for him?\" His bravado evaporated.  He knows a crazy bitch when he sees one.  They towed the trucks.\n\nWhen everyone was gone, I opened the door in the carport to peek in.  The sun was going down and it was dark in the house.  I heard something faint, and after some seconds realized it was the roaches and the rats doing their roach and rat stuff.  I could smell it all in my hair.\n\nI sat on the carport steps and watched the sun go down.  I was mad.  Just so fucking cosmically LIVID that 72 hours was all it took to dissolve three decades and here I was, stinking and listening to the rats and cleaning everyone else's shit up. Taking time away from my family, and for what?\n\nI had a coming-to-Jesus with myself; I could either bow out now, or double down.  And the thing is, I'm tenacious. To a goddamn fault.  I had to be to survive, and this was a bone I couldn't put down. The thought of Shorty's life being upended, his only source of income (probably) disappearing literally overnight, and my dad having to hear, second-hand FROM ME, that he's broke and alone, made me absolutely giddy.  I desperately wanted them both to lose what they had left.  So, I decided I was going to triple dog down. That night, I googled restraining orders.\n\nAnd it was surprisingly easy to get one!  I went to the courthouse in my hometown, went to the clerk's office, and told her I needed a restraining order.  I filled the form in at a rickety little table while I was there.  I wasn't prepared to see a judge that day, but she took the form and said \"OK, I'll see if the judge is still here.\"  That kind of scared me. She took me to his chambers, and as I was waiting, I looked around and saw he had certificates of appreciation hanging up from various veteran's groups.  Then I wiped my palms and thought, \"Fish in a fucking barrel.\"  He asked about my my dad's stint in the Marines, and about the DoD office logo on my sweater (I'm a contractor). He read my form and granted the temporary order. I would have to go back for the permanent one, where Shorty would be able to argue against it. Then I went home and googled biohazard companies and elder abuse statutes in my state.\n\nI hired a biohazard company to shovel all shit out of the house for $7K.  I would have paid double. They found my dad's mummified dog under some pizza boxes in the master bedroom.  They sent me pictures and salvaged some papers.  Shorty was served during this time, and a hearing was set. I got to work collecting and documenting shit.  I made pictures and spreadsheets and timelines with cross references because fuck it, now they had my full attention.  (The paid versions of Truthfinder and Trello seriously got me through all this.) In my spare time, I went to the nursing home and gave my dad 8x10 copies of the pictures of his dead dog.  From every angle.\n\nBefore court, I went to the police station nearby and told them I wanted to report an elder abuse crime.  A \"white collar\" detective came out and told me it was a domestic matter and that since Shorty had been POA, everything he had done was legal.\n\nAnd this was the day I got to teach a small town detective about the fiduciary responsibilities of a POA.  Thanks google!  I handed him a copy of the statute with the applicable sections highlighted.  Then I handed him a thick folder with bank statements, pictures of the hoarded house and dead dog, a copy of my dad's credit report that showed he was tens and tens of thousands of dollars in debt, and a spreadsheet listing every cash withdrawal with a running total of the stolen amounts.  The grand total was just over $130K in cash.  That's not the including the lost value of the house or the credit cards he opened and used.  I told him he could keep that folder since it wasn't the only one I had.  Then I told him I would wait for a case number, and I sat down.  He came back about 30 minutes later and apologized, said I had a case, and gave me a case number. Then I headed over to the courthouse.\n\nEdit: mods asked me to remove YouTube link. But sing The Doors' song This Is the End as you read this part:\n\nThere were other people there and I had to wait my turn.  And while I was waiting, that stupid motherfucker schlepped his sloppy ass into the courtroom, by himself and obviously, literally, non-metaphorically, dirty.  His shoes were untied and that turned my giggle box over.  Then it was our turn and we stood up.  The (same) judge asked me some questions, asked him some questions, and asked me if I had any proof.  I had a very thick folder of it.  The judged asked me if I had gone to the police.  Well yes, sir, I have.  Do you have a case number?  As a matter of fact... The order was granted, permanently and for life, but not before the judge halted proceedings and told Shorty he needed a lawyer.\n\nSomeone told me that the courthouse would have a copy of my dad's DD214 (discharge papers) so while I was there, I got a copy of those, because why not? I also used my POA to take Shanty Wife off the deed to the house.  That way, if my dad died and it went into probate, Shorty had no immediate claim.  I also went and got copies of my dad's birth certificate and Shanty Wife's death certificate.  Technically, step children can't request that info, but the clerk who waited on me recognized my dad's name and told me she lost her virginity to my uncle Allen in the 60s, and went to my grandparent's funeral.  So I got all the forms I wanted.\n\nShanty Wife left my dad $50K in life insurance.  About $35K of that was left since Shorty was spending my dad's money and not his mom's.  So I opened an Ally account and transferred every penny over. Then I set up recurring transfers for the monthly deposits.  At any given time, there was no more than $100 in his account.  I also found a house flipper that paid me enough for the house to pay off his mortgage.  That's the thing about probate, there's nothing to fight over if \\*there's nothing there.\\* And I made sure there was fucking NOTHING there.  My dad died thinking he stilled owned a house.\n\nSpeaking of which, this is about the time I found my dad's life insurance policies.  They were up to date, and Shanty Wife was the beneficiary.  My POA didn't allow me to change beneficiaries, but it allowed me to assign them, and since Shanty Wife was dead, there was technically no beneficiary.  This is where the death certificates came in handy! I assigned my sister and me as beneficiaries.  Irrevocable, too, which means that the only way to change that is for my dad AND me AND my sister to agree to it.\n\nI kept my dad in the dark about all this.  The only thing he ever really knew about was the restraining order and his dead dog.  I found out that he had purchased the gravesite next to Shanty Wife and wanted to be buried next to her.  That was just never going to fucking happen.  I googled national cemeteries, and found out he qualified to be in one since he was a disabled Vietnam-era veteran.  So I arranged for that, instead.\n\nAll the cherries on top:\n\nMy dad died in June this year and I was there. He's buried in a National Cemetery far away where no one will ever go visit him. The only obituary I ran was on the funeral home's website and that only for insurance purposes.  I wrote it as vague as possible.  There was no service. His urn is purple, the color he hated most.\n\nI got a call in August from the prosecutor's office in my hometown.  The lady on the other end is married to my first cousin because of course she is; that's how it fucking works there.  Shorty was arrested just after midnight on July 1st, was still in jail, and had been arraigned on felony elder abuse charges.  He's facing 10 years in FPMITA prison.  She told me not to expect the trial any time soon, as it can take up to three years for that to happen.  I told her that was awesome since the uncertainty will hopefully haunt him. And after all that, he's still got prison to look forward to!\n\nHe lost his kids.  He lost his \"dad.\" I'm spending his mom's cancer money. He lost his free house and trucks.  He has no credit and will never be able to get any sort of decent job and will, hopefully for a long time, not be able to find a decent place to live.\n\nAnd I sleep like a fucking baby.",
        "score": 7346,
        "id": "qvkgvi",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/qvkgvi/hell_hath_no_fury_like_me_scorned/",
        "created_utc": 1637103124.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "I didn't give my twin brother my kidney because he had an affair with my girlfriend and then outed me as bisexual",
        "selftext": "I was told to post my story here and figured this was my revenge \nCast: (fake names for obvious reasons)\nMe=Ryan\nBrother=Sebastian \nMum=mum\nDad=dad\nSister=jane\nBest friend=issac\nCousin=kai \nBackstabbing cow=girlfriend\nHusband= Daniel\n\n\nI Ryan and my twin brother Sebastian have never ever been close, in fact he made life hell growing up and my parents didn't help by playing favourites(getting him better stuff on our birthday, only going to see films he liked at the cinema and giving him extra money for housework despite us doing the same amount of work) he would always put me down, belittle me, bully me with his friends at school, break my stuff and his then blame me and was just a pain in general. Growing up the only people I knew to rely on was my older sister jane, my cousin kai and best friend issac who all knew what an awful person my brother was. \n\nAnyway cut to when I was 17 and I had my first girlfriend, someone I loved very much. We didn't have sex cause she wanted to wait til her 18th birthday to lose her virginity, but it turns out that she was having an affair with my brother behind my back for half the time we were together and only got caught when it was revealed she was pregnant. I was crushed, she knew how much I hated my brother and she saw some of the awful things he did to me but she still went and did that. Cheating is bad enough but to do it with him of all people. I punched him in the face and broke his nose and made him lose a tooth but according to my parents I'm the one in the wrong and now we have to help this girl who is carrying my brothers child and have to help support them. My brother then said he had no intention of being a father and told my girlfriend to get an abortion. She then ran out of town and I never saw her again, don't know if she had the baby or aborted all I know was that she was gone and my folks were still praising my brother as the golden child(I was still the black sheep and failure as usual) \n\nanother year goes past and me and my brother still despise each other but I had started dating again, was a long while but I found someone. Found a boy I liked. I am bisexual and this new guy daniel I had met at college caught my eye, he was deaf and I studied sign language out of boredom so we got talking and things just seemed to click. We date, fall in love, bring him to my friend issacs party to introduce him to friends and all feels great. At this point the only one who knew i was bi was issac but one day walking into a cinema holding my boyfriends hand I bump into my evil twin. He points, laughs and says some homophobic remarks. I tell him to go fuck himself and I go see a movie with my arm round my boyfriend. When I got home after dropping my boyfriend home I knew I'd be facing something as I walked through the front door. I saw both my parents on the sofa, my mother crying about how on earth could she have given birth to someone so disgusting (was it too much to hope she saw the light and was talking about my brother) but nope she was talking about me and how I'm a stain on our families name. My father gets up to yell at me, spout homophobic remarks and slurs. At this point I see my brother up the stair case with a shit eating grin on his face, he then comes down and says his uncomfortable with sharing a room with a fa**ot and my folks kick me out there and then. With what little clothes and money I had I went to issacs house and his family took me in where I stayed for six months actually experiencing familial love and affection and issacs mother and step dad I consider my own parents now. Eventually me, daniel and issac all get a two bedroom flat together and all is good for the time being.\n\nSo cut to December last year, me and my boyfriend now husband daniel are married(issac was my best man, my sister and cousin kai walked me down the aisle) I have a brilliant job in graphic design, have my own house by the sea and life has never been better. However I got a call from my sister that my brother was in hospital. I hadn't thought about him that much over the nine year period since I was kicked out but being reminded of his existence brought up a lot of painful memories for me. I was told by my sister that Sebastian wanted to see me and that it was urgent, so I went to the hospital he was in and  met my sister outside the front entrance, I ask her what this is all about but she doesn't tell me and that I need to ask my twin. So I arrive to where my brother is who have my parents at his side and my folks actually look happy to see me, as if what they did to me hadn't happened and Sebastian also looked really pleased to see me. It's safe to say something was off. Eventually I ask what's going on and why was I even here to which my brother tells the family to leave us two alone. He looks so weak as before he used to intimidate me so much. He told me that he was dying from kidney failure and has been for the past few years but now he didn't have long left, I knew immediately where this was going. \n\nHe then said he always regretted that we never got along at which point I told him \"no\" he looked confused and asked what I was on about so I simply told him I wasn't going to donate my kidney to save him. He looked as if I had just shit in his food. He then went on about how bad the situation was and that he really was sorry for all the things we did to each other growing up. Like excuse me? We did to each other? I told him that I just wanted a brother growing up that cared and loved me who wouldn't try and break me every day for 18 years. He then called in our mum and dad and told them that I wasn't going to give up my kidney, they then started to spout off that I owed them for my existence and that I have a duty to look after family. I asked them where that duty was when they kicked me out of the house or where that duty was every time my brother gave me a black eye or their duty was to look after their grandchild when Sebastian decided he didn't want to be a father. I said for all the things his done from outing me to having and affair with my girlfriend and abandoning his child that this was the universes (and my) way of finally giving back what he dished out to bite him in the arse. I then turned around and walked out of the room having that be the last time I ever saw Sebastian again. Not sure why theyd want a fa**ots kidney anyway. I walked past my sister who gave me a look, I gave her a look back who then in turn gave me a look that said \"I understand\" after leaving the hospital I felt as if a great weight had been taken off my shoulders, I went home and never looked back pleased with my decision.\n\nNow last week I get a call from my sister calling to inform me that Sebastian had died. She asked if I was okay and I said I was, that I didn't really feel anything in all honesty. She said she understood to a degree as Sebastian hadn't been all that kind to her over the years either. I had my husband and issac there to support me (honestly at this point issac may as well be our adopted child since his living with us til this whole situation with the world is over) the next day I was getting calls and text from family members I hadn't spoken too in years telling me that in going to hell for being a bad son, being a bad brother and for being a fa**ot and that me and my husband don't deserve children (hubby and I have been looking into adoption and surrogacy) \nThis makes me second guess my choice of not giving my brother my kidney, even in death his making things harder for me. I did wonder if I was a bad person and if I made the wrong decision but I knew that if I was in that position I would have been left for dead. Screw him.\n\nOther bits of information that may clear things up\n\n1. His renal failure was from living a hardcore lifestyle of drugs and alcohol\n\n2. My folks and sister did get themselves tested to see if they're matches and none of them were\n\n3. I disowned them of being my family years ago (apart from jane) so when I got married I took my husbands last name and hypen it with issacs last name to which his folks were very pleased about\n\n4. Some family (kai's folks and my dads brother) have actually called to see how I'm doing and say they don't judge me for what happened, others however have continued with said abuse whom I have now blocked\n\n5. If he had been a good brother throughout my life, I'd have done it without a second thought. I'd have done the same for jane, kai, issac and my husband. But I felt he didn't deserve it.\n\n6. It's unlikely I'll ever see my parents again and I'll make sure my children will never meet them. My revenge to them will be being a better parent then they ever were\n\ntldr: I didn't donate my kidney to my evil brother due to him being awful to me my whole life, having and affair with my gf and then outing me and convincing my family to disown me cause I'm bisexual",
        "score": 7120,
        "id": "ggb1w1",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/ggb1w1/i_didnt_give_my_twin_brother_my_kidney_because_he/",
        "created_utc": 1589009409.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "Karen Slapped and Pushed Me Because I Was Ignoring Her And Not Helping",
        "selftext": "I am a 18 yr old male, born completely deaf and mute. Also, I am partially blind in my left eye. I live with my sister(28 F) who had been taking care of me since our parents died. Recently she got married and went on her honeymoon. So I am on my own for a few weeks.\n\nThis happened yesterday. Usually, whenever I go out I am accompanied by my sister due to my disability. But now, since she is on her honeymoon, I had to go out alone. There was a new supermarket opened in our area, and I needed some items, so decided to go there and grab them.\n\nMy bad for wearing a red colored shirt almost similar to the employees working there. But if you look closely, you could see that it was not the uniform. I was at the electronics section looking for some batteries, when I see an old man struggling to get some DVD's at the top shelf. Since I am tall, I helped him. He thanked me(I can do lip reading) and went on his way.\n\nThen I began looking for the batteries. That's when I felt someone grab my left wrist. I turned around and a women (in her late 40's) slapped me. She was speaking something, but I couldn't follow her lips as she spoke too fast. However, I was able to catch some words like 'you', 'ignore', 'job', etc. So, I signed to her that I am deaf. Apparently, this was a wrong move because she became more irate towards the signs. Again she was yelling something but I couldn't catch anything. So I took my notebook and started writing that I am deaf and mute. Before I could finish, she grabbed my notebook and pen and threw them away. Then she slapped me again and pushed me to the ground.\n\nLuckily, by this time a store employee came to see what the commotion was about? He saw me on the ground and helped me up. Then he asked me what happened? Before I can sign to him, Karen starts to yell at the employee. I don't know that she said as she was not facing me. After she finished, I sign to employee that I cannot hear or speak. Fortunately, he understood and explained this to the lady. But she is still not convinced. She tries to assault me again, but I moved away. Then I wrote and showed the employee to call the cops on her. The employee nodded and called the cops. Karen tried to run away, but the security caught her.\n\nThe police arrived in about 10 minutes. They first talked to the employee who explained the situation, about how Karen assaulted me because she mistook me for a store employee. One police officer comes and speaks to me. I understood that he wanted my version of events, so I wrote everything down and showed it to the officer. Then they went to check the CCTV footage. Then came back and asked me if I wanted to press charges. I gladly said yes. Karen was then placed in handcuffs and given a free ride at the back of a police cruiser.\n\nThe manager then explained to me that Karen thought I worked there and she became angry that I ignored her. She had been standing on my left side, so obviously I couldn't see her. The store manager then offered me a 50% discount on the products. I texted my sister about the events that happened and she was livid. Oh, did I mention that my sister is a lawyer. She told me that she herself will be handling the case and would see to that Karen would get maximum time. Court date is in around 40 days. I will update about it after court.\n\nEdit: I noticed many were asking about masks, she was indeed wearing one, but during that encounter she had it on under her chin and not covering the nose or mouth. \nAlso, lawyers in india can represent their family in court as long as they are not directly involved in it and the judge is not a relative to the lawyer.",
        "score": 25926,
        "id": "jevhtt",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/jevhtt/karen_slapped_and_pushed_me_because_i_was/",
        "created_utc": 1603218551.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "AIO, about to go nuclear over a text my kid's coach sent her.",
        "selftext": "So my (m35) kid's (13f) coach (60+m) sends messages on a group chat with her and her mother.  I think it's weird and I expressed concern multiple times to my ex to no avail. Well yesterday he texted this on the group chat and I about lost my mind. Called him and screamed about how sick and inappropriate it was.  He tried to say it was a joke and he was trying to \"show her the color\" He's said creepy things in the past but this in the most bold he's gotten. I'm about to report him to the director of the club and make something happen to prevent this perv from being around a bunch of little girls. I just want to make sure I'm not overreacting cause I feel like I want to k*ll him for trying to take advantage of my kif\nkid.",
        "score": 84753,
        "id": "1hmpusf",
        "url": "https://i.redd.it/o82e7wyzh79e1.jpeg",
        "created_utc": 1735224725.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "Am I overreacting or should I report this children’s coach?",
        "selftext": "Received this text, there is some more where he explains he thought I was 13 year old boy, said he got my number from “my mom” and she wanted him (coach) to offer guidance, kinda like a mentor figure. While I could understand a single mother seeking good male role models for her son… if that were the case why did she give him a fake number? Also the first text gives me the fucking creeps? \nI easily found this dudes information, should I contact anyone about this (mother, school, authorities) or am I overreacting?",
        "score": 73425,
        "id": "1hfdnfy",
        "url": "https://i.redd.it/1429fw88u57e1.jpeg",
        "created_utc": 1734332927.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "I just got fired...",
        "selftext": "I never thought I would experience this in my life time.  I'm a hard worker, extremely dependable, and respectful. Not sure how I could lose a job like this.  Especially when I only just got it.  \n\n\nSo I work late and just about every night for the last few weeks at least, I stop by Walmart to get something for dinner.  I usually get off around midnight and stop by on my way home.  Every time I'm at Walmart, barely anyone is there except for the night crew.  Stocking up the store and doing their own thing.  Now from what I have noticed, they don't have much of a uniform.  Many of them are in hoodies or jackets of different colors.  Just to add some context.\n\nI showed up last night and I'm wearing a hoodie.  I begin to walk up and down the isles trying to figure out what I want for dinner.  I'm thinking pasta and walk past a few guys who are loading the shelves. All of a sudden, I start hearing this guy yelling.  This voice gets louder.  \"HEY!  HEYYYY! Are you listening?\"  I turn to look to see what is going on and this guy approaches me.  \"You're late again.  Don't think I haven't noticed you walking in the door after 12.\"\n\nI begin to laugh, thinking this guy is joking around.  Before I can even say anything he jumps on me.  \"You think this is funny?  Your job must not be important to you.  I want you to follow me to the office.\"\n\nNow I'm completely confused and start looking around like I'm on some hidden camera show.  He starts to walk off and I turn around and go back to shopping.\n\nHe comes back a minute later and starts to yell.  \"You want to be fired? Because if you don't come with me now, I will fire you!\"\n\nI start to laugh even harder, then ask him, \"What's my name?\"\n\nHe gives me this puzzled look, so I asked him again, \"What's my name?  Do you even know who I am?\"\n\nHe looks at the other guys in the isle, who have stopped stocking the shelves at this point to watch this event unfold. He then looks back at me, trying to figure out what exactly to say back to me before his head explodes.\n\n\"Good luck filing the paper work to fire me, when you don't even know my name!\"  I continue to laugh at this whole stupid charade. I pick up some ingredients for spaghetti, trying to give this guy a clue.\n\nHe storms off and I look at the other guys in the isle.  \"I'm sure he will figure out eventually, I don't work here.\"\n\nThey start laughing and I go on.  Can't believe I lost the job I just found out I had in the same night.",
        "score": 24960,
        "id": "dmcp0t",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/dmcp0t/i_just_got_fired/",
        "created_utc": 1571900441.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "Am I Overreacting? My bf (M37) is mad at me (F19) for existing 😞",
        "selftext": "I’ve been dating my bf for a year and he’s like really mature and I love him, even though all my family and friends tell me he’s bad news. But I don’t really talk to them anymore so it’s okay (my bf said they’re just trying to turn me against him).  DON’T tell me to break up with him  he’s literally the perfect man and we love each other so so much even though he treats me like actual scum. He just has, like, a dark sense of humour haha. I messed up today by breathing in the direction of a male coworker and my bf is now super mad at me (understandably). AIO???",
        "score": 73098,
        "id": "1hd6ezb",
        "url": "https://i.redd.it/s7i19t7u9k6e1.jpeg",
        "created_utc": 1734071827.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "You wanna hit a disabled person? Have fun with 30+ years in jail.",
        "selftext": "Obligatory \"found this subreddit because of the click\" real quick. This happened in January But the district attorney called me two days ago with the update. \n\nI'm a wheelchair user because of a fainting disorder (severe POTS for those wondering). I came home from work to see a car parked right under a \"No parking fire lane\" and on the sidewalk. It blocked the way into my apartment and I had to leave the wheelchair in my car. I started taking photos of the car because this had been an issue with the owner for months. My landlord had told me to get photos of it and email them to him every time she did it after I mentioned it in passing. \n\nWhile taking a photo, the owner came out of her apartment to scream at me. I stayed calm and tried to walk into my apartment. She got in my face to continue screaming and by reflex I shove her back. She then grabbed me by the throat and began to punch me. After a minute my neighbors and roommate, who were having a smoke, came running and got her off me. \n\nPolice were called, paramedics showed up because my neck was bleeding (she had acrylic nails), and I ended up going to the ER because I had a syncope episode while the paramedics were there. \n\nI decided to press charges, thinking I'd just get an aggravated assault or something. I made sure that they got her while she was home because I knew she had a gun on the wall despite being a convicted felon.\n\nWhen the police went to arrest her they found that the car was stolen, without insurance, she didn't have a license, there was used needles all over the apartment with her 8 year old child, AND the gun which was also marked stolen. \n\nChild is in foster care and she in in jail without bond. The DA said that her child recorded it (she apparently told her to) and it was already ruled as assault because of the overwhelming proof, plus the 7 counts of assault she's gotten in the past 5 years already. \n\nHad I gotten her nailed with it outside her home she would have only gotten probation since she was a parent, but now she lost her kid, her home, her car, and is going to be in jail for about 30 years or more, depending what the state charges her with for the drugs.",
        "score": 7095,
        "id": "1j2ckoa",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/1j2ckoa/you_wanna_hit_a_disabled_person_have_fun_with_30/",
        "created_utc": 1740983818.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "President of HOA wants me to join, ends up wanting to leave the country",
        "selftext": "*A lot of people have told me to cross post this here.  I'm going to feel like a REAL idiot if that means something other than copying and pasting the entire thing.  Oh well, I probably need a little deflating at this point.*\n\nSo this story is about a property I own, but rent out.  This may sound strange, but I don't think I could afford to live there these days - it's become somewhat exclusive.\n\nI've used dollars here, because it's what most people reading this will relate to.  This doesn't take place in the US, and I've given an approximate dollar value for local currency.\n\nThis is going to be VERY LONG.\n\n**BACKGROUND**\n\nA million years ago my property was part of a large farm.  I bought it about 30 years ago, long after the farm was broken up, but before there was any development near it.  The piece of land I got was near the back entrance that joined into a dirt road that ran past. The more expensive plots were near the tarred road in the front.\n\nI originally bought a large chunk of the land intending to do some farming, but that never happened. About 20 years ago some of the owners got organised (We'll call them the Organised Owners - OO) and had the area designated as a municipal suburb. The municipality agreed to put in tarred roads, water and electricity if a certain percentage of the properties were developed.  A construction company (linked to the OO) went around contacting the owners who had land but no buildings offering to build houses for us at a very (very) reasonable price - contingent on them getting a certain minimum amount of people signing up. While this was happening, one of the OO approached me and offered to buy half of my property.  I agreed, and the money I got for the sale (which was about 4 x what I'd paid for the entire chunk of land 10 years prior) combined with a small loan from the bank gave me what I needed to pay for a house to be built, and it was a fairly large and nice house too.\n\nI stayed in the house for a few years, and my mom moved in with me.  I had decided to subdivide the property again and build her a house next to mine, but unfortunately an un-diagnosed tumor took her before the house could even be started (well, it was diagnosed, but too late to do anything).\n\nSoon after she died, we moved out of the house and started renting it out.  About a few weeks before we moved out the OO I'd sold the land to started talking about starting an HOA.  I wasn't interested, and left soon after.  About two years later, the neighbour OO contacted me. There were two roads entering the area these days - the original tarred road that was near where the farmhouse had been and was entered from a fairly busy main road, and my \"dirt road back entrance\" which was now a tarred entrance from a wide but not very busy municipal road.  The HOA was trying to get the old farm road blocked off to inprove security and decrease through-traffic, and wanted the road next to my property to be the main (and only) entrance to the HOA community.  And they were pressuring me to join.\n\nI said no, and I was adamant, and eventually they accepted that, but told me they wanted to have a sign near the road welcoming people to the neighbourhood, and the only practical place to put it was on the edge of my property.  They also wanted to build a little guard hut and have a security guard permanently monitoring who went in and came out, and they wanted to build his shed on my property. We came to an agreement whereby they would mow the lawn and pay the equivalent of about $35 per month in exchange for the land they needed.  I was very happy with this arrangement, since the property was fairly large, and it didn't really cost them anything since they already had a full time gardening service servicing the HOA.\n\nThis all happened a over a decade ago. They eventually got the other main road blocked off, and the HOA is paying for rent-a-cop to be permanently stationed close to my property, as well as mowing my lawn and paying me enough money for takeaways for the family each month.  I'm occasionally contacted by members of the HOA to get me to sign up, but I'm really not interested.  My property has been rented to the same tenant for all these years and everything there is going well for me.\n\nUntil about 3 years ago, when someone scared the crap out of my tenants young daughter by making strange noises and shooting a gun close to her bedroom window three or four times over about a month.  This scared my tenant and I guessed it scared the HOA because they AND my tenant contacted me with a proposal - I join the HOA and they give me exclusions from the HOA rules, including exclusions from paying the monthly fees, and in addition they will build a wall around the ENTIRE HOA neighbourhood, including electric fencing and security cameras.  They told me they had wanted to do this for a while but were unwilling to build the wall on property that was not in the HOA.\n\nI couldn't see the downside, and so agreed.\n\n**THE DISHONEST DEALINGS**\n\nIt took a little over a year to build the wall and get everything completed, which is quite fast. And then a month to the day after everything was done, my tenant got an HOA warning about his dogs barking.  He told the HOA that while the property was in the HOA, it was exempt from the rules.  The HOA told him that they had cancelled the exemptions, and that he had 30 days to comply.  He contacted me, and I opened some mail I'd gotten from the HOA (I'd ignored it since I was supposed to be exempt from the rules and fees).\n\nMan, did I get a surprise.  They had retroactively cancelled the exemptions, and were claiming:\n\n1. That I pay late fees going back over a year\n2. That the easement agreement had been cancelled, and that they were retroactively canceling it a year back because the HOA contract allowed them to use \"small unused portions\" of HOA members land for the common good for free\n3. That I refund them the money they had paid for the easement over that period,\n4. That I owed them money for the garden service mowing the large lawn, and\n5. That I would be fined for each infraction my tenant failed to remedy.\n\nThis started an expensive process involving lawyers and the court system, that ended with a judge  telling me that what the HOA had done was mostly legal - they had the right to revoke the exemptions, but that they had to give me 30 days notice.\n\nAs I was walking to my car the neighbour OO (the one who bought half my land so many years ago) told me that I was stupid to have refused to join when the HOA started, as I could have been a founder member (whatever that means), and that next time I should be sure to understand the documents I sign before signing them.\n\n**THE MALICIOUS COMPLIANCE**\n\nNeighbour OO was right, I should have read the contract (better).  Also, I was interested in what it meant to be a \"Founding Member\" (spoiler: Nothing), and so when I got home I grabbed the HOA contract I'd signed, as well as all the other documentation they had provided me with, and started reading.  I was determined to break every rule I could find a loophole to break.\n\nI didn't get past the first page.\n\nWhile the street address of the property is used to identify it for all *practical* purposes, in the city records it has a unique property number that has to be used on *legal* records.  When my mom moved in, I'd subdivided the remaining property but hadn't yet started building on it.  And when I gave the HOA the easement all those years ago it had been on the property I'd sliced off for my mom.  And when the HOA set up the contract, they had simply used the property number from the easement.\n\nThe next afternoon the neighbour OO delivered (and had me sign for) two documents - one telling me that my exemptions would expire in a 30 days, and one letting me know that the easement would no longer be required after 30 days.  I think he was being a bit malicious here, because I lived about an hour away from the property, and he drove out himself.\n\n**THE REVENGE**\n\nEXACTLY 30 days TO THE HOUR after the HOA had given me the 30 days notice, I knocked on the neighbour OO's door (did I mention he was the president of the HOA?) and had him sign for two documents.  The first was that I planned to build a house on my HOA property (which confused him) and the second was notice that they had 30 days to remove from the property the guard shed, the parts of the electric boom that were on my property, as well as the sign.  He tried to engage me but I ignored him, climbed into my car and drove off.\n\nEarly the next morning I got a call from the HOA lawyer who explained to me that their junk would be staying on my property since it was in an \"unused\" part of my land.  I explained that I was building a house there, and that the land would not be unused anymore.  I could hear the smirk as he told me that building a second house to be spiteful would not be accepted by the courts. I sure hope he could hear the smirk in my voice when I told him that the property in question did not have a house, and was, in fact, barely large enough for a house to be built and would not be large enough for any extraneous buildings.  I then told him to go look up the property in question and call me back. (I had sliced off just enough to be legal, which was just enough to build a small house).\n\nIt took them just under 5 days to get back to me. Their lawyer told me that the terms of the easement meant that I could not cancel without their permission, so I emailed him a photo of the document they sent to me cancelling the easement. That afternoon Neighbour OO invited me to lunch (his treat) to discuss the problem.  I said \"No thanks\".  He extended the offer again two days later, and again I said \"No thanks\".  Others of the original OO contacted me to try to talk.  Some sounded aggressive, some sounded sympathetic.  I said \"No thanks\" to each of them.\n\nEventually the lawyer phoned and asked if we could come to some sort of arrangement.  I asked what he had in mind, and he told me that he was prepared to discuss exclusions in exchange for access to my property.  So I said \"No thanks, and please don't call me again\".\n\nAbout 9 days before their 30 days was up I got a call from a different lawyer.  He said he wanted to \"negotiate a surrender\" (his words, not mine).  I agreed to meet him at his office the next day.  I'd already had documents drawn up, and the meeting was as simple as me giving him the documents and him reading them over.  My new easement offer:\n\n1. Included everything offered by the old easement offer,\n2. I changed the line \"mow the lawn\" to \"get the property to HOA standards and keep it there\" since it was now in the HOA.\n3. Would cost them about $500 per month instead of \\~$35,\n   1. This amount would increased with inflation (the previous contract didn't include that bit).\n4. When cancelled, for whatever reason, the HOA would have to pay me a cancellation fee of around $7500.\n5. The contract automatically terminated 30 days after\n   1. any disciplinary action was taken against the me, my tenant, or the property (\"the property\"),\n   2. any complaints were levied by the HOA against the property,\n   3. any legal action was taken against the property by anyone in the HOA,\n6. That \\[lawyer who had offerred to negotiate surrender\\] would be allowed to mediate any disputes between us, at HOAs expense, and that\n7. The HOA would pay all my legal fees if any legal action was taken against me.\n\nI'd deliberately left some insane things in there so that I could appear to \"concede\" some points or be negotiated down when the HOA got indignant about the points I actually cared about.\n\nThe lawyer didn't look happy. He said that my proposal sounded unfair, but that he'd have the HOA president look at them.  I reminded him that in 8 days I'd be setting a group of men armed with sledgehammers and anger management issues lose on whatever of theirs was still on my property.\n\nThat evening I got an irate call from the HOA president.  He told me he was never going to sign the new contract.  I said \"OK\".  He then told me I was charging too much per month, and that it should be at the same rate as the previous contract. I pointed out that when I signed the previous contract the area was under development, and there was at least one other road leading in and out, but that now there was only mine.  And besides, mine was now developed with everything they needed.  He told me that I was forcing them to sign a document they didn't want to sign.  I told him that he was free to not sign it. He whined about everything he could think of.  And then eventually told me I'd be hearing from his lawyer.\n\nThe next morning Surrender Lawyer called to ask if I'd be willing to come to their offices to sign the contract.  I agreed. When I got there that afternoon I learned that Surrender Lawyer was not a lawyer, but a Paralegal.  He handed me the contract and asked me to sign it.  He laughed when I told him I'd have to read through it first to make sure nothing was changed, and mumbled something that sounded like \"I'm sure you would\".\n\nI read the contract.  Nothing had been changed. NOT A SINGLE THING. And the HOA president had signed it, with the Surrender Paralegal signing as witness.  I looked at him and said \"Why did he sign this?  It was stupid to sign it!\" and the paralegal looked at me and said \"I started telling him that signing it would be a bad decision, but he told me I wasn't being paid to think or give legal advice, and to shut up.  So I shut up.\"  I said \"Do you understand what he's signed here?\" He looks at me and nods.  He said \"I asked him if I should have one of the lawyers look at it before giving it to you, and he told me that we had already billed enough for this, and that he'd sign it and sue me after their easement was safe.\n\nThis happened about a year and a half ago.  It took 6 months for the HOA to find out how screwed they were.  They wanted to sue me, but their lawyers explained to them that there was no way to win. Even if the court sided with them, all they would get is the easement contract voided, and they did not think that the court would side with them.  The lawyers were adamant about one thing - the HOA could not live with the \"HOA pays my legal fees if legal action was taken against me\" since it didn't limit the people taking legal action against me to the HOA - as worded, the HOA would be fordced to pay for my legal fees if ANYONE took legal action against me.  They argued that the courts would probably not enforce that, since the context of the agreement was to do with the HOA, and I told them I was prepared to find out since the HOA would definitely be the ones taking action against me if they challenged it.  I eventually signed an addendum to the contract that said that the neighbour OO (HOA President) would personally pay all my legal fees *unless he held no position at all in the HOA*, and that the HOA would pay all legal fees if the HOA took legal action against me.  He resigned from the HOA at the end of that meeting. I politely told him in front of everyone that he should not sign documents unless he understands what he's signing.  He didn't look pleased.\n\nIt came out during the mediation (you cannot imagine how happy the lawyers were that their paralegal was mediating) that without the ability to control access to the HOA neighborhood through the security boom (partially) on my property (the HOA had become a \"gated community\" a number of years back) the HOA would be in breach of their own articles and would be dissolved. I also learned (should have been obvious to me) that all the security cameras were wired, and all terminate in the guardhouse / guard shed.  So basically, it was my way or the end of the HOA.\n\nThat first mediation was really quite funny. My paralegal looked more than a little glum as we assembled and he called everyone to order.  I suspected that he had been told to work against me, so I took the initiative.  I reminded everyone there that I had agreed to let Paralegal mediate, but that I had agreed to no arbitration at all.  If I didn't feel like the proceedings were fair I'd leave and they could go ahead and sue. Paralegal brightened up and things actually went quite well.\n\nI'm writing this after getting home from the latest mediation.  I built a \"paddling pool\" for the neighborhood dogs.  As in I made it myself.  I dug a hole, packed it with stone, and added a concrete finish.  It was my first attempt, and if I say so myself, it looked ... well, terrible. The HOA called for a mediation meeting (what they do now instead of taking official action.  I've declined their mediation requests in the past) in which they told me, as nicely as they could, that the paddling pool was an eyesore right at he entrance of the HOA.  I asked them to create a list of what needed to be fixed and how it needed to be fixed to give to me at the next meeting.  The list was extensive.  It basically required the pool to be rebuilt from scratch,  I asked them if there was any way to reduce costs on the work they needed to get it up to HOA standards, and they assured me there was not.  I thanked them, pulled out a copy of the agreement where they had agreed to \"get the property to HOA standards\" (which I'd highlighted) and handed it to them with the list.  I told them the HOA usually preferred if these things were dealt with within 30 days.  They started arguing until the mediator reminded them that they could not force me to comply without causing the easement to end.  I should mention that their lawyers usually no longer attend these things. They said they would get it done.\n\nI also learned a lot about neighbour OO today:\n\n1. I found out that Neighbour OO sold his property about 3 months back, and is apparently leaving the country for Australia.\n2. I found out that the HOA had successfully sued him for a crapload of money they had lost to his mismanagement as part of his vendetta against me.\n3. I also learned that he had a vendetta against me. I have no idea what I did to upset him.\n\nI'm not sure if I will screw with the HOA any more.  I already think I'm so close to breaking them the only thing stopping them from canceling the contract is the massive financial loss if they do.  I guess a lot depends on how they treat me and my tenants going forward.\n\nAlso, I do like the monthly payments, though, so I'm motivated to play nice.\n\n***NOTE:*** *I never intended to go all nuclear revenge.  My plan was for a little petty revenge.  It's the stupidity and greed and bully mentality of the Neighbour OO that turned this into nuclear revenge.  I can only take minimal credit. (Although I did take it and run with it when I got the opportunity, so that's something, I guess).*\n\n**TL;DR**\n\nHOA President gets me to join the HOA under false pretenses that get upheld in court, then finds out that that he signed up (literally) the wrong property and has to resign after getting the HOA into an incredibly expensive situation that it cannot get out of.\n\n**Thank You Every One**\nWhen I posted this on MaliciousCompliance it was because I felt like I could fly and wanted to share. Now the adrenaline is gone and I feel like I've been kicked by a donkey. I thought some people would like the story, but also thought it was too long for most.  It seems I may have been very wrong.  There are so many people commenting and sending messages that I cannot keep up. Thank you all so very much!",
        "score": 6701,
        "id": "q452ux",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/q452ux/president_of_hoa_wants_me_to_join_ends_up_wanting/",
        "created_utc": 1633721763.0
    },
    {
        "subreddit": "AmIOverreacting",
        "title": "Am I overreacting after I found out my boyfriend’s online “friend group” I became part of 2 years ago has been JUST him the whole time?",
        "selftext": "I guess I should’ve been less oblivious, but since a little before we started dating in 2022 I was added to my boyfriend’s (just friend at the time) three person instagram group chat with what he explained were some of his closest online friends. The two other accounts seemed like real people because they had real followers and comments on their posts, and drastically different aesthetics/looks to them.  \n\nWe eventually made a discord server for us and that alone was convincing enough since multiple times we’d all be active at the same time. We never voice  chatted but I used to never voice chat either, so I didn’t think twice. The group got closer though as more and more time passed since I was first added to their group chat, and last month we got together and planned a research TRIP TO HAWAII for August (we live on the East coast of the US). Like we booked everything! \n\nSo imagine my surprise when I’m over at his house tonight and his computer is open and I just want to log into my google docs when I accidentally stumble across first of all, follower bot sites, and also him logged in and chatting with me as one of the individuals I thought I had become close with, and just got this sinking feeling. I didn’t jump to the idea that they could be fake either, I was like, maybe he just has their logins since they’re all so close and is way too interested in their messages, but then I noticed their only chats were the group chats and the server, and the real kicker was the email address it was signed up under was his backup email with his full name. I quite literally snooped until he got out of the shower and caught me, which I’m not saying was right of me but I couldn’t help myself. During my snooping I gradually became devastatingly confident that he wasn’t behind just one but both accounts.\n\nI’ve never seen his face so red and he just absolutely panicked and started shouting at me to get out of his business. I couldn’t even form the right words to say to him, in the end I just walked out of his apartment sobbing.\n\nIt’s very early in the morning, I get that, but this screenshot is what he has to say and I’m starting to feel crazy. Am I overreacting about my discovery?",
        "score": 72973,
        "id": "1hpi0kl",
        "url": "https://i.redd.it/fknukd9ovx9e1.jpeg",
        "created_utc": 1735544102.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Ex's divorce lawyer: Send 3 years of complete financials or else. Me: As you wish.",
        "selftext": "TLDR at the end.\n\nThis happened several years ago when my ex and I were going through a heated divorce/custody battle. While we were married, we had a couple of conversations about how rich people hide their assets to avoid paying taxes. I've never had enough assets to do this, but she somehow got the idea that I was and told her attorney that I was laundering money and hiding income. It was more likely the heat of the moment as divorce/custody battles often come down to. I couldn't even afford my own attorney so I represented myself.\n\nHer lawyer wasn't a total ass, but he clearly was out to get me, and he talked down to me like I didn't deserve to breathe the same air. One day, I get a letter in the mail from him requesting an updated income declarations form and 3 years of financials. It had a long ass list of things to include.\n\nI own a communications tech company that was in super startup phase back then. Money was already tight. I was trying to get this business off the ground with no financing, I was finishing my MBA with scholarships and loans, so paying for copies and postage or driving this 30 miles to his office meant eating peanut butter and saltines for a week. So I called him to explain my situation. He all but called me a liar and didn't believe I couldn't afford it.\n\nI was put off by that, and I said this was taking time away from business I needed to handle. To which he replied (and I'll never forget this), \"Well, according to your income declarations, you're not that busy. What do you do all day?\" He then said if he didn't get these documents, he would consider my previous filings as fraudulent tell the judge, contact the DA, and also alert the state tax agency and IRS. Probably an empty threat, but I'm no lawyer.\n\nEfax is one of the services my company provides, and at this time it was relatively unknown. So I asked him if he has a fax machine. He said he had a fax/scanner/copier device, then said what law office doesn't have a fax machine? And I suddenly got an idea. Okay, I said to him, I'll put together and fax whatever I can.\n\nOkay, motherfucker. You want 3 years of financials? You got it.\n\nI scanned-to-PDF every receipt I could find. McDonald's receipt from 5 years ago? Fuck it, won't hurt to include it. CVS receipt? It's 3 miles long, perfect. They get the $1 off toothpaste coupons too. \n\nI downloaded every bank statement, credit card statement, purchase orders from vendors, and every invoice I sent to clients. I printed to PDF the entire 3 year accounting journal, monthly/quarterly/annual balance sheets, cash flow statements, P & L's. Not only did I PDF 3 years of tax filings, but every single letter I received from the IRS and state tax agency, including the inserts advising me of my rights. It took awhile, but I was a few days ahead of the deadline!\n\nI made a cover page black background with white lettering. Wherever I could, I included separator pages in all caps in the biggest, boldest font that would fit on the page in landscape: 20XX RECEIPTS, 20XX TAXES, etc. I merged everything into a single 150+ page compressed PDF and sent the document using my Efax system. Every hour or so, I received a status email saying the fax failed. Huh, that's weird. Well, they're getting this document. So I changed the system configuration to unlimited retries after failures to keep redialing until it went through. Weird, I was still getting status email failures. I'll delete the failure emails and keep the success one after it eventually goes through, I thought. Problem solved.\n\nTwo days later, a lady from his office called and asked me to stop sending the fax. Their fax/scanner/printer/copier had been printing non-stop. It kept getting paper jams, kept running out of ink and they had to keep shutting it off and back on to print.\n\nI explained that her boss told me to send this by the deadline or else he would call the DA and IRS. Since I didn't want a call from the DA or the IRS, I would keep sending until I get a success confirmation. I suggested they just not print until my fax completes, but she didn't like that.\n\nShe asked me to email the documents, and I told a little white lie that my email wouldn't allow an attachment that big. Unless her boss in writing agreed to cancel the request or agree to reimburse me for my costs to print and ship, I said I would continue to fax until they confirm they have received every page. \n\nShe put me on hold, and the attorney gets on the line. He said forget sending the financials. I said that I would need this in writing, so I will keep sending the fax until he sent that to me. He asked me to stop faxing and he would send it in writing, and I said send it in writing first and then I'll stop.\n\nLong moment of silence... *click*.\n\nAbout 20 minutes later, I received an email from his assistant with an attached, signed letter in PDF that I no longer needed to provide financials. The letter then threatened to pursue sanctions in court or sue me for interfering with their business. Every time I saw him after that, the lawyer never brought up sanctions, lawsuits, criminal referrals, or financials again.\n\nTLDR; ex accuses me of hiding income and money laundering, her divorce lawyer demands 3 years of financials, I spam fax them with my company's Efax service.\n\nEdit: All these awards and the Reddit front page? Y'all are too too kind. Thank you!",
        "score": 60944,
        "id": "pcamtd",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pcamtd/exs_divorce_lawyer_send_3_years_of_complete/",
        "created_utc": 1630018483.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Either be fired or accept a massive pay cut. Ok, I'll take the firing.",
        "selftext": "I worked for Company for 14 years. I loved working there for 12 of those years. There were 2 main parts to the job. The first part was the \"sales\" side of things. This was away from the office, in the customer's location. This involved quite a bit of driving (and on a couple of occasions flying abroad) to work face to face with the customers to deliver a high quality product. We weren't the cheapest, but we were the superior product. And I was the best employee when it came to delivering the product. I consistently got rave reviews from customers for my personal style when it came to delivering the product and executing the customer's vision. I got a huge amount of repeat business and I got a lot of new business through word of mouth with customers recommending the company based on their experiences with me.\n\nThe second part was the office side. This was my weaker side. I hated cold calling \"potential customers\" with numbers I found in the phone book. When it came to answering the phone and speaking to potential customers who initiated contact with us I was fine! But I wasn't great at making the calls. This was my only real not-great part of my job. \n\nSo, in the office I wasn't asked to make any calls. Instead I prepared product. Designed new product. Trained new staff members (ended up being one of the biggest parts of my job). I was also the problem solver, helping out whenever and wherever. Filling in for sick employees whenever I could. \n\nI liked the owner and I liked the manager. I liked all the staff who were around me. All in all it was a great job that I was really good at and took pride in.\n\nThe company had been doing so well that the owner had slowly expanded over the 12 years since I started working for Company. I had joined about 3 months after he started, so I'd been a part of this expansion. I worked out of my nearest office, but often travelled to other areas to train their staff. I was \"loaned out\" as it were to other companies to help train their staff. At one point I was a guest lecturer at a University teaching medical students how to deliver complicated explanations to people who don't have the base knowledge that you yourself do. \n\nAfter 12 years I was on a decent salary. Not massive, but I was happy. Then the owner decided to sell off part of the company. He was selling the area where my local office was. He told me he would love for me to remain as his employee, but I would need to work from a different office. This was either require me to move, or to quadruple (at a minimum) my daily commute. The other option was to remain working from my current office but with a new boss. I chose the second option.\n\nBefore the new owner bought the company she worked alongside the staff for a couple of weeks to see how we operated. This was before any of us knew she was about to buy the company. As far as we knew she was just another employee, and she was shadowing us to learn. She came with me on assignments in the field and saw my abilities. \n\nWhen the sale was announced and we were informed that she was the new owner, everyone was very surprised. She made some sweeping staffing changes. The manager left to start her own business, since the new owner was also going to be the manager. A lot of staff were let go. The secretary, myself and a couple of newer hires were kept on. The new hires were on the lowest wages (not salaries). Anyone who had got to a decent level was let go. Since almost everyone was on a zero hours contract, she was able to do this. \n\nWhilst technically it was a \"new company\" for the customers it was the same old business. The company still had the same trading name. The only real difference was that there was a new owner and the registered business name was now different. As far as the customers were concerned nothing had changed.\n\nMy job for the first few months after the sale was to train up the remaining staff to replace the more experienced staff members who had been let go. I recommended a couple of new hires who I had experience working with in the past. I was open and honest with the owner, and let her know that one of them was a close friend and one of them was my girlfriend. Both were more than qualified for the work and both were happy to join. My friend had recently come back to the country after a year of travelling, whilst my girlfriend could only work during school holidays (worked in a school). The owner gave them both interviews then hired them, since we needed the staff.\n\nOver the next 2 years business started to fall. The reason was simple: The new owner decided to try and maximise profits by increasing prices whilst decreasing the quality of the product. For new customers this wasn't noticeable. They just thought we were expensive and the product wasn't the best. But for old customers who had been with us for 10+ years, they immediately noticed. They were being charged more and were receiving less/worse quality. So the owner doubled down and increased prices again. 95% of our old customers left us. New customers almost never became repeat customers. Complaints sky rocketed. \n\nWhilst all this was going on our staff turnover rate was ridiculous. People left after a few months when they realised that the minimum wage they were being paid wasn't worth it. Under the old owner the average hourly wage for new employees was around 2.5x the minimum wage. This made people care about their jobs and want to keep them. My girlfriend quit. My friend remained, but was looking for something new.\n\nThen I got a phone call. The owner needed me to come to the office. This was unexpected. I had just finished working on location with a customer. My next customer was in 2 and a half hours. It was a half hour drive away. The office was about an hour and 10 minutes away from both locations. If I drove back to the office I would have about 5 minutes in the office before leaving. My mileage was paid above my regular salary, so I was saving the company money by doing this. Also, parking was a nightmare around the second location, so I intended to get there as early as possible to find parking, then read a book. The manager didn't care. She *needed* me to return to the office. So I did. I arrived back to be handed a letter by the owner. It was informing me of a disciplinary meeting to take place in a couple of days time. I could bring a \"witness\" along if I so desired.\n\nThis knocked me for 6. I was the best employee. I read through her list of complaints about my performance and started working on my defence.\n\nAt the meeting I declined to have a witness. Instead I decided to record the audio of the entire meeting on my phone without informing her. Where I live this is legal and I didn't need consent. The boss' witness was her friend who she had met at Yoga and hired for an office role, firing the secretary who had been there long before the takeover.\n\nEvery point she raised I could counter. They ranged from the weak: \n\n\"You were unavailable to work for a week in August\" \n\n\"I booked a week's holiday so I could attend my cousin's wedding on the other side of the country and turn it into a holiday.\"\n\nTo the pathetic: \n\n\"You were late for work on the 12th of May.\"\n\n\"Is that the day my car broke down and I called the office to let you know?\"\n\n\"I don't know.\"\n\n\"I do. Here's the receipt from the garage dated May 12th.\"\n\nTo the downright lies. This one I can't write as a quote. Basically, she accused me of gross misconduct for breaking health and safety laws in the way I was delivering a product for a customer. I hadn't broken health and safety laws. I knew exactly what I was doing since, as I've mentioned already, I had been doing this for 14 years at this point. She had witnessed me do this on multiple occasions and had never mentioned it before. Because it wasn't an issue. She even had me train staff in this specific delivery method. Because it wasn't an issue.\n\nShe finished her list by telling me that she doesn't want to lose me, but she can't justify keeping such a poor employee at my current salary. I had 2 choices: I could either sign a zero hours contract and work for minimum wage, or she could fire me with 2 weeks notice.\n\nI countered that she would have to give me 12 weeks notice, since my contract guaranteed me 1 week's notice for every year of employment, up to a maximum of 12. She argued that I had only been her employee for 2 years, since before then I worked for the previous owner. I informed her that with how the business takeover had run, it counts as continuous employment. I quoted the exact law and code that backed me up. She asked for a 30 minute break in the meeting to \"let me think about her offer\". She went to call her lawyer.\n\nWhen she came back she informed me that since she was firing me for gross misconduct, she didn't have to give me any notice at all. If I wanted to remain and move to the zero hours contract, I could do that today. But if I didn't then she would have to fire me. But because she was nice she would give me the 2 weeks notice. I asked for a couple of hours to go home and think about this. She allowed this.\n\nI knew the reason she wanted me to remain for at least the 2 weeks was because one of our few remaining bigger customers were set to have a product delivery from me in that time. They would only work with me. The owner had tried sending other staff in my place an several occasions, and each time there had been problems. It wasn't the staff's fault. It was just a very difficult delivery for a very specific customer which needed to be perfect. As a result this customer would only deal with me.\n\nI called the office and spoke to the owner. I declined the offer of a zero hours contract and said I would be leaving. She then said she was giving me my 2 weeks notice. I declined her offer of 2 weeks notice. I informed her that if I was being fired for gross misconduct then surely I cannot be relied upon to safely deliver the product. Therefore it would be best for everyone involved if I didn't return to work. She panicked and said that she needed me for those 2 weeks. I feigned ignorance and let her know that I was just thinking about what's best for the company. After all, you can't have unsafe staff delivering your product to your customers. However, if she wanted to rethink the \"gross misconduct\" accusation then I would work my 12 weeks notice. They were her options. 0 weeks or 12. She chose 12.\n\nFor those 12 weeks I worked the same way I had for 14 years. I didn't coast. I didn't slack. I didn't badmouth the company on my way out. I continued to train new staff. I continued to deliver the product in my own, personal, exceptional way. I also got in touch with an lawyer who was a specialist in employment law.\n\nFor those 12 weeks the Owner barely spoke to me. She resented the fact that I knew my legal rights and didn't just believe her lies. She hated the fact that I could defend myself. She was petty. She accidentally dropped my mug in the kitchen, breaking it. Most petty of all, she paid for every member of staff in the office to have a spa day... except me. I was asked to work my day off to answer the phones whilst everyone else was being pampered. Nobody knew I hadn't been invited until they arrived at the spa and I wasn't there. Here's the thing; I'm a big fat bearded guy. I have no interest in a spa day. If she had offered it to me I would have thanked her and declined the kind offer. But by pointedly excluding me she was making herself look terrible. For the last 2 weeks I was training up my friend to basically take over from me. \n\nAt the end of the 12 weeks my final day came around. The owner had nothing planned. Not so much as a card after 14 years (2 for her). The office assistant manager who had become a friend had got me some presents, but had to give them to me once the boss was gone, for fear of reprisals. \n\nThe day after my final day 2 things happened. The first was my friend who I had been training up to replace me quit. He was on a zero hours contract so required no notice. He was unhappy with her treatment of me, and was unhappy that she expected him to do my (previously salaried) job for minimum wage. He hadn't informed me of his plans to leave, and I only learned of it when he knocked on my door in the middle of the day when he should have been at work to let me know.\n\nThe second was the owner received a letter informing her that I was bringing legal proceedings against her for ~~constructive dismissal~~ unfair dismissal. I had arranged this with my lawyer to be delivered the day after my final day. According to the office assistant, she went pale and started crying, before leaving the office to call her lawyer.\n\nShe refuted my claims for ~~constructive~~ unfair dismissal. Said it was gross misconduct. Tried to come up with some more reasons for firing me. But the truth was that the company was making less money because of her business practices, and I was the highest (and only) salary. I had evidence that I was a great employee. I had evidence that she asked me to move to a zero hours contract. She initially tried to deny this, since the \"gross misconduct\" fabrication makes no sense if she wanted me to stay. But once my lawyer provided hers with a transcript of the entire meeting along with a copy of the recording, she knew she was fucked. Still, she let the case drag on for over a year. I think she hoped that the legal fees would lead to me dropping the case. Little did she know my lawyer was working on a no-win no-fee basis, whilst hers wasn't. She ended up settling out of court.\n\nThe aftermath: \n\nThe office assistant who had become a friend quit a couple of months after I left. She hated how I was treated and didn't feel feel safe working for such an untrustworthy boss. \n\nSeveral former customers contacted me personally to enquire why I was no longer with the company. Apparently the owner was telling them that I just quit. I informed them that I had been fired for cost cutting reasons. They moved their business elsewhere. Several offered me jobs. One went so far as to offer me a part time job and to pay for me to attend college to earn a degree required for them to hire me full time. This was a lovely offer, but they were one of the customers who were a bit too far away to commute, and I wasn't ready to move. In the end I found a new job in a different industry where a lot of my skills transferred over. Currently earning more than I was, working less hours and for better owners.\n\nThe business is floundering. COVID left the new owner desperate for cash. She cancelled orders but refused to refund customers money, citing an \"act of god\" clause in the contracts. The business' Facebook and Google reviews have tanked. Most staff left. The business is still afloat, but barely.\n\nTLDR - Owner fired me as a cost cutting measure. I sued and they ended up settling out of court, whilst the person they planned to replace me with quit.",
        "score": 59328,
        "id": "nj7gtf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nj7gtf/either_be_fired_or_accept_a_massive_pay_cut_ok/",
        "created_utc": 1621775463.0
    },
    {
        "subreddit": "IDontWorkHereLady",
        "title": "How an entitled principle abducted my niece since he thought she was skipping class",
        "selftext": "EDIT : a discussion in the comments brought up the idea of epic tales of people getting fired. I keep reading really hilarious stories on this subject in many different subs, like the revenge subs, malicious compliance etc.etc.etc.  so why not give them their very own sub ? /r/youdontworkhereanymorelady was too long, so I decided on /r/youarefired/    \n\nPlease help it row by spreading the word, posting storiesm, make comments etc. and if people wanna help mod it, tell me in  a few days when this viral story has died down, or it will drown in all the comments I get on this post.\n\n\n\n\nFirst a little explanation, here in Germany we have Bundesländer (kinda like the states in the us, but way less independant). Since the school system is up to the BL they often started their summer vacations at different times (the biggest reason being chaos in the highway system if everybody would want to drive to summer vacation on the same day). Also this is not  a recent story but quite  a few years ago.\n\nMy niece is from bavaria, i am from baden wuerttemgberg. Her summer vacation started a whole week earlier the ours, and she came for a visit with my brother and her siblings. It was like in the morning and we decided to take doggo for walk and go to the bakery on the other side of the street of a big school complex. I went in, she stayed outside with doggo, Í came back out and she was gone. Let us introduce our protagonists.\n\nPP :principle pissant\n\nMe : take a guess\n\nN : niece.\n\nI decided to call her on the cellphone, and this was the talk.\n\nN : thank god you are calling.....\n\nPP (Screaming in the background) : how dare you take a phonecall while I am talking to you, you are in enough trouble for skipping class....\n\nAs I later found out he ripped the phone out of her hand, and must have hung up. I realized what must have happened, and went into the school to clear up this misunderstanding, and go right away to the principles office hoping she would either be there or soon be brought by  a teacher.\n\nOutside I already hear him screaming at her\n\nPP : stop giving me a fake name and stop lying, you won´t get out of here until i have the truth, and I promise you this will be mentioned in your school certificate (we have grades for general behaviour here, and teachers can also write a comment in there. It is something employers care about if you look for an apprenticeship for example).\n\nI did not bother knocking and went right in.\n\nPP : who are you and how dare you just come in here without knocking\n\nMe : I am this girls uncle, what the hell do you think you are doing here ? She does not go to your school !!!\n\nPP : Ah I guess you where the one on the phone, nice try, but you will not help her trick her way out of this. I will get to the bottom of this, and I will only release her to her parents. Now get out of my office or I will call the police and have you arrested for trespassing in a school (school are protected places, so you get in way more trouble here for trespassing then usual)\n\nMe : I will stay right here to protect my niece from your crazy ass, and calling the cops sounds like a really good idea, after all you have abducted my niece.\n\n So I did the call and just told the police that my niece got abducted and to come to the principles office asap.\n\nPP : do you really expect me to believe your fake phonecall ?\n her un till the police is here\nThe  he started to shout at my niece again ,who was in tears by now.\n\nME : STOP FUCKING SHOUTING AT MY NIECE, you will not address her till the police is here, or I WILL shut you up.\n\nPP :that is it, i am calling the police now, to have you arrested and finally find out her real name.\n\nSo he called the police, only to find out I actually did call the police. Suddenly he was not so sure anymore, and you could tell the cogs in his head where finally start to turn.\n\nAbout 5 minutes later the police finally arrived, and they asked us separately. Here is roughly what my niece told the cops.\n\nShe was waiting outside the bakery, when PP came unto her like  ab at from hell. He screamed at her that he is really fed up with people skipping school the last week before vacation starts, and will make an example pout of her. Before she could get a word in edgewise, he grabbed her by the arm really hard (hard enough she got a bad bruise for over a week), and that is what started to get him into real trouble. The cops also took her data, and confirmed she is from Bavaria. They then asked us if we want to press charges and I just said throw the book at him. PP heard the police sayíng press charges and suddenly realized he was in real deep shit, so he came over.\n\nPP : hey this is just a misunderstanding, you have to understand I have to be strict with people skipping school.\n\nMe : if by being strict you mean assaulting a  12 year old´so badly she has a handprint from you on her arm that will create a huge ruise, abducting her from my care, and wrongfully imprison her in your office while screaming at her and scaring the beejezus out of her, then no I DO NOT HAVE TO UNDERSTAND THAT !!!\n \nPP : please you are completely blowing this out of proportion, I could get suspended without pay over this,and even lose my job. \n\nMe : GOOD, anyody who treats a scared 12 year old girl like that should never again get to work with kids.\n\n\nIn the end he really did lose his job, and I am very glad he did. During the investigation it turned out he was a sorry excuse for a teacher, who belittled kids, who always took the teachers side no mater how wrong they where and even had slapped kids on several occasions. He went to court for assault and attempted abducting plus wrongful imprisonment, plus a few more bodily harms against students. He lost job and pension, got 2 years on probation and 500 hours community service with the stipulation it could be nothing that involved kids. He was also forbidden to ever work with kids again.",
        "score": 23441,
        "id": "cuebmm",
        "url": "https://www.reddit.com/r/IDontWorkHereLady/comments/cuebmm/how_an_entitled_principle_abducted_my_niece_since/",
        "created_utc": 1566568986.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Mil lied about my baby gender, now have to see my baby in the clothes they brought",
        "selftext": "English is not my first language and I am in mobile, so please be patient with me. They told me in r/amitheasshole you guys would like this\n\nNovember last year I(30f) gave birth to our first baby. It's the first in my family and the 6th in my husband family(32m). It's important to say that all the six kids are boys and MIL is in some sick baby girl rabies.\n\nEver since we made the announcement MIL convinced herself that I was pregnant with a girl. I told her that once we knew the gender she would be the first one to know. We told her it was a boy, she still was convinced it was a girl. She told they whole side of the family it was a girl. I corrected but she told them I was just annoyed bc I wanted a boy first (I wanted a healthy baby, I didn't have a damn about the sex). She also told them we are naming the girl after her mom, which we will never do bc hubby hates his Grandma. \n\nWhen the baby shower gifts started to come I noticed a lot of things that wasn't in the register. Embroidered things with grandma's name. And it didn't matter we told them the gender and the name, and make clear we are not lying about the gender. Everyone believed her \n\nWell, the baby was born. And imagine the surprise... It was a boy, just LIKE WE HAVE BEEN TELLING EVERYONE. The problem (for them) was that now the baby have plenty of \"girly\" clothes, pink onesies etc, and we are dressing our baby with them. Specially for his family video calls and for pictures for them. \n\nAfter Saturday call, MIL called us to scream to us bc we are making the elders uncomfortable for not sticking to a masculine color scheme for the baby clothes. And we have to stop being this childish, she just through my belly shape was more like girl them for a boy. \n\nWe told her we will not change the baby's clothes, and to just await until the dresses fit. He will look adorable.",
        "score": 58912,
        "id": "o0tvn8",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o0tvn8/mil_lied_about_my_baby_gender_now_have_to_see_my/",
        "created_utc": 1623807985.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "[NUCLEAR - FELINE - REVENGE] CRAZY, ENTITLED NEIGHBOR TRIES TO BLEACH MY SISTERS CAT......CAT GETS REVENGE.....",
        "selftext": "I count this as a nuclear revenge story...... but not in the traditional sense.\n\nThis happened many years ago.\n\n My older Sister had this awful, bitchy neighbor who had a serious hard on for Sis's Seal Point Saimese cat - I'll call neighbor CN (for crazy neighbor), sister is Sis, me.....is self explanatory. \n\nCN was a black haired, plump, 40 something divorcee who annoyed everyone in the neighborhood. She had zero understanding of boundries and liked to come over to people's homes, barge in and look (snoop) around; opening drawers and cabinets and touching their stuff - once she even went into someone's fridge and grabbed herself a ginger ale, then got mad when the homeowner took it back. If you left your door (front or back) unlocked for more than 10 minutes, chances were she'd just come right in. \nShe stole yard decorations from other peoples yards and had been caught on more then one occasion pocketing somethibg she'd snagged off a mantle or table of a house she'd invaded - And she would always throw a tantrum when she got busted. Cops had been called on her many times, but she was good at being pathetic, so most people didn't press charges. Unfortunately this made her bolder.\n\nBasically, she was THE entitled bitch of the neighborhood.\n\nSis was (unfortunately) one of her favorite victims. \n\nShe'd come over (without calling), barge her way in and 'Ask' (demand) to see Sis's cat, telling Sis how beautiful he was and how much she wanted a cat just like him.\n\n Sis, being rather non confrontational, would let her see the cat (who didn't like the woman) then make her leave (CN never wanted to leave and had to basically be pushed out the door. Oh, and she despised me because I wouldn't let her in when I answered the door, nor would I tolerate her B.S. in any way, if she got past my sister). \n\nCN was so obsessed with the cat and offered to buy him, many times.\n\nBut Sis LOVED that cat. He'd been the runt of the litter and rejected by his mom. My sister had taken him and bottle fed him, mothered him and saved his life. He wasn't a pet, he was her child. So Sis of course always said no. \n\nThis royally pissed off CN.\n\nOne day the cat got out (he wasn't an outdoor cat), so Sis and I immediately started looking for him. We were checking the bushes and behind the flower pots in her back yard, when we heard a very distinctive yowl (one of pure Rage), followed by a very human shriek of pain.......coming from CN's house.\n\n Suddenly, the doggie door on CN's back door slams open and out runs my sister's cat - his tail and one rear paw covered in what smelled like hair bleach (I'm allergic to bleach and immediately recognized smell as he passed me) - dashing past us and into Sis's house.\n\nNext thing you know, CNs back door slams open and out she comes; cursing up a blue streak. Ragged claw marks adorned her left cheek and one of her hands had a deep bite wound that had completely saturated one of the gloves (the kind one gets with any hair coloring kit) she was wearing and running down her hand and arm. \n\n Turned out when the cat had gotten out, CN had grabbed him, took him inside, then tried to use hair bleach to bleach the brown out of his tail and paws, in order to change his appearance so she could keep him!\n\n Unfortunately for her, she didnt know shit about Saimese cats and just how Violent they can be (they were, originally, temple guardians for a REASON lol). The moment CN put that bleach on that cats tail, he went absolutely berserk; letting out that 'Yowl of Rage' we'd heard, clawing up CNs face and sinking his fangs deep into her hand. \n\nShe pushed herself between the bushes (the ones that look like tall, green paint brush heads) Sis used to separate the property line and began yelling. No, not yelling. Shrieking.\n\nShe shrieked that Sis's cat had WANDERED into her kitchen, while she was COOKING and when she tried to pick him up, he ATTACKED HER for NO REASON. \n\nClearly this was total B.S..\n\nCN then proceeded to call Sis the N word several times (shes half black) and me a effing half-breed-Wetback-slut (I'm half hispanic. We have different dads). She screamed that my Sis was stupid for keeping such a Dangerous Animal and that my Sis would be paying all her medical bills. She then got right in my sister's face, pushed my sister hard in the chest (with her uninjured hand), saying she was calling animal control and intended to HAVE THAT THING PUT DOWN!! \n\nCN opened her mouth to say (shriek) some more, but my Sis - after hearing that last statement and without one word or warning - hauled off and decked her.\n\n She landed on her butt in the grass, now clutching her left eye. Sis then loudly suggested CN 'go screw herself with a hot curling iron', then ran inside to find her poor cat, while I called the cops.\n\nThe whole thing from start to end, lasted only about 5 minutes.\n\nSis found him hiding in the laundry room and quickly cleaned him off in the sink.\n\nMeanwhile, CN is still on her ass in our back yard, howling like a bansidhe, until the cops arrived.\n\n I told them what happened and they later talked to my sister (after she'd tended to her cat), who gave them the same story I did - even admitting to hitting CN....in self defense of course. It didn't hurt her case that CN HAD left a bloody hand print on my sister's shirt when she'd shoved her.\n\n\n CN, of course, told them something entirely different. HER story was that she was about to bleach her hair when my sister's cat came in and attacked her. She also said both Sis and I attacked her too - I apparently kicked her in the stomach after Sis punched her, but the cops found no evidence of bruising - and the scratches on her face kind of masked her swelling eye. I also think cops turned a BLIND EYE (pun intended) to it, considering the circumstances, but, since there was a clear bloodtrail leading into CNs open back door, cops felt they had probable cause to go in (I think if CN had been paying more attention, she'd have refused them entry).\n\n The blood trail led to a sink in the 1st floor bathroom. Blood, cat fur, a bleach applicator and the box it came in were in the sink and on the floor. The cats collar was in the garbage.\n\nCN kept trying to play the victim, but the cops didn't buy it. She got arrested and my sister pressed charges for theft and assault. CN also got nabbed for possession of stolen goods ( cops found a bunch of DVD players and CD players - still in their boxes - sitting on her coffee table and in the spare, room next to her bathroom) and she had a bunch of prescription drug bottles with other peoples names on her kitchen counter (turned out she'd also been stealing neighbors painkillers when she'd Visited them). And, since she was a renter, the property owner gave her the boot for breach of contract. She went to jail and had to pay for the cats vet bill - he was ok, but a bit traumatized and had a yellow patch on his butt, paw and tail for several months.\n\nCN's hand got infected from the cat bite and it turned out it had also caused tendon and nerve damage as well. \n\nMoral of the story: Stay out of people's houses.......and have the common sense not to mess with a cat named Lucifer.\n\nEdit: I'd like to thank the people who gave me the gold, silver and platinum. It means a great deal to me that you liked and enjoyed this.",
        "score": 6615,
        "id": "b41t9k",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/b41t9k/nuclear_feline_revenge_crazy_entitled_neighbor/",
        "created_utc": 1553237760.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Security made us show the last 5 photos on our phone.",
        "selftext": "My coworker, and absolute hero, maliciously complied at security on one of our subcontractor jobs. The customer was a manufacturer for high end electronic components. Security was tight as a small 4\" x 6\" box could contain $250,000 worth of microchips. Our team was installing equipment in their facility for one week. A security checkpoint had to be passed every trip in or out of the building.  \n\nMr. Security guard, Chad maybe,  decided my coworker,  Steve probably,  was more suspicious than the other 4 techs. So every trip in or out, not only was Steve made to dump his entire contents of his backpack out on the table and go through it, Chad required Steve to show him the last 5 pictures taken on his phone \"to prove he wasn't stealing secrets.\"\n\nThis is all fine, except Chad let's everyone else through without any sort of inspection.  Steve is trying to stay positive,  but obviously this is eating away at him. Steve tries to be overly positive and also a bit snarky with comments like \"thank you Paul Blart, for keeping America safe,\" which busts up the rest of our crew. Then, Steve has the idea that will free him the rest of the week.\n\nWednesday comes along, Steve is overly scrutinized on our way in as usual.  As we head to security at lunch, Steve says he has to go to the bathroom. He comes back out a few minutes later, absolutely giddy.\n\nChad Blart, mall cop, stops us on our way out and asks Steve to see his camera roll. Steve gladly hands the phone over. Chad is greeted by some very peculiarly angled shots of Steve's butthole.\n\n\"What the F@%$?\" Chad throws the phone down on the table.\n\n\"Oh, sorry. I thought I had a hemorrhoid and wanted to see how bad it was. Is everything ok with my pictures? Is the facility safe?\"\n\nChad never checked Steve's materials again.\nGood on you Steve.",
        "score": 58294,
        "id": "fa5wsx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/fa5wsx/security_made_us_show_the_last_5_photos_on_our/",
        "created_utc": 1582774580.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "My boss suspended me for his negligence so I ruined his life.",
        "selftext": "For a little context: I work at a vape shop which is already in a rough space due to regulations and laws the government is putting on us. Due to this we were well ware that certain products we sold/made were highly illegal and enforceable at any time.\n\nI (25M), have been working at my job for a little over a year and a half. The owner of the company is the one who hired me and she was the biggest sweetheart in the world. Unfortunately, she was forced out of her company by her son. He is the type of person who believes that he is always right and if you don't agree with him, he will completely ignore you or fire you. He literally forced his mom into retirement by threatening to unalive himself and continues to use that card everytime she even says she wants to come visit. \n\nLast winter we had a massive snow storm. Getting to work was rough, but we were told that we had to come anyway. We get there and the snow isn't plowed from the parking lot because he didn't wanna pay the guy to do it so we had to. Due to the lot being absolutely massive we couldn't get it all done in time for us to help customers. As they came and went we noticed the snow being patted down into the ground and essentially turning into a slip and slide. Of course he didn't do anything about it and asked me and another coworker to clear all the garbage out of the other side of the building. When I did, I slipped and hurt myself. I didn't file for workers comp, but told them I'd need to rest myself while at work. The next shift I sat almost the entire shift and because I couldn't do anything I sat on my phone, only to get up to help customers. The next day my manager tells me he got out of a meeting with the owners son and I was suspended for a week (5 shifts). As I'm a college student and rent an apartment and have car payments, I couldn't afford to lose 5 days of pay. I marched into his office and laid it out that either he fires me so I can collect unemployment or unsuspend me. He told me neither was happening and that he was gonna use me as an example to the rest of the employees. I was pissed and cursed him out. He doesn't like confrontation so he shortened my suspension to get me out of the office. He then treated me poorly and singling me out for everything everyone else also does, but I was the only one being punished. Then comes the fact that he wanted to \"reconcile\" by forcing me to do handiman work around the place and didn't give me the tools, equipment, or training to do or use any of these objectives. This was the tipping point for me.\n\nThe revenge: Due to being constantly singled out I came to learn that everyone else was unhappy with this fact. I learned all the dirty little secrets about the company including illegal products, labor violations, tax violations, etc. I used these secrets that I learned to call multiple government agencies (FDA, OSHA, DOL) and report him by name. First, OSHA came and did an inspection on my day off. He told everyone they only cited him for a small violation and he was good other than that. I was obviously angry at that but a few weeks later I got a packet in the mail telling me he got cited for everything and he was getting massive fines. I then get called into the office again with the manager who told me I was suspended. He proceeded to tell my manager that he was getting demoted for not writing me up more and that I was no longer getting my raise until I \"fixed my attitude\". This of course was right after he said \"I don't care that you called OSHA\". This little act is known as retaliation which is illegal to do to people who called a protected agency like OSHA. He refused to even look at me at this point because if he did anything that would imply he was punishing me for calling OSHA I would have a lawsuit to destroy him. \n\nNow to today: another day off for me and I get a text from a coworker at 11 am. That message was \"FDA is here. The manager quit and it's crazy\". The FDA and IRS came rolling in full force in black trucks/SUVs. They came in and raided the place, seizing all illegal products and all the paperwork pertaining to the business. They're still there as I write this, so hopefully there will be more to come, but knowing how this works out in most cases I won't have a job much longer and will be on unemployment. \n\nTL:DR: my boss punished me for hurting myself at work, so I called a bunch of government agencies on him and probably got all of his businesses shut down.\n\nUpdate 1: the ATF also showed up. They confiscated all the house made juices. We apparently don't have a manufacturing license. None of us knew this and that means we may no longer be able to sell products. The IRS showed up because there's a possible cause for an investigation into tax evasion. As I learn more I will continue to update.\n\nUpdate 2: It seems as though through talks with the lawyer the son decided to actually take the heat for all of it and is going to have to pay massive fines and is possibly looking at jail time. He likely won't ever be able to get a manufacturing license for the rest of his life and they said essentially that he won't be able to open any new businesses. I know he had two new locations rented out and in the process of opening and those are never going to happen now. They're raiding his other business today and that's going to be interesting considering that if he doesn't have the paperwork for that business it could lead to much much more jail time. So as of right now even though my job isn't shutting down yet, his other business is getting raided, he can't open the two locations that he's put a shit ton of money and time into, and he's going to be fined all he's worth and possibly go to jail. Will continue to update!\n\nFinal update: Hi guys!! Sorry for the long wait for an update!! After many long months and tons of setbacks, me and the other guys from my last vape shop have opened our own! We want to do everything the right way and make it a place where people can come and hang out like vape shops used to! It's a 21+ sober building. We hope to make a safe and enjoyable environment for everyone and also provide them with safer alternatives to smoking cigarettes & cigars and using dip/chewing tobacco.",
        "score": 6505,
        "id": "y98x5t",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/y98x5t/my_boss_suspended_me_for_his_negligence_so_i/",
        "created_utc": 1666297496.0
    },
    {
        "subreddit": "Bridezillas",
        "title": "Update. Coworker asked me to be her Man of Honor.  I said no. She went nuts.  What did I miss?",
        "selftext": "\\*\\*Edit\\*\\*\n\nI keep forgetting to thank my boyfriend.  He has been with me on this but more in the background.  First when we were laughing about it.  But when everything Thursday happen he was there as well.  L was able to get him away from his unit for a little bit for the it will be okay boyfriend hug. He stayed the night with me a couple of nights as well also helping with me being sick.  So yeah. I'm very lucky to have such a great support. \n\nThis intro is going to be long, but I’m telling you about this for a reason and later in this update it will make sense.   I'm hoping this will be done and that this will be the last of this whole situation.\n\nI was born into a family where I was referred to as “An issue that needed to be dealt with” I lived in the shadows of my sister who was the child my parents wanted.  They wanted one child which was a girl.  That way Dad had his daddy girl and mom had mommy little princess.  Then I came along.  Keep in mind that I’m 23 so back then my parents had options but chose to not use any of those options.  So instead my parents raised my sister and I was raised by a nanny who even to this day is one of the biggest influences in my life and I am so grateful for her.  She helped me with so much. I finally realized that all these years later that by being referred to as “An issue that needed to be dealt with” that they stripped me of my humanity and individuality and self- worth as a person.  I think that’s why I have worked so hard to establish myself in my career and in my life.  As a way to become a person again and not just be that issue that needed to be dealt with.\n\nThis past Thursday things came to a head with the Bridezilla known as C  and the truth came out.  My best friend L has been sticking close to me when we work together if C was to start something.  We weren’t sure if she was going to leave it alone or start up again.  I was really hoping that it was done.  But she had to try once again. I’ve been sick and I had a busy morning so I really just wanted a few minutes to go to the bathroom, grab a quick snack and maybe breath??? C came up and had her list and asked if I had a few minutes to talk about the wedding planning.  I looked at her and told her again no that I was not interested in being part of her wedding and that I was not going to help in anyway and she needed to drop the subject and leave me alone.  Again she went into the who thing of how I was going to do this and how much fun it was going to be.  Here we go with that line all of you loved the first time.  “Why in the ever loving fresh creepy hell is it so important for me to be your Man of Honor? I’m not interested and I’m not doing it.”\n\nIt is as exactly as pretty much all of you told me it would be.  She was just planning on using me as a token or a play toy.  She took all of the fucked up gay stereo types that are out in society and put them into one sentence. “What modern liberal women isn’t going to have a Gay Bestie on her arm for special events?”\n\nI felt everything in my stomach move and a wave of nausea come over me and I felt like I couldn’t get to the bathroom fast enough. This pissed L off to no end.  L is really kinda like the over protective sister that I wish I would have had and took C off to visit our boss K and laid it all out.  Everything that was said. While I wasn’t in on that conversation L and K filled me in on what was said.  K came to check on me and I was still hiding in the bathroom She knocked on the door and asked if she could come in.  I asked her for a bottle of water first.  While I was waiting I realized two things.  I realized why I chose to not hang out with her and why didn’t like her.  I couldn’t figure out why I didn’t like her just that there was something that gave me the heebeegeebees. But I realized that I didn’t like her because she is a different version of my sister. While C is educated and employed she doesn’t care about other people and their feelings.  She is like my sister in the sense that if she wants something bad enough she will figure out how to get it.  The second thing I realized was that she did exactly what my parents did to me.  She completely dehumanized me and reduced me to an entity.  Just kinda turned me into a token or a thing for her.  I think the word that best describes it is I’m must a play toy. What really gets me is that just like my sister C doesn’t think she did anything wrong and I’m being too sensitive and a delicate snowflake. \n\nThe next day an emergency meeting was held at work and C is being suspended  pending investigation and a new transfer is being looked into.  K made the request for her to be terminated.  The Director of Emergency Nursing said this was a last resort but she was going to be looking into options which could be sending her to a new hospital or facility. This didn't go over well with me.  I asked what would happen if she did the exact same thing to someone different? She didn't really give me an answer.  But she said she still needs to look into a few things and at this point she is suspended.\n\nAnyway.  Here it is.  I'm still pretty sick and had to work this weekend. If I can I'll respond.  I want to thank  everyone for all the amazing support.  I am going back to my lawyer to see if he can figure out how to send her a Cease and Desist letter to make sure she doesn't contact me.  I'm heading to bed.  Have a good night!!!",
        "score": 5211,
        "id": "1gi9601",
        "url": "https://www.reddit.com/r/bridezillas/comments/1gi9601/update_coworker_asked_me_to_be_her_man_of_honor_i/",
        "created_utc": 1730589277.0
    }
]