[
    {
        "subreddit": "NuclearRevenge",
        "title": "Guy behind me in traffic was blinding me in traffic with his high-beams, so i violated his retinas with the full force of an afternoon sun",
        "selftext": "I was driving home from work and traffic was backed up pretty badly for a few miles. It was stop and go. When i get stuck in that, i'll usually back about 75 feet off the car in front of me so that i can hold a pace and move at a slow, but constant roll - like the semi trucks do. This way im not participating in the bumper to bumper move and brake like the rest of the smooth brain drivers. \n\nSome dude in an Acura Crossover was behind me, and i guess he was getting upset because i wasn't 2 feet from the car in front of me, driving like a smoothbrain. So he gets up on my butt and starts beeping his horn at me. \"Lol\" i think to myself as i turn up my radio. \n\nBut then he starts flashing his brights at me, which is where i get annoyed. He's in one of those acuras that has the super bright LED headlights. My car is much lower than his, so his low beams are already pretty bright in my mirrors. Bright enough that i dont want to look in them. The first time he flashed his highbeams it put spots in my vision for a moment. It genuinely hurt my eyes. After the first flash, he waits for about 10 seconds, beeps his horn, and then flashes me again. Now im getting pissed. Im thinking \"where the fuck do you want me to go? Do you really think being two feet from the car in front of you will make traffic move faster?\" Then he flashes me a third time, but this time he held them on for about 15 seconds. Time for the gloves to come off. \n\nDuring those 15 seconds, as im looking away from my mirrors, i see my 14,000 lumen searchlight sitting in my passenger seat, at which point I'm immediately overcome by a wave of chaotic-lawful excitement, what he has just set in motion can not be stopped. I think to my self \"oh buddy....you just opened the wrongggg can of worms. You're gonna learn today\" \n\nI grab the flashlight and set it to its absolute max 14,000 lumen brightness setting. The flashlight has a sensor in it to automatically dim the light if facing down on a table, because otherwise the diodes would get so hot they would melt the lense.The 14,000 lumen setting is so intense, the 57 watt-hour battery can only hold it for 180 seconds before the flashlight automatically notches down to a measly 9,500 lumens. During those 180 seconds, the light will burn through 15% of it's battery power. For reference on just how bright this is, *the literal fucking sun* emits a luminosity of 11,000 lumens per square foot on a bright and clear day. \n\nI turn around and aim it straight out the back of my rear window. My car is pretty noisy, so before i turn it on, I rev up my engine to make sure captain smoothbrain is eyes forward when I violate his retinas with the full force of an afternoon sun. I hit the power button and can only imagine the freight train of shock and pain that plowed over this man. It was so bright, his automatic headlights shut off because the car thought it was daytime. With the light on, i could see him clear as glass through his tinted windshield, he was covering his eyes and looking down. Probably screaming. I watched him try and flip down his sun visor, but his hand couldn't find it, as i thought to myself \"Burn you motherfucker....burn\". I imagine my facial expression was similar to that of a 6 year old roasting insects with a magifying glass on a bright summer day. After about 5 seconds of blinding light, i took mercy and shut it off. He proceeded to back way the hell off, and move over to a different lane. \n\nWas this an unsafe thing for me to do? Absolutely. Was this illegal? Almost certainly. Was it warranted? Without question. Possibly the highlight of my year\n\nDrive safe, and dont be a dick to the car in front of you. Because they might just have the tools to teach you a lesson. \n\nTLDR: Dickhead in traffic was excessively flashing his highbeams at me, hurting my eyes, because I couldn't go faster than the car in front of me - so I showed him how it feels.\n\n__PLEASE NOTE: THE CONTENTS OF THIS POST ARE MY INTELLECTUAL PROPERTY, AND ARE PROTECTED UNDER COMMON LAW COPYRIGHT. ANY UNAUTHORIZED DISSEMINATION OF THIS POST WITHOUT MY EXPLICIT PERMISSION IS COMMON LAW COPYRIGHT INFRINGEMENT__",
        "score": 12055,
        "id": "zru0nc",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/zru0nc/guy_behind_me_in_traffic_was_blinding_me_in/",
        "created_utc": 1671641704.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Try to drug and rape an innocent girl at a party? No. Not while I'm here.",
        "selftext": "**First story. Taken down from Pro-revenge because of a ban on felonies. Tell me if that's not allowed here also. Long and graphic so skip if you're not comfortable. TLDR AT THE BOTTOM.**\n\n&#x200B;\n\nSo, to put it simply, I was a little shit as a kid.\n\nI use to steal from stores and family, swear and throw things at random people walking down the street, was smoking from the age of twelve and didn't give a shit about anyone but my friends. They were my *real* family, or so I thought, and the group of all five of us would cause trouble every single fucking day.\n\nMy parents, though in my later years have told me they should have been more effective in their discipline, really weren't to blame. I was just a mixed-up kid. I use to think that doing all this stuff made me cool. I can't really describe how superior I felt when I made grown adults afraid of me, but it made me feel powerful, and power was something I craved when I was younger.\n\nI could go on and on about my sins but the fact is, I was just fucked in the head. I've made amends where I can to who I could but you're not here for self-flagellation, you're here for the revenge.\n\nSo long story short, when I was 16, my parents finally had enough, and despite all my tantrums and screaming and even some physical violence against my dad, they decided to put me in a 'school for troubled youth.' I call it a school, but what it really was, was a military institution that taught discipline in the most brutally effective ways while throwing in some literacy and numeracy classes along the way.\n\nWithout going into to much detail I'll say that this school changed me. While aggressive, violent, cocky and near homicidal when I was first dumped on their doorstep, the men who ran this camp broke me down. I was there for just over a year. No phone calls, no visits home, no access to the outside world. For one whole year, I had this camp and these counselors, these real-life hard-ass men teach me just how much of a shit stain I really was.\n\nBy the end of my second summer, I was a changed kid. I had fought and screamed and gotten my ass kicked more times then I can count but eventually, I was beaten down. These men taught me that real men simply don't act the way I did, and that the type of path I was headed down would lead me either in jail or dead. They were brutally honest about it, especially this one counselor **J**. By the end of my 'stay' I considered J a second father. Though I hated him at first for making me feel inferior, he really did me a favor teaching me how toxic my behavior was, and to this day I still think of him as something of a hero. He was the main person who deemed me ready to return home.\n\nBut the back story is getting really long, so let's get to the real story.\n\nWhen I returned home I had changed from an abusive little prick to a 'somewhat' civilized young man, ready to take on my last year of high-school. I was nervous to go back, since I had adapted to the disciplinary school lifestyle, but I was also excited. I missed my friends, and hoped they would just accept me back despite the fact that I hadn't spoken to any of them in over a year.\n\nAnd to my relief, I was accepted back with open arms. One of my closest friends had moved states since I'd been away, but the other three were ecstatic to see me. Over the next few weeks I settled down, I didn't spend a lot of time with them outside of school. My parents were kind of testing how much I'd matured since returning, and were setting boundaries on when I could go out, how long I could stay out and where I could go etc. I was determined to prove to them I wasn't the same fuck up that had ruined their lives all those years, so I followed their rules, and so only really talked to my friends during school.\n\nAll of this is relevant, because of what happened next.\n\nI had joined the school football team all three friends were a part of, and one evening after practice, all my teammates were in the gym, sweaty and dirty but pleased with ourselves. I was laughing and chatting with my three best friends so much I didn't really notice that we were the last left in the gym. But that's when the conversation started turning bad.\n\nOne of my friends, I'll call him F1 (Friend 1) for simplicity, started telling me about a college party they were all planning on going to, and how they'd been crashing college parties for a few months now, since it was easy access to girls and booze. I was hesitant about it because I didn't think my mum and dad would agree to let me go, but then F1 started talking about this girl he was planning on inviting. A girl who went to the same school as us but not one I thought F1 had any real relationship with. I knew her, but I didn't *know* her. He started to tell both my other friends, and me, that he'd been trying to get her into bed for a while and she kept making 'excuses' so he planned on taking her to the party and finally 'smashing'. When I asked him, in a joking way, 'what makes you so sure she won't reject you again?' He looked me dead in the eye and said as casually as you please the most chilling sentence I have ever heard in my entire life.\n\n\"I'm just gonna slip something in her drink. It'll loosen her up, no problem.\"\n\nAt first I just kind of awkwardly laughed, thinking it was some fucked up joke but they weren't laughing with me. When I asked him if he was serious, he told me he was sick of her 'bullshit games' and knew she was just stringing him along, and that the 'pills' would just 'make things easier.'\n\nI could not believe my fucking ears.\n\nI excused myself from the conversation pretty quickly and practically bolted home, most likely driving through several stop signs but I really don't remember. I spent the whole night convincing myself my friends were just messing around.\n\nA few more days pass and the conversation in the locker room is all but forgotten, though they hadn't shut up about the party, and kept insisting that I just sneak out and join them. I got called a 'pussy' repeatedly for telling them I wasn't going because of my parents, but again, I just brushed it off.\n\nThen.\n\nThen the shit finally hits the fan.\n\nDuring yet another, after-school training session we all end up the last in the lockers. And F1 does something I never would have expected in a thousand fucking years. All three of them have been talking about the party this whole time, then F1 starts rummaging through his gym bag. He tells us all to 'look at this' and tosses F2 a small bag of little pink pills.\n\nImmediately, I feel the blood drain from my face, and like a bombs going off in my head a voice in my mind is screaming 'holy shit, this is really happening, this is serious, HOLY FUCKING SHIT.'\n\nIts really hard to describe what I was feeling when F1 started going into detail about how he planned on inviting the girl to the party, slipping something into her drink and 'making use' of one of the frat boys bedrooms for a few hours.\n\nI was sick. Like literally could have hurled everything from my stomach all over the floor as I listened to all three of them talk about how 'awesome' the party was going to be after just describing how they were planning to rape a girl.\n\nI couldn't take it, and again I ran off.\n\nI actually did end up puking later that night, going over and over in my head what the fuck I had just witnessed. I almost couldn't believe it. These three boys had been my friends for 15 years. I thought of them as my own family, thought I knew them better than anyone, but one year away and this?\n\nI'll tell you that I actually broke down crying that night. I'm not ashamed to admit it. What I am ashamed of is how long I took to actually get a grip and handle it.\n\nI knew I should have told someone, but in some fucked up way, my loyalties were still screwed. Don't crucify me for it, I know now what I should have done, but I was seventeen, and these were my best friends. I didn't want them to get into trouble, but at the same time, I knew I couldn't let this shit go down, so instead of reporting all I'd heard to an adult like a normal fucking person, I decided I'd sort it out all on my own.\n\nSo I went to F1, and told him not to do what he had planned. Told him it was stupid and dangerous and would ruin both his life and the life of the girl he was planning on drugging.\n\nHe didn't even blink. He got right in my face and told me that the school I got sent to had turned me into a pussy. That he hated how much I'd changed and had been trying to change me back with F2 and F3. Even told me how they'd been talking about me behind my back, and how they'd planned to 'give me a turn' on the girl once F1 was done with her, just to show me what I was missing out on. Then he said something I'll never forget. He told me, word for word,\n\n'I'm doing that little bitch a favor. She's a fucking virgin. And after this party, your mum won't be the only one finally getting some.'\n\nI punched him.\n\nWe fought, and we both got sent home on suspension for fighting.\n\nI could not fucking believe it. I was seething.\n\nMy best friend had said that to me. My *best friend* had told me he was going to rape an innocent girl at a party, and I was a pussy for not wanting to join in? I was disgusted. Sickened to my core. And I was done with him.\n\nMy parents were disappointed I had gotten suspended so shortly after coming home, but I just sat quietly while my mom cried and my dad screamed at me. I know now that I should have told him, but after what F1 said to me, I had this insane notion in my head that I was going to get him back all on my own.\n\nAnd now, to the revenge.\n\nAfter a weekend of being grounded, I went back to school, and the first thing I did was seek out F1. He was about as bashed up as I was, but he was sporting a nice black eye from where I'd hit him in the face. F2 and F3 were standing with him, and they all glared at me as I approached them. Then I did something that made me feel sick. I apologized to him. I told him I was sorry I hit him, and that he was right, I had changed, and I hated what that school had done to me, and I wanted to go back to being the old me again, and surprisingly, they all bought it. F1 and I even hugged it out, and I put the cherry on top when I told them I'd be coming to the party.\n\nNow, for my dumb-ass teenage plan.\n\nFirst, I started recording them whenever we were alone together. I wanted to get everything they said about the party and the girl they were planning on victimizing on tape. I knew I needed some kind of proof, or it would just be my word against theirs. And after a few days, I had gotten more than enough. But I wasn't done.\n\nNo, my stupid self had a plan and I was going to fulfill it to the fullest.\n\nSo the next thing I did was track down the girl, take her aside, and tell her everything. She was pissed, and scared, but I begged her not to go to the police or tell anyone. I know now that was stupid as well, but for some reason, she listened to me. I had a plan. A crazy, stupid plan to teach them all a lesson. So I told her to tell F1 that she was going to meet him at the party, but to just stay home, so she could stay safe. Later that day F1 started bragging about how the girl had accepted his invitation and everything was going to plan. And I sat there, phone half out my pocket, recording the whole damn thing.\n\nSo night of the party finally rolls around, and I sneak out, because, you know, I was grounded.\n\nI think it's worth mentioning that I wasn't filled with vindication and self-righteousness throughout the whole night. I was second guessing myself, I had doubts, but in some strange way, I felt betrayed. These three boys had been my brothers since before I could throw a punch and I felt betrayed that they had gone down this road. What fucked me in the head even more was the possibility that I might have been just like them if my parents hadn't sent me away. It was a strange moment of realization to come to in the middle of a crowded frat house surrounded by drunk idiots, but you take what life throws at you.\n\nSo the night goes on, and F1 is getting steadily more frustrated that the girl he invited hadn't shown up. I'd made sure to keep him in my sights for the whole night, not wanting him to decide that any old girl would do if he couldn't 'take' the one he wanted. I kept an eye on all of them, watching as they drank and drank while I stayed as level headed as possible with some water in a beer can. When midnight came, all three of them were plastered, and I knew that all the girl's at the party would be safe by then. By this time the crowd was dying down, and a few people who couldn't hold their liquor were already passed out around the house. And now was my time to shine. While all three of them were occupied with a drinking game, I hunted in F1's bag and found the bag of little pink pills. Here's where I did something I'm not particularly proud of, but I'll tell you anyway.\n\nI slipped one pill into three beers each and handed them to my 'friends', and then waited. It didn't take long before all three were passed out on the floor, along with quite a few other party guests. I then took out a black permanent marker pen from my bag and wrote 'rapist' on all three of their foreheads, took pictures and immediately uploaded them to our schools Facebook page, so everyone who attended our school would see. Admittedly, I didn't really think this part through, since I not only did this in full view of every other conscious person at the party, but also knew the photos wouldn't last long on the school site before they would be taken down. But since it was a small school, in a small town, I didn't doubt that a whole bunch of people would see it before a teacher removed the photos, and that's exactly what I wanted.\n\nNext came the recordings.\n\nWhen I got home, I got a verbal bludgeoning from my parents for sneaking out, but they stopped when I finally told them what had been happening. They were both shocked, and a little disbelieving, but when I played them both the recordings I'd saved on my phone, they were just as sickened as I was.\n\nI was silent in the car as my dad drove me to the police station, receiving a lecture about how I should have just come to him in the first place, and what I'd done at the party wasn't necessary. But I felt like it was at the time. My phone had already blown up with other students commenting on the pictures of my three ex-friends with 'Rapist' written on their foreheads. And while a lot just laughed at them, many were questioning if there was any truth to it. It was what I wanted. I wanted everyone to know who they really were, so they had nowhere to hide.\n\nThe hours at the police station were admittedly very scary. I was still debating with myself whether or not I did the right thing, but my 'friends' had chosen their own fate. I still felt hurt and betrayed they'd allowed themselves to become this way, and even though I felt a little guilt for potentially ruining their future, I did what I thought had to be done.\n\nAnd long story short, the recordings were enough to get them all on charges of planning to commit a crime. Since the girl F1 had been planning on drugging had been named, her parents were understandably furious, and demanded all three of my ex-friends be arrested. I would have been to, were it not for the girl telling her parents, and the courts, that I had warned her to stay away from F1 and the party. I was charged for my use of an illegal substance, since I admitted to using the pills on my 3 ex-friends, and also for battery, since the permanent marker was seen as a form of assault, but luckily I never got jail time. I did get a boatload of community service though.\n\nAll three of them were tried as adults in a case of attempted rape, but only F1 got actual jail time, since he was the one who'd gotten the pills and was the only one who admitted to wanting to use them. The other two only got probation and community service for being 'accessories' but were completely shunned in our town. No one ever let them forget.\n\nI was prepared for the backlash, ready to be jumped by them or something, but strangely enough, I think seeing F1 go to jail for what he did knocked some sense into the two of them, and they wised up enough to actually get into college without football scholarships, since they were both kicked off the team. They never came anywhere near me again, which surprised me, but I no longer cared. In my mind, my friends were dead to me long before all of this went down, and by the time I moved away to college, it was all behind me.\n\nI'm in my final year of college now and I still think about those three sometimes. I think about how, if my parents hadn't sent me to that special school, I may have ended up just like them. Oddly enough, I do miss them at times, but I know its the memory of the kids I miss, not the men they turned into. I've thanked my parents continuously for sending me to that place, and even got some approval from J when I felt man enough to tell him what happened. I don't know what will happen to F1 when he gets out of jail, but a part of me hopes he learns his lesson and moves on with his life, like I have.\n\nJ called me a few days ago, just to check up, and I told him this whole story, which is kind of why I'm now telling the internet.\n\nI guess the moral is to stand up to your friends when you know they're doing wrong, but maybe not in the stupid way I did it. Always involve others more qualified to deal with situations you're not sure about. Even if you're a headstrong, stubborn as fuck teenager who thinks you know everything.\n\n**TLDR: 3 old friends of mine plan to rape a girl at a party, so I expose them to the whole town, and get one friend thrown in jail.**\n\n&#x200B;\n\nUpdate: Wow. I did not expect to get THIS much support over all this. Thanks for the kind words, and sorry I haven't answered so many questions, but school has been harsh, so I'll try to answer as many as I can.\n\n1: To all of you asking if the girl in the story and I became friends, well, sadly, no. We talked a lot during the court case and after, but we never really developed a friendship. I think we were both too embarrassed over everything, so we just went our separate ways and remained civil in school.\n\n2: For everyone questioning why I sound 'British' all I can say is WOW. I'm used to people picking up on it in person, but not through writing. Some of you guys must be secret geniuses. My father is British. His whole family lives over there and we visit a lot. And his family is about as British as they come. And a little piece of side information, I was actually born in Britain, (six weeks premature) but I was raised in America.\n\n3: For everyone asking about J, well he's great. A great man who's gone through a lot in his life to. He lost his son to drugs, which is why I kind of think he made it his job to look out for boys like me, just to make sure no other parent goes through what he did. His reaction to what happened was to basically call me an idiot for all the crap I pulled, but he was proud I didn't forget everything I learned the moment I got home. He's also told me that he'd like for me to come and speak at the school next summer, just to tell some of the new boys coming in how bad things can get if you refuse to change the way you live. If I ever strike it rich, I'll be giving that school a massive donation.\n\n4. For everyone asking where this happened, for the sake of everyone's privacy, including mine, I'm going to have to keep that a secret. All I can say is it was a small town, with a small population, which is probably why the whole thing wasn't plastered all over the news. But, I'm paranoid, so that will just have to remain a mystery.\n\n5. For everyone suggesting I track down my friend that moved before I got back home, well I'm kind of on the fence about that. Call me a coward, but I think I'd prefer to remember him as my childhood friend, without all the memories being tainted the way they are with all the others. If I went looking, I might not like what I find, and even though It's possible he changed too after being removed from such a toxic environment, I just don't know. I guess I'd rather live with the ambiguity.\n\n6. For those of you wondering what I would have done in the situation if I'd never gone to that school, well, for obvious reasons, I can't really answer you. I'd like to think I would have stood up to them all the same, but my mind was seriously twisted back then, so I'd prefer not to think about that.\n\n7: For everyone questioning what I'm doing now, I'm studying Aerospace Engineering. I love planes, and through my course, I've gotten to tour the underbelly of both planes and even some aircrafts that have been in space. I don't want to sound like a dork, but seeing all those components fit together, and actually knowing how it all works and what everythings called and how to identify everything, is seriously epic. I just hope I pass the course with a good enough grade to make a career out of it.\n\n&#x200B;\n\nIf there are any other questions I missed, feel free to ask me. I don't have a lot of free time so the responses might be late but, by all means, ask. Once again, thank you to everyone for your kind words, and for the surprising lack of people calling me a dumbass. I appreciate it.",
        "score": 11795,
        "id": "b78wof",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/b78wof/try_to_drug_and_rape_an_innocent_girl_at_a_party/",
        "created_utc": 1553934420.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "HOA won’t let us fly our modest Pride flag, so we just follow the rules.",
        "selftext": "Due to some neighbors flying BLM flags, Thin blue line flags, and other opinion flags, our HOA decided last month that we’re only allowed to fly the USA flag, and nothing else. They day after the decision, we receive an email that someone reported our Pride flag (that we had in our house since 2016), and that we needed to take it down. We complied and removed the flag. \nLooking through our new rules, we noticed that removable lights are permitted without restriction so... we bought 6 colored flood lights, and we washed our house in pride colors. \nA little less subtle than our simple flag. A lot more fun for anyone complaining about the flag itself and what it represents.\nIf you’re interested, here’s the house now: https://imgur.com/gallery/SHSv6rd\n\n*edit to point out that the flag was displayed on the front porch, not inside the house. It was a typo when I wrote “we had in our house...”)\n\n*SECOND EDIT: THIS GOT MORE ATTENTION THAN I WAS EXPECTING. JUST CLARIFYING THAT I DON’T HATE MY HOA, I DON’T THINK THEY CHANGE THE FLAG RULE TO ATTACK ME PERSONALLY, AND THAT I DECIDED TO DO THIS TO SHOW MY INDIVIDUALITY WHILE STILL FOLLOWING THE RULES. I just can’t keep up with the comments. \nThank you all for your amazing support!!",
        "score": 111930,
        "id": "nq4eui",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nq4eui/hoa_wont_let_us_fly_our_modest_pride_flag_so_we/",
        "created_utc": 1622581032.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Landlord advertises all of our company’s equipment for sale to our competitors. Best follow our eviction to the letter.",
        "selftext": "**UPDATED**\n\nTl;dr (SPOILERS) landlord gives us 7 days to vacate our leisure business from the building, he thinks we cant empty the business during lockdown, and proceeds to advertise OUR equipment for sale to our competition. We sell everything in 7 days and destroy the rest. Enjoy no rent and the loss of your potential buyers.\n\nI work for a leisure company, think soft play, indoor soccer, laser tag (can't be specific) Prior to lockdown, Managers and the big bosses were negotiating the renewal of the lease on one of our parks. Things were going mostly smoothly, however, the landlords were difficult to contact.\n\nThen 2020’s shit hit the fan.\n\nAll of our sites were closed, and everything was thrown into a mess. Negotiations began to slip down the priority list; nobody thought the landlord would push an eviction for an expired lease during this period. Especially with it still getting rent, despite the sites closure, and the closure of every business and restaurant in the immediate area. We were wrong.\n\nA few days ago we received a letter saying we had 7 days to leave the premises and take everything with us. We are reminded that anything left in the building after 7 days will become the landlord's property! (that line is very important).\n\nNow a lot of construction goes into installing our equipment into a new building, which makes emptying one even harder. Add a lockdown, with no staff and most businesses shut, it meant that saving much of our assets would prove to be extremely difficult.\n\nTo lose a profitable site and all of its assets is definitely a blow to our company. But here is where it gets worse;\n\nA few days into our 7-day eviction, we find out that the landlord has been advertising our park to our competitors. But he isn’t offering just the building, he is offering ALL OF OUR STUFF PRE INSTALLED. “Ready to go, just needs re-branding.” The landlord has evicted us from the property in an attempt to increase rent and make a solid profit from our equipment installed because he thinks we won't be able to empty the park.\n\nWe were furious.\n\nAnd here is where the malicious compliance came in, we were told we had 7 days to move everything we owned out of the property. so that's what we did. Local businesses from all around offered up free space to store our things, a few people came back out of lockdown and they all spent the rest of the week removing, selling or destroying everything that was related to us. We didn't even leave light fittings.\n\nIn every other sight vacation we have seen, we always end up leaving thousands of $$ worth of disco lights in the ceilings because they’re too hard to get. We leave most the construction in, as well as things like the bars and kitchens that all stay intact (recognisable as what they once were) but not this building.\n\nWe ripped up the flooring we installed, tore down the walls that were not part of the original structure (Wooden walls to divide up the space) ripped apart our manager's offices and removed all artwork, and lockers.\n\nThe landlord now has every new deal he has been making dead in the water, a large renovation bill to install new flooring etc. (or a company willing to do it themselves like we were).\n\nLockdown has been extended another 4 weeks, so he has at least another 4 weeks without rent (we were paying) and won't have any potential buyers.\n\nSilver lining: The assets we got out of the site (fridges, tv’s, equipment, food, tables) have all been sold, and the lack of rent and additional income has helped the business and paid staff wages.\n\nUPDATE\n\nHi Everyone! I'm so sorry for how long an update has taken, I was waiting for things to unfold.\n\nHere is what happened next:\n\nWe handed in the keys and it was probably the quickest handover we’ve ever had. The landlord Cleary didn’t want to make any kind of conversation and there was definitely an elephant in the room, but he definitely said NOTHING about the lack of our equipment.\n\nComplications did arise when we went to get back various deposits, But he had no case to withhold the deposits from us as the building was in excellent shape. (we had conducted much of the maintenance work ourselves, so the building was in a significantly better condition than we found it, (we also cleaned up 99% of the rubbish and dirt from our demolition crusade so he couldn't bill us for cleaning) )\n\nA very minor bit of pressing from our legal team meant that we received everything owed back in full!\n\nThe building is still Vacant and as of yet we don't know of any potential buyers.\n\nAt this moment in time our company is still standing despite the pandemic closures and lack of business, staff are all still employed and doing well!\n\nA huge thanks again for everyone who took the time to read this and to those who were dedicated enough to remind me for updates :D Big shoutout as-well to the amazing people who gave awards, I really really appreciate it and I’ve been making sure to pass on the good karma :)",
        "score": 83275,
        "id": "gbn0ka",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gbn0ka/landlord_advertises_all_of_our_companys_equipment/",
        "created_utc": 1588356088.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Get rid of my vacation? Have fun replacing me.",
        "selftext": "I originally posted this as a comment on another thread, but realized it needed its own limelight. \n\nI worked at a company that gave out exorbitant amounts of vacation. Anyone who worked there for 25+ years received 8 weeks of vacation and 2 weeks of personal time. This was a family owned company, but rather large. We ran 3 shifts totaling 250+ people. \n\nEnter Jimmy. Jimmy was a grissled old man, he started at the company when he was just 20, now he was 63 and gave absolutely zero shits. Jimmy also knew how to make a specific part for our product, him and one other higher up in the office. \n\nOne day the plant owner comes out and announces he's selling to a corporation. He's older and ready to retire, he promises that there will be very little change and wishes us all well. \n\nThe new company comes in and immediately goes after many of the great benefits we had. The first thing they do is cut everyone's max vacation down to 4 weeks, and do completely away with personal time. Anyone who's maxed out had until December 31st of that year to use it up, and they wouldn't pay it out. They then go into the office and clean house, firing anyone who's close to retirement. Including Jimmy's back up. \n\nBut they also do away with one very important rule. You no longer have to get vacation approved, you can just call in and take it.\n\nJimmy is pissed, and they know it. They realize he's the only one in the building that can do his job now. So they hire a new kid for him to train, most likely to permanently replace Jimmy. So Jimmy does what anyone would do. He calls in the first training day for the new hire, and lets us know he's going to use all of his PTO at once, and promptly takes 10 weeks off. \n\nWe had a back stock of parts he had made, so it wasn't too unnerving. But for 10 weeks, Jimmy went and applied to other jobs, found one, and started. \n\nFast forward 10 weeks, Its the day Jimmy is supposed to return. He doesn't. For two days they try calling him, and even go to his house. He's nowhere to be found. Finally on day three he calls and resigns, and they lose their shit. The parts he makes are specialized and patented by the original founder, you can't just hire someone off the street to make them. What eventually happened was they had to contract the original owner to come in a teach some new hires how to make them, and when he found out what all they had done it pissed him off. The last I heard he charged them a 7 figure contract to teach them how to produce the parts, and they had to pony up, or close down.\n\nMoral of the story, don't fuck with people's vacation time.\n\nEdit: Jimmy made and electronic control module that was sealed and stayed fixed in a poured unit made of a two part epoxy.\n\nEdit #2: Jimmy didn't exactly \"Miss out\" on a seven figure contract and had zero chance to take one. He left, said fuck em and moved on. When they contacted the previous owner and explained the situation it was basically a \"you need my help? It'll cost 1mil.\" Type of conversation.\n\nFinal update: Thank you everyone for all of the attention this received! I had no idea this would blow up like this. I have immediate family working with the company still, so if I hear of anymore rumblings I'll fill you all in. Also, I worked here for four years. I have a few other Jimmy stories I may post at other times on the appropriate reddits. Thank you all again!",
        "score": 81923,
        "id": "nfcpai",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nfcpai/get_rid_of_my_vacation_have_fun_replacing_me/",
        "created_utc": 1621349510.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Steal my money, take my house, put me into debt. Now it's time for me to ruin your life.",
        "selftext": "Repost from r/ProRevenge as people said it belongs here \n\n&#x200B;\n\nMy  ex stole from me close to 90k euros which I saved up for 9 years, and  when I took her to court, I lost due to lack of evidence. At the moment I  felt destroyed and lost it all. She even sued me for emotional damages  and I had to pay 55k euros. So I was forced to sell my house and take a  big loan from the bank. I stayed at a friend and helped me find some  good lawyers. And we just found an amazing one.\n\nIn  1 day he helped me so much and even helped me get the info of who took  money from my bank account. Something was wrong, 29th of June a  transaction happened in my name. I never made it, I was not in the  country at the time. Well would you look at that.\n\nI  was ready to get back into court when I found out that she bought my  house. Well, I have a safe that I never told her about hidden in the  bathroom behind the cabinet. Well she ruined my life, why not ruin her  even more? So I had an accomplice that helped me buy some drugs, worth  about 400 euros and used a friend to hide it there. The safe has a 4  digit code, that being 0000, never got to change it to something else.  And before taking her to court again I had that same friend who hid the  drugs turn her in.\n\nIt took about a  week for the cops to receive a mandate to search the house, they found  nothing in the first 2 hours, and they wouldn't if my friend forgot to  leave the safe cover open.\n\nThat 400 euro worth of drugs are equal to a 5k euro fine and 12 years of prison. Well I'm not done yet.\n\nCourt time again!\n\nI  had my lawyer get the footage from when the money from the bank was  transferred and also I had a document showing that I was not in the  country at the time.\n\nWe also found out the account to which the money was sent to. The name was that of my Ex.\n\nWell,  look how the tables have just turned. My lawyer also demanded payment  for emotional damage, all the money that was stolen, the house and also  money equivalent to 2 times the debt I had in the bank which is equal to  about 140k euros. The look on her face when everything came down  crashing on her was totally worth it. And on top of the 12 years from  drug possession she received an additional 25 years for theft and false  testimony. Enjoy it, Bitch.",
        "score": 10320,
        "id": "cixf6s",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/cixf6s/steal_my_money_take_my_house_put_me_into_debt_now/",
        "created_utc": 1564329045.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Wife cheated, so I tricked her into publicly admitting to having the affair and herpes.",
        "selftext": "Ok, so I’m the coworker that encouraged him to post this, unfortunately your account has to be 7days old to post here, so I gifted him an alt i made for a joke about a month ago. \n\n\n\nThis story is about 12 years old. I told it to one of my coworkers yesterday and he said i should share it to Reddit, today he again nudged me so here we are having drinks before the 4 day weekend and my writing is complete. So first time here and hi y’all. Sorry if there are typos! I included a TLDR at the end. \n\nIn college, I met the woman who I thought was my one. We dated for about 2 years and had a big ass wedding after a 10 month engagement, her family was pretty well to do in a small southern town. We were both continuing our educations and I was also working to support us. I was pursuing a masters in engineering while she was finishing her doctorate in anthropology. \n\nOver the summer an opportunity came up for her to make some extra money going as an aid on a religious studies trip to Jamaica. I didn’t hesitate when she asked me about it, I mean, she was going to get to visit Jamaica and get paid for it, I saw no downside other than missing her being at home for 6 weeks. \n\nLittle did I know at the time, but she had been fucking the professor(he had hung out with us, smoked my weed and drank my fucking beer I considered him a friend) who arranged the trip for a couple months and it was a get away for them to bang all over the island. I, clueless and happy went about the weeks while she was gone taking extra shifts so I could match what she made in our account and surprise her. What a dipshit, right? \n\nOne of the students from the trip actually seeked me out to clue me in. I didn’t believe him until I started looking for evidence on my own. I broke down and checked her texts while she was sleeping and nothing was there. There were a few VMs so I decided to listen and there it was, a message from that giant asshole saying how exciting it was that I almost caught them. I opened up her laptop and hit the emails after that, it was piles and piles of shit, making fun of me for not knowing, fucking in our bed and laughing about it. There was so much and I was so heartbroken. \n\nStill too hurt to take any action, I was lost. I had no idea what to do, so I sat on it for a couple weeks and acted as normally as I could, I noticed everything now, I felt SO stupid for not seeing it before. So many signs. One stuck out in particular. \n\nI noticed that our stash of homemade weed lube (if you’ve never tried it, I highly recommend giving it a go) was going down even though we weren’t having sex. It was obvious they were also using the fruits of my labor to get off more effectively. This really pissed me off. Like unreasonably so, Hulk fucking mad. It finally all hit me. I was a goddamn joke to these assholes and they were using the lube I made and fucking in my bed. I didn’t hurt anymore, I just wanted to make them hurt. \n\nSo, while she was “studying at the library” I made a new batch of lube. I put enough weed in it for it to smell like normal, but I also added some poison ivy from our backyard to the mixture, and after refilling the spray bottle we used for application, I waited. \n\nA few days go by and I’m working extra so i can be out of the house more, and bam, bait taken. That night after she goes to sleep my plan goes into action. I sneak her phone away and delete my contact, while replacing his phone number in his contact as mine. I go to bed but can’t sleep because it feels like I’m 5 and tomorrow is Christmas. \n\nDawn arrives and she’s in the shower. I get a text. \n\n*im super itchy are you ok?*\n\nNow Lord, now is my time. \n\n*look, I thought it had cleared up but I guess i had a flare up. I’m sorry, but I’ve got herpes, and I guess you do now too*\n\nI heard this bitch squeak in the shower. I’m covering my mouth damn near losing it. \n\nI went on to tell her that it was time to end things now, a new semester was about to start and I kind of have a little crush on another T/A. I wanted her mad, this is a woman that never got told no growing up, and never had to deal with rejection. Let alone from a balding dude in his 50s with herpes. \n\nWhen she got out of the shower it was obvious she had been crying but i could see the anger in her eyes. I could see how uncomfortable she was squirming at the table drinking coffee and mulling the situation over. Another little nudge is what she needed. The reply she got to her pages and pages of anger and sadness was: “thanks for the good times, but can you keep this a secret between us, I don’t want to ruin my chances with anyone else” she’s flush with anger now, just seething, she gathered her keys and headed out the door without even saying goodbye...\n\nI knew where she was going. \n\nI booted up her laptop and set it to reformat, deleting her dissertation and any notes pertaining to it before following her to campus, I parked a few lots over and rush over to his office where i find her screaming at him for giving her herpes. There’s lots of people there. Professors, aids, students, other faculty. I’m dying. He is beyond embarrassed and confused as fuck, she is ugly crying in front of her peers, I’m in heaven. I didn’t even care that people were going to think I had herpes too. \n\nThe fallout was apocalyptic in their department.\n\nHe lost his job due to code of conduct at the university, we got divorced the following year (state law was we had to be separated for one full year before being granted a divorce) I got to keep most of the assets (primarily savings, and not a ton, but I worked for it). She never finished her doctorate and went on to be a perpetually pregnant housewife that sells herbalife on Facebook and he teaches high school now. It took a few years for it all to unfold, but watching it was glorious. \n\n\n\nTL;DR: wife cheated, so I made her think she had herpes and engineered a social situation for her to out her affair publicly herself.\n\nEdit: a few of you are asking for a recipe for the goodies so here you go: \n\nFollow the directions for use or it’s kind of a waste, and this is totally geared towards the ladies. We’re talking big fucking Os. Use polyurethane condoms! It breaks down latex. \n\nWeed lube:\n\n1/4 ounce flower or 1 gram CO2 extracted live resin (preferred)\n\n4 oz MCT coconut oil \n\n2 16 oz mason jars \n\n3 coffee filters (only if flower is used)\n\n2 drops tea tree oil - it really makes a difference \n\n30 leaves poison ivy*\n\nSmall spray bottles- think perfume. \n\nPut oils and wax or flower in mason jar A and heat in oven for 80 minutes at 240 degrees, turn oven off and allow it to cool for about an hour. Strain through coffee filters if you used flower into the second mason jar and then fill the spray bottles. Here’s the instructions and description my current amazing wife wrote for a friend wanting to try it:\n\nAt first you can feel the warmth building up. Everything feels more intense to the touch. The waiting between application and play time is a wonderful mystery. As time progresses the butterflies in the pit of your stomach become more active, while feeling self awareness as the sensations and sensitivity increase. Walking become part of foreplay, the action causes more friction and heat to build up. As your spouse begins touching at your neck and shoulders the warmth rises up your body sending chills down your spine. Each touch becomes more euphoric than the last until foreplay is done...from there enjoy complete euphoria in your partners embrace. \n\nApplication: 8-10 total sprays. Use 2-3 on your fingers at a time. \nSelf application- spray on fingers and massage around the clitoris and labia down toward your opening working the oil inward towards your g-spot. \n\nTo help with cramps- spray on tampon, insert, go. Without tampon. Get .5 ml in a syringe, insert, spray and stay with hips lifted for 1-2 minutes. \n\nWith spouse- Have your spouse apply the spray to their fingers, gently spreading it over the clitoris, labia, pushing some into your cookie. Think of it like painting, the better the coverage, the better it will feel. Be sure to apply to your G-spot, it’s about 2 inches in on the front wall of your vagina, for an added plus, apply to the O-spot, which is directly across from the G-spot on the back wall of the vagina. Application shouldn’t take more than 3-5 minutes, then don’t even touch it for at LEAST 20 minutes. Spend this time exploring other areas of your lovely treasure. \n\nDon’t use if overly intoxicated, you’ll simply waste it. \n\n*poison ivy optional, not recommended for self use",
        "score": 10233,
        "id": "bs9xf7",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/bs9xf7/wife_cheated_so_i_tricked_her_into_publicly/",
        "created_utc": 1558654811.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Found my girlfriend cheating on me with my close friend, I have him arrested and ghosted her",
        "selftext": "So I am a long time redditer and decided to tell you all a story that has only just come to it’s final conclusion. I have created a secondary reddit account specifically for this, as I want to protect those that are not a part of the reddit community and changed the names of all involved. Originally posted to r/prorevenge, but was asked to post it here instead due to the nature of one of the revenge acts. Apologies of there is any spelling or grammar mistakes. TL:DR will be at the bottom but hold onto your hats, this is going to be a long one.\n\n**Backstory** (incoming sadness)\n\nMy wife Rachel and I grew up in a largish town of close to 30,000 people.  We knew each other at an early age (roughly 6 or 7, can’t specifically remember). We were practically inseparable. At 16, we started dating each other. When we turned 18, we moved away for work in a city just a few hours drive away. By 20, we were married and had bought our first house. At 22, we discovered that she was pregnant with a boy. It was then disaster struck\n\nAbout 5 weeks before she was due to go on maternity leave, a large shelving unit collapsed and crushed her. I was told that both her and our child were killed instantly. Two of her colleagues had also been injured in the accident, one left paralyzed, the other loosing his leg after it had to be amputated. The company she was working for, had in a cost cutting measure, decided to continue using old shelving that had been written off as unsafe instead of replacing it. I still haven’t quiet forgiven those executives and management personnel that made that decision, because they cut short the love of my life as well as killing our unborn child.\n\nIt wasn’t long after I was told I had a ‘choice’ on how to proceed with what her company called “compensation”, but I called it blood money. They wanted to settle out of court to avoid a lawsuit. I, on the other hand, was out for their blood. \\[Just to clarify here, this is not the revenge, this is still backstory\\]. Fortunately, due to the coverage that it got, and involving several politicians, the case was settled quickly in court (roughly 3 years) in which the payout for all parties was close to 10 times the amount that they had initially offered. A lot of fines were given to them for breaches on work, health and safety, executives were sacked, others were jailed, etc. \\[A story for another time maybe, when I feel comfortable sharing.\\]\n\nIn this time, I was still working my job in telecommunications. My mother, bless her soul, had moved in while all this was happening to help me. I think I would have fallen apart if she hadn’t been as involved as she was. It was around this time, I was offered a promotion, but it involved a lot of travel around the state. I made a request to have an office in my home towns branch, as I wanted to not only take care of businesses in the state, but in my home town also as there was no business representative located there to which they agreed. After a few months, we settled into a routine of one to two weeks in the city office, one week in my hometown and one to two weeks visiting the rest of the state. After a year, I decided to buy a house in my hometown, so I wasn’t having to stay at my parent’s place every week or so that I was home and that I could come and go as I pleased. This is important for later in the story.\n\nIt is about 4 years later that our story begins.  (Sorry if the backstory was a bit long)\n\nI had just returned from one of my trips on Friday, and was checking in some stuff at my office when Harry, the branch’s managing director, walked in. We had grown up together also, but had gone to different schools but since coming back had developed a very close friendship. He asked how things were, and then asked me if I wanted to come to a house party that he was having that evening. Short notice and all, but I said yes. I felt like a few drinks with friends were in order. It was there that Harry introduced me to Katherine. She was a new hire at the branch where my hometowns office was located and was getting to know everyone being new in town. We hit it off immediately. As much of a cliché as it sounds, it was almost as if Rachel was in front of me, instead of Katherine.\n\nI won’t bore you too much with the details, but after 2 years of dating, we decided to take the next step and she moved into my hometowns house. Everything up to this point had been going really well. Katherine and my parent’s got along and Rachel’s parents also approved and were happy that someone could make me just as happy as Rachel had done. All was going well for close to a year when things began to change. Skype sessions were cut short suddenly, neighbours would tell me about how a car, described to me like it was Harry’s, was always seen parked in the back alley near my house whenever I was away, some clothes that weren’t mine were in my wardrobe. All signs pointed to her cheating, but she said that nothing was happening. She said that Harry would come over occasionally to discuss business, etc, but never stayed the night. I chalked it up to me being paranoid and continued on as if nothing was wrong, but there was always this feeling that something wasn’t right.\n\nIt was close to 6 months after that I discovered that she had been lying to me. I had just finished closing a rather large contract with a new company and negotiations had wrapped up earlier than I had anticipated. So instead of sticking around for the next few days, I decided to pay for an early flight home and surprise everyone. Fast forward a few hours and I drive into my hometown and down the alley behind my house so that I could get into the house without being seen and surprise Katherine. Some part of me was curious however as to whether this mystery car was there.\n\nSure enough, there was a car that was blocking the back entrance gate. I was confused for a moment wondering if it had just been a neglectful neighbor parking only to realize that it was indeed Harry’s car. If it hadn’t been for the high hedge line that I had put in a few years back for privacy, I may have well driven past my own place. Pulling up behind his car, I got out and thought it was strange that he was there so late. As she claimed that he always had left by now. As I approached the back of the house I saw something that stomach drop. In my kitchen, Katherine and Harry were going at it hammer and tong. I froze. Time stopped. There was my close friend, having sex on my kitchen bench with my girlfriend.\n\nI didn’t know what to do. So many questions where running through my head. Was this real or was I dreaming? Why were they having sex in my house? Feeling defeated, I turned and left without them seeing me. I sat in my car for what felt like an eternity. I was crying. Hard. But the sadness quickly turned into anger. The same kind of anger I felt towards those that were responsible for Rachel’s death. I wanted to hurt them. Badly. As a pacifist, I don’t believe in violence. It was then I knew I was going to punish them and destroy their lives. And what better time to start than now.\n\nI moved my car back up the alley, far enough away from my driveway that I could still see Harry’s car, and then walked back to the gate where I could see into the house, and called her phone. They were still going for it when it rang. They both looked at the Caller ID and did a double take when my name came up. I could see that she was considering answering it and they let it ring out. After a few moments they were back into it again and I dialed once again. This time she did answered. As she was answering I hung up and made my way back to my car. As soon as I did, she called me back. She asked why I was calling as late as I was, and I told her that I was about 10 minutes from home and didn’t want to scare her coming in. She, obviously, was shocked and acted happy that I was coming and the call ended very quickly after she said she was going to get up and get changed into something. I said bye and hung up.\n\nA few moments later, Harry came peeling through the gate and still half naked, jumped into his car took off like a bat out of hell. I smiled a little, knowing the fear that both of them would be feeling from being so close to being caught. I waited a few moments before turning my car into the same place Harry had been moments earlier. The night was fairly uneventful afterwards and It wasn’t until after she was asleep, that I got up and went to my office down the hall. I couldn’t sleep. I needed to plan. And plan I did.\n\n**The Revenge**\n\nMy mother always taught me to be a pacifist and to allow cosmic karma to take its course. But on this occasion, I decided that karma could use a helping hand. I decided to punish them separately but destroy both of them. I knew that Harry had a drug habit. Nothing major, but he kept it very private. I only knew about it accidently after seeing some coke and weed left out in his place but pretended I hadn’t seen it when he had made attempts to cover it up. I began calling some of my more unsavoury clientele and made a few discreet enquiries into obtaining some samples that they were willing to part with. A few days later, I had a decent enough stash for my plan to work. About a month later, I had friends, including Harry around for a barbeque night. After making sure that I sufficiently liquored up Harry, I told him to stay the night and sleep it off.\n\nIn the early hours of that morning, I took the drugs, and an assortment of my personal belongings, and placed them at various places around his car, with the biggest stash in his tyre well. Confident that he wouldn’t find them over the few months as the rest of my plan took affect, I locked the car up and went inside to sleep. I also placed some more drugs and personal items in his house after driving him home because he was still to drunk to drive. A few days later, I staged a break in, by smashing the back pane of my back door into my kitchen and leaving it open before heading back to the city for a flight. I had several messages the moment I landed. One from my clearly panicked mum, who had found the back door smashed open and had called the police, one from Katherine in tears, and one from the local police asking me to call. After returning all the calls, I informed the police I was away on business, and that I would be back the following week to talk with them.\n\nWhile away, I got Katherine to stay with my parents until after I got back, and asked my Dad to organize one of the local security companies to install cameras and an alarm system after getting the go ahead from the police as to not ruin the scene of the crime. After getting home, I did the usual ‘my God I can’t believe this has happened’ and ‘why would anyone do this?’ routine. After doing a thorough check of everywhere, ‘finding’ that the items I had taken were ‘missing’ and filing a police report, I had the security companies rep talk Katherine and I through how the cameras and alarm system worked.\n\nThen came the question I had been waiting for. The question of what happens if we are doing some business and don’t want it recorded. She acted a bit shy asking this question. But I knew exactly the reason she was asking. He assured us that this was a question he got asked a lot, and we were shown on the home computer, if we wanted to be doing things without it being recorded, how to stop the recording for certain camera’s, so that we could protect her modesty. As I was walking him out, I asked him if camera’s were turned off, could a notification be sent out, just as a security precaution. He came back in and helped me through how to set up email notifications and left shortly after. Fantastic. All I had to do was wait.\n\nAt this stage, I approached r/legaladvice for some help in relation to couples law in my country. I needed to make sure that my upcoming plan could legally be done and that I would not be forced to pay out any money or equity to Katherine as I didn’t know if we were classified as a De Facto couple or not. Being the sole benefactor of Rachel’s estate, I didn’t want to be left with any nasty surprises where Katherine could take any of the estate away from me. Shout out to those guys and gals there as they helped me get in contact with a great lawyer who assured me, due to the fact that although we had been dating for close to 4 years, we had not been living together long enough to be classified as De Facto, and because I was paying all the utilities on the property that she was living in and didn’t pay rent, showed that she had no legal standing to make a financial claim against me. Just to be sure though, he drew up what I felt was a pretty ironclad document just in case there was any legal trouble.\n\nThe following week, my work had approached me, and offered me a promotion to move back to the city and run the team that I was a part of, meaning I wouldn’t need to travel as often and be in the one location and due to the success of being located in my hometown, that they were considering having 3 to 5 representatives spend one to two weeks in the larger surrounding towns including my hometown as a part of my team. I said yes, and began the process of beginning my transfer, which would take about 6 weeks. Perfect. More than enough time to gather all my evidence.\n\nUpon getting back to my hometown the following week, I began to start in motion the rest of my plan. I asked Harry to approve one weeks worth of vacation for Katherine for two weeks time. I wanted to send her and a friend or two away on a retreat before I made the biggest decision of my life for a second time. He jumped up and gave me a huge hug, congratulating me on being prepared to take the leap again. I hugged him back tight, but not the way I think he imagined it at the time. He agreed and blocked out the week for me. I asked him not to say anything to anyone, as I wanted to make it as big a surprise as I could. I knew, that it would spread like wildfire around the office regardless, but that was my plan.\n\nThat night, I told Katherine that I had booked her and two friends to go to a tropical spa resort, all expenses paid for a week. No questions asked, pick two friends, and come back to the biggest surprise of her life. She screamed like a kid who had just been told that all the candy in the shop was hers to have.\n\nI then told her that the following week, I was going to spend it in the city, preparing for a large client who was one of my biggest accounts, and needed some people in my team to help before flying out the following week and I wouldn’t be home until the Monday that she was leaving, so I wouldn’t be able to see her, which seemed to disappoint her, but I told her it would be worth it when she returned. What I failed to tell her, was that I had decided to take 2 weeks vacation on the other side of the country, mentally preparing myself for the shit storm that was about to erupt the moment she stepped foot on the plane as well as enjoying my first stage of freedom.\n\nOn Sunday two weeks later, I flew back and began driving home. Once getting there I done a quick pass by my house and sure enough, Harry’s car was there. Like the first night I had caught them, I parked a little way’s back, and checked the cameras. Asleep, in my bed. No surprise honestly as I had recorded them constantly do this over the 2 weeks I had been away. I then made my first call to the police blocking my caller id. I told them that I was one of my neighbours and saw someone hanging around in their car in the alley behind my house and occasionally passing something through windows to passing cars while also looking into my yard and I was concerned that they were dealing drugs and or going to break into someone’s property.  I gave them his license plate and description. They said they would have someone there in a few minutes so I thanked them and hung up.\n\nI then called Katherine and told her I was about 10 minutes from home, and that I knew she was flying out tomorrow, but desperately wanted to surprise her. Looking back at the footage now, I laugh at the commotion that I am surprised I didn’t hear. In a few short seconds, Harry was half dressed and flying out the back door to his car. At that point, I couldn’t have asked for a more perfect scene. As Harry was peeling away, one of the police cars rounded the corner behind me, saw Harry driving away fast, and gave chase.\n\nAfter pulling in, greeting an excited Katherine, and doing all the couple things, she fell asleep again. I, on the other hand, couldn’t sleep a wink. The next day, her and her friends were bundled into a car. After they drove away, I had to wait a few hours, but I began to execute my plan. I called my friend who was a removalist, and apologized for the late notice but needed my place packed and moved on Friday. After agreeing on a time I told him that he would need to take certain boxes to a storage facility, which he said wasn’t and issue. Then I began packing Katherine’s belongings.\n\nLater that day, I got a call from the police for me to come and identify some property that they had apprehended from a suspect the previous night that fit the description of property I had reported stolen. I grinned to myself, happy that my plan for Harry had grown to fruition and replied that I would be there shortly to collect it. Of course, when I got there, some of the items where still unaccounted for, due to the fact that they must have still been in his house and they hadn’t searched there yet. By this stage, the town was buzzing with news. Events in my hometown don’t stay secret for long. Harry was disgraced and promptly fired for his possession of drugs and stolen property, and our respective bosses on behalf of the company had extended a formal apology towards me during the week.\n\nThat night I went to my parents house and told both mine and Rachel’s parents what had happened, omitting certain details, and that I was moving back to the city after being promoted, but Katherine wouldn’t be a part of it. They were pretty upset initially that I hadn’t let them know what was going on, but were happy that I was handling everything maturely and hadn’t sunk to their level, thought they didn’t agree with ghosting Katherine. But after some drinks, laughs and tears, I went home.\n\nOn Friday afternoon, after a busy week of organizing cleaners for the following week, the real estate to put my house on the rental market, and various other tasks at my hometowns office, I packed some things into my car, and drove to my parents place and said goodbye before the drive. Before leaving, I went to Becky’s house. Becky had been one of Rachel’s closest friends growing up. She was the only other person who knew that knew what was happening, minus the details about Harry. Without her help, I wouldn’t have been able to organize everything as quickly as I had. I gave Becky a large manila folder with my gathered evidence of her cheating, as well as the letter and a few other legal documents from my attorney stating that she was ordered not to contact me, and the details of how to access her belongings located at the storage unit I had rented out. After a quick goodbye, I left and drove back to the city.\n\nOn Sunday, I woke up to several missed calls, voice messages and text messages. Turns out, Katherine had come home early after being alerted to something being afoot in town, only to find an empty house and a for rent sign out the front. Freaking out, she had gone to my parent’s, who closed the door on her the moment that they answered, forcing her to call everyone until she managed to somehow be contacted by Becky and told that she had a package for her. I was told that she didn’t take to well to that, as I fully well knew at that point from the numerous angry texts and voice messages from her accusing me of setting up Harry, of being deceitful, etc. I was worried that she might show up at my front door, but nothing ever happened.\n\nFive weeks later after leaving and been promoted, I write this out for you dear reader. Granted its long, and it took a few rewrites to shorten it down from my initial 14 pages (double what this story is now), but I feel that most of what I said was important enough for the story.\n\nTL:DR, After my pregnant wife was killed in a workplace accident, I moved to back to my hometown and connected with a woman who after moving in with me, cheated on me with a close friend. I set him up to take the fall for drug possession and after sending her away on a spa retreat, rented out my house and left town for a promotion while exposing her as a cheater.\n\nEdit: Obligatory thank you and holy cow this blew up. Thanks for gilding this account even though it is a throw away account that I have no intention of using in the future. I am still at work at the moment and will after I finish answer as many questions as I can, and provide any other updates that come my way.\n\nEdit 2: So am home now, and with the number of questions that are here, as well as other comments and messages I have received, I decided to take the time to answer questions and provide some clarity here save responding to everyone. \n\nSo one of the questions I keep getting asked it what happened to Harry, why I was so hard coming down on him and why I would incriminate myself, especially on the Internet. After making some enquiries back home to some friends, the short answer is, Harry is looking at a few months in prison as it's his first offence but could be out sooner, and I felt that it was necessary to the story. No one other than myself knew what I had planned to do with Harry, which is why I omitted quiet a few crucial details that had the potential to truly identify me, as well as change up some of the descriptive language about locations to potentially put this story anywhere in the world. Just for clarification, there was already more than enough evidence in his own home, I just provided the means for the police to further investigate his activity in his home. That being said, I don't regret doing what I did to him, as he knew both Rachel and I growing up, and knew how hard it was for me to pick up my life after she died.\n\nFor those also asking if I am worried about Harry finding out and pointing the authorities in my direction, I know that he doesn't use reddit. I know Katherine has an account, but I haven't seen any recent activity to state that she has been on in some time. As for other reddit users, who knows. Most of the people I am friends with on my main account may recognise this story if they come across it, but as for their browsing preferences outside the subreddits that we frequent on, I can't say.\n\nAs for Katherine, people have questioned why I didn't do more to her, or why I stuck around for as long as I did. Honestly, I almost did kick her out after a few days, but I wanted to gather evidence and show proof of her cheating so that everyone she knew would know what she had done. She is a major 'socialite' (her words), and I knew by exposing her it would kill her reputation. As for what happened to her, I have been told that she moved to another state just recently after being transferred. From the people I have spoken to today, she was put mainly on administrative duties before her transfer, as there was quite a bit of backlash after the rumour mill made it's way around town.\n\nPeople have questioned the legality of what I did to her, moving all her stuff out, sending her and some friends away, spending a good amount on the trip, etc. Morally, I can see that it's a pretty dick move to build up her expectations of what she thought was going to happen. This, combined with killing her status around town, was my ultimate goal, to have her experience what it was like to have everything fall around you. But, from a legal stand point, I had every right. In the time she had been living with me, she had never updated any of her personal information (driver's licence, voting registration, etc) to reflect that she had moved into my house. I found out this information during the course of my preparation with my lawyer after I spoke to r/legal. With no concrete proof on paper to show that she was residing there, and because we hadn't met the De Facto status, I was able to do what I did with no threat of backlash.\n\nFinally for those of you saying how my story is fake, that I am a karma whore, a sociopath (in this day and age, who doesn't have some sociopathic tendencies), and pointing to my malicious compliance story also as proof, I will be honest and let you know, that I will not try to change your minds on this. Everyone is entitled to their opinions on stories shared all over reddit and opinions on those who share them. The story on the other subreddit however was to build karma, as my original post on r/pro required to me build up enough before they would allow me to post as they thought that I might have been a bot. That story, which I only edited in the basics of the conversation because I can't remember all of it, did in fact take place and made national news coverage shortly after. If I ever find the article, I will link it as it was or was at the time close to one of the largest roaming bills our company had ever passed on to a customer.\n\nIf there are any further updates, I will let you know.\n\nCeol",
        "score": 9616,
        "id": "cbfgav",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/cbfgav/found_my_girlfriend_cheating_on_me_with_my_close/",
        "created_utc": 1562757576.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "I wanted my father to understand I wasn’t coming.",
        "selftext": "This is my first time posting. Sorry for the formatting. \n\nMy parents divorced when I was in first grade. Not only did my dad disappear like Houdini. He stole my mothers atm card to her personal account and drained her dry. My mother being the saint she is didn’t even bat an eye. She still was cordial to him and never said a negative word about him. To me, my dad, albeit abandoning us was still my hero. \n\nFrom first through fifth grade I had the usual abandoned by dad stories. Maybe one or two visits in a year and a fifty times of me waiting by the front window with my suitcase packed to go to his house and him never showing up. My mom through all of this was supportive and never said an ill word about him. So he still stayed my hero. \n\nWhen I was in sixth grade my mother finally remarried and my father who only had a picture of me at 8 months old in his wallet went ballistic. Did I mention he never paid child support? He would use his fathers social (they had the same name) to get away with it. After my mom remarried, he let it be known that I was now my stepdads responsibility. He cut off communication with me until I graduated highschool. \n \nHe didn’t attend my graduation or send a card, what he did do was write me an email thanking God he no longer had to pay child support (he didn’t anyway). What really broke me was his ruthless and brutal attack on my mother. Attacking her weight, looks, teeth, and blaming any perceived negative traits that I had, on her. For the first time I realized what an cowardly piece of shit he was. I responded in kind. He told me I was no child of his and that I was a waste. After that I vowed that I would hurt him. \n\nTen years later, my father, not interested in my wedding or my son reached out to me. You see he is a diabetic, and one of his organs were failing and he didn’t have long. He’s to far down on the list and he needed someone in our family to donate. \n\nNuclear Revenge Activated\n\nI answered his email. I met up with him and pretended that I didn’t hate his guts. I went and got tested to see if I was a match. I was. Did the therapy and met with doctors and his therapist. We scheduled the surgery. They day of the surgery we meet at the hospital. I smiled in his face and let him know that I wouldn’t be going through  with the surgery. I watched the confusion line his face. “I just wanted you know that you’re no father to me and you’re a waste.” I left the hospital and drive home. \n\nMy mom was pretty annoyed with me that I took it that far. My father is dying and I will be attending the funeral out of spite. And I will let everyone know what a piece of shit he was. \n\nTLDR: father abandoned me and called me a waste. Later in life he needs an organ. I agree and match with him and abandon him at the hospital the day of the surgery after calling him a waste. He will die and I will ruin his funeral. \n\nEdit 1: this really blew up. For those questioning my actions I will give further detail. My father was/is semi obsessed with my mother. His attachment to us was only in his perceived ability to get back with my mother. In the beginning he would call and make plans to see us. And just not show up. My mom would have to make up excuses. He has been married over four times and supports and loves his step kids without a thought to us. Once my mother remarried he was done with us.  He kept in contact with my mother through email but had no interest in talking to his children. \n\nI have reached out to him before. To invite him to my graduation, to let him know of my marriage, and that he was a grandfather. All I got back was pictures of his new wife’s kiddos. \n\nUpon getting to know him after agreeing to donate. I went to one of his therapy sessions at his request. There I heard the story of the true reason he contacted me. I listened as he lamented about his impending death. How he was resigned to his fate. only to have his new wife remind him of his former kids and maybe one of them will donate. And he got excited because he had forgotten all about us. And it was like hope renewed. \n\nDo you know how shitty it is to listen to the person who is responsible for your very existence talk about forgetting your very existence. Like I was a pair or sturdy old boots that gathered dust in the back of the hall closet. Now rediscovered I was to be worn to go shovel shit. I knew then I wasn’t going to give him anything. \n\nThanks for the silver and gold\n\nEdit 2: I’m not worried about a will or being left anything. He had nothing to leave. He’s the male equivalent of a gold digger. He only marries women who can take care and support him as he mooches off of them. He stole thousands from my mother and she didn’t press charges because she didn’t want her children’s father in jail. My mother was his first wife and he learned his lesson not to have kids of his own but to move into ready made families. His ex wives and their children have nothing nice to say about him. \n\nWhen I told him I wasn’t going through with it. He understood exactly why. He nodded his head in understanding. I already was approached for money to contribute to the funeral and i will.",
        "score": 8972,
        "id": "axs30k",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/axs30k/i_wanted_my_father_to_understand_i_wasnt_coming/",
        "created_utc": 1551830165.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "You demanded my entire team be at the office for the 4th of July. Fine, enjoy paying for the office party.",
        "selftext": "So this starts on Monday, the 13th, as I receive an email from a VP not over my department, or Bad VP. I am told  that my team will be required on the 4th. I politely tell them no that our team has been scheduled this day off and people already have plans. \n\nMy team is the IT team and, as many of you know IT team gets shafted every time it can get shafted by any company. \n\nSo over the course of the week I let my team know what is happening. I let them know I have been reaching out to higher ups to fix it. I also tell them that if their plans are ruined, I will make it right at work. \n\nOver the course of 3 meetings, it start to look like things will not go my way. In response I send an email to the CEO of the company. All of my higher ups know I was going to do this and said I should do this as he is very family oriented and that he would not allow ANYONE to work on a national holiday. \n\nWell he is on vacation in the Bahamas until the 6th.  But his assistant informed me he would look at this after he gets back. *Repeatedly slams head into desk.* So I tell everyone that it will be work from home, and that we will be setting my cell phone as priority in the call routing. Meaning I would get most of the calls. To be honest, I was expecting almost zero calls.  Especially since I was asked to send out a notification that IT support would cover the 4th of July. I never sent that email out.\n\nA day later I was given another outrage. I was told in an email that my employees would be required to be at the office, and no one was allowed to work from home. They would be checking the door badge ins to verify we were at the office. I asked why in an email, and they said that they wanted to make sure no one was playing video games at work. We normally work from home about 2/3rd of the week and video game playing is a normal occurrence at work.\n\nSo I walked into the person’s office. After a very long conversation where she was losing the logic war with me, she told me that “Its just IT, you guys don’t have lives.” No I am not kidding you, this is exactly what they told me. I reported this to my VP who said. “I will take care of this. It likely wont be until after the 4th, so get creative.” I know this man well. We have worked together a long time and “Get creative” is code for corporate fuckery. \n\nI asked the person requiring us to be at the office if they cared if we had an office party. They said no, as long as it did not interfere with the call flow. Even suggested using my new company card to pay for it. “Go wild.” Pro-tip, never tell me go wild. \n\nAt this point, it was Tuesday the 21st. I let everyone know what’s up, but that I have something planned. I asked who had things planned for that day. Two people told me they were planning to shoot off fireworks with their family, but the rest were planning BBQs with friends. \n\nI write up an email to the VP over my department and the Bad VP. I tell them all that I let everyone know. We all were expected to work until 8PM Monday. Per the conversation with the bad VP I will be having an office party as a sort of sorry to the guys and gals who got shafted by this decision. \n\nThe bad VP replied again. “Thank you for your understanding. Also yes I would expect an office party if I had to work on the 4th of July as well. So go wild and enjoy your time. Use your new company credit card if you need to cover a few expenses. Also I should not have to remind you or anyone else. No fireworks or alcohol on company property.”\n\nSo now it is time to tell you about my office. See a while back, the IT team was moved from the main corp office and into a smaller building by itself. It has a nice gaming break room, a decent sized gym, and a full on drink bar. Soft drinks mind you, no alcohol at work. Out back is a big patio that crosses county lines as soon as you cross a small creek. A creek that just so happens to have a foot bridge over it, leading to an empty field.   \n\nI start making phone calls.\n\nMonday, June the 25th  \n\nI call up everyone into an hour early meeting that morning. I explain to them all that I will be making it right. I asked everyone to invite their friends and family to the office. No supplies will need to be brought by anyone. I tell them all that this will be non-alcoholic, but that I will be planning something for everyone. I told them to expect all food to be provided and they don’t need to bring anything, unless they want to bring some fireworks. IE they wont have to spend a dime. \n\nThe 4th comes and the entire day, we did absolutely no work. No tickets, no calls came in. Well 7 calls did come in, but from the same person. The Bad VP. She was calling to make sure we were manning the phones. All of us were playing video games or watching movies. 6PM rolls around and everyone was told that the food was ready. \n\nPeople were expecting hot dogs, hamburgers, maybe a bratwurst or two. What they got was a full on BBQ feast with pizza and other foods. There was smoked brisket, spare ribs, smoked sausage, smoked turkey, both kinds of tater salad, cole slaw, green beans with bacon and onion, potatos au gratin, pizza from 2 different places, excellent hamburgers, and bratwurst hot dogs. On the deserts side was cake, very good cookies, 4 different kinds of pies, and about 2 pounds of fudge. \n\nFamilies, and friends started showing up at around 6-6:15ish. Some brought alcohol but I told them they would need to leave that in their cars as I was not THAT crazy. Some were not too happy about that but agreed as it was a free dinner for random strangers. \n\nSO let me set the scene for you. I am out there with all calls routed to my cell phone,  and everyone just having a good time. We have a TON of people there just enjoying the fun night, chatting about random stuff, eating the food, and occasionally lighting off some sparklers or throwing firecrackers into the stream. (Its not stocked and only 1 foot deep.)   \n\nMy VP, not the bad VP mind you, showed up with his family and brought some water balloons for the kids… and manchildren. \n\nAround 8:30ish its getting dark and people want to shoot off more than the simple sparklers and firecrackers we had been using. The VP over the IT dept had everyone cross the foot bridge, over county line and off company property mind you, and we set up a big wooden board using it as our launch pad. \n\nWe fired off what we had for an hour or two, and sort of just hang out for a little while. At around this time people were tired and ready to head home. I told people to take home leftovers, within reason.  We all clocked out at 8 and no one left until about 10:30. The bad VP did call once more while we were out back at the party. It was 7:50 and she called asking for a status update. My exact words were. “Well you were the only one to call us today. The rest of us are on the back patio enjoying the 4th of July shindig.” She simply acted like my boss and said “As long as no alcohol or fireworks are on company property, I do not care.”\n\nWe ate roughly half of the food catered. The rest was taken home. A small group volunteered to stay behind to clean up including my VP. We had a funny conversation about how this will make waves with the bosses. But he said he had my back and asked me how much this cost. I just gave him a sideways look which made him laugh. \n\nTuesday morning, I submitted the expense report to my VP. This email would inevitably make its way over to the bad VP and up the chain to the CIO of the company. It would be a bad idea to give out the exact cost of the party, mind you, but I can tell you that because of this 4th of July party, new rules were put into place. Any expenses of over 4k or more must be approved by the direct supervisor, VP over the department, and the full expense report must be sent to the financial department for review after the fact. \n\nHint, the party cost over 6k. \n\nThe BBQ was the most expensive part. I did not order from a low or mid tier place. The place I ordered from has consistently been on the top ten in the DFW listing for the last 30 years. I ate at that place so much I made friends with the owner. The BEST bbq I have ever had. \n\nThe pies and cakes were custom made by a bakery and the cookies were made by a boutique cookie place. I had 10 12 packs of coke, coke zero, Dp, DP Zero, Pepsi, and Pepsi zero. I bought 5 pepperoni, 5 sausage, 5 cheese, 2 hawaiian, and 3 cheeseburger pizzas from one place, and nearly the same number from another place. Excluding the cheeseburger ones I subbed out those for a different specialty pizza from the other place. \n\nThe burgers were from an excellent burger place that did catering. I know that owner well. He brought his kids for the night of fun after he heard what was going to be happening. He was also the one who brought the bratdogs as he recently added those to his menu. \n\nThis was the most expensive office party in the history of the company. The only things more expensive than this were some business meetings that the CEO rented private rooms in high end restaurants for. \n\nAs for the CEO, he was outraged. Not at the cost of the party mind you. He knew that the party would not have been necessary if people had been allowed to go home. He was outraged that IT was the only group required to work on that day. When I submitted the logs showing how we received no real phone calls, no service requests, and that we basically watched movies/played video games during our shift, he had heard enough. He apparently sent out a scathing email about work life balance and the importance of our holidays to every upper management.\n\nIt was kind of funny as people wanted me to get in trouble for what I did, but the reality is other departments have done similar things in the past just not on the scale that IT did. The Bad VP was admonished quite effectively and sent me an apology email. I forwarded it to the team with a strong hint to not reply. \n\nThen my VP let the CIO and the CEO know about what the Bad VP said. “You guys don’t have lives.” The bad VP did actually confirm she said it in a meeting with her EVP. It did not go over well. I have never heard people yelling in an office meeting like that before. The CEO of the company came to our office and YELLED at her. \n\nNot sure if she was fired, but she is not at work today. In Active Directory she does not have the down arrow of death, so not 100 percent what happened to her.  I know she lost whatever clout she had at this company with her attitude. \n\nIf anything more happens, I will update. But so far it looks like the fallout from this is I caused a new rule to be put in place about how much you are allowed to spend at one time. The Bad VP may or may not be let go/forced to resign. I know she got yelled at. Strangely there is now no longer any push back for my bid to get everyone back to working from home.\n\nEDIT: Please stop asking me where the restaurants are. Im not doxxing myself.",
        "score": 79699,
        "id": "vsuaqu",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vsuaqu/you_demanded_my_entire_team_be_at_the_office_for/",
        "created_utc": 1657125519.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Manager forces me to get a doctor's note despite it being illegal to do so. Doctor writes him the most passive aggressive note signing me off for 2 weeks instead of 2 days to teach him a lesson.",
        "selftext": "I posted this but it got removed and I think it was maybe because I didn't make the malicious compliance clear enough , so I'm going to try again and make it extra clear.\n\nWhen  I was in my early twenties, I worked at a supermarket. I should note  that I was a pretty reliable employee. I was never late, in fact, I  often got in early, and I rarely called in sick. At the time this  happened, I had not called in sick for 9 months, and even then, the  manager had sent me home.\n\nI had  been up all night, swinging between burning hot and freezing cold so I  was obviously feverish, and I had been throwing up 'at both ends' shall  we say. At one point at  about 2 am I was on the toilet, with my head in the sink, utterly miserable. I must have passed out  because the next thing I knew I was lifting my head off the sink and it  was 7 am. I was due to start work at 12 that day but that obviously  wasn't going to happen.\n\nSo I  called up the manager. Let's call the manager Steve. Steve was known for  being a real a-hole. He never believed anyone who called in sick  except his best buds (usually other managers, never lowly staff), but often called in sick himself (a lot of the time we knew it was because he was hungover and not actually sick). The conversation went as  follows:\n\nMe: Hey Steve, sorry, I can't come in. I'm sick.\n\nSteve: With what?\n\nMe: I don't know. I think it might be the flu. I've been up all night being sick, and I have a fever.\n\nSteve: Don't be stupid. If you had the flu you'd be completely knocked out. I need you in. Come in or you're fired.\n\nMe: I can't. I just told you I can't stop vomiting. I passed out.\n\nSteve: (growling angrily) Either come in or bring a doctors note, or you're fired!\n\nIn  the UK, you are legally allowed to self-certify for 5 days. This means  you can tell your employer you are sick and you do not need a doctors  note. If you're sick for more than 5 days, you then need a note. It is  also illegal to demand a doctors note during the self-certify period.\n\nI  knew this, but I was terrified. This was during the recession. I  couldn't afford to lose my job. So I got myself dressed. Almost passed  out trying to do so. Then trudged to the doctors some 25 minutes walk  away.\n\nI end up sitting in the  doctor's office for a little over an hour, which for walk-in was pretty  good. I get in to see the doctor and she is furious at me for coming in.  You're not supposed to come to the doctors when you have a cold or flue, and of  course I knew I should be able to self certify. She told me as such,  saying I shouldn't be here and should have stayed at home.\n\nI  then explained what had happened with Steve and how he had threatened  to fire me over this and I couldn't afford to lose my job - I was  struggling as it was. My doctor  turned her anger towards my manager. She asked if I got sick pay from the company, and I said yes.\n\n\"He wants a sick note does he,\" the doctor says. \"Okay. I'll give him a sick note.\n\nNow, my manager just wanted a note confirming I was sick, but instead my doctor wrote something along the lines of this:\n\n'\\[My Name\\]  has come to the surgery because \\[manager name\\] has insisted she come in,  in spite of the fact that this is illegal and all employees are allowed  to self certify.  Due to being forced to make this unnecessary and  highly dangerous trip when the patient is ill, has a fever of 39°C, and  almost passed out in the waiting room, I am signing \\[my name\\] off for  two full weeks to recover. Had \\[my name\\] been allowed to self certify as  is the law, they might only have needed a few days, but due to  straining themselves, they now require two full weeks. They are not to  be permitted to work until \\[date 2 weeks later\\]'\n\nThe doctor said she would have signed me off longer but this was the longest she could do without requiring further evidence. So basically, instead of just being off for a few days, I was now signed off for a full two weeks, and I'd be paid for it.\n\nI went to my place of work, at which point one of the duty managers  saw me and asked me what the heck I was doing here, go home, I was  obviously very unwell. I explained what happened. They agreed to help me  downstairs to Steve's office and went with me inside.\n\nI handed Steve the note. He looked worried and tried to say 'I wasn't being serious about firing you.'\n\nWell gee, when you angrily growled it down the phone it sure sounded like it.\n\nThe  duty manager then declared that they were going to drive me home. It  was clear Steve wanted to argue but had the sense to know he shouldn't.\n\nThe  duty manager then drove me home, made sure I was okay, then went back  to work where they informed our union rep of what had happened.\n\nSteve  had a disciplinary hearing where he was given a severe reprimand and a  warning. Steve tried to argue he never said I'd be fired and I was lying  and just decided to go to the doctors, but the duty manager said they  heard him admit to it when he said to me that he really didn't mean it.\n\nI  felt better after a few days, and enjoyed my two weeks off, fully paid,  and enjoyed the nice weather we had. Meanwhile, Steve was forced to  work overtime because we were short-staffed. So thanks to the doctor,  instead of being off for a few days, I ended up getting a nice two week  paid vacation, and Steve was given a final warning, all because he insisted I get a doctors note.\n\nTL;DR: Manager demands I get a doctor's note or I'm fired, so the doctor signs me off sick for two weeks instead of 2 days to teach him a lesson.\n\nEdit: To clarify the whole 'you're not supposed to come in when you are ill'. I should have been more specific - the rule is you're not supposed to come in when you have a cold or flu. The reason is there's nothing a doctor can really do except recommend you take over the counter cold and flu meds. So it is recommended that you do not come in if you have a cold or flu and instead take meds at home or pick some up at the pharmacy instead of risking infecting those waiting in the surgery. Even then, it's not a hard core rule, more a common courtesy asked of people. If you really want to, you absolutely can.",
        "score": 79051,
        "id": "owkndb",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/owkndb/manager_forces_me_to_get_a_doctors_note_despite/",
        "created_utc": 1627928961.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Neighbor tried to get my mom fined over our shed. So I got his $40K pool filled in.",
        "selftext": "I live with my mom. She’s quiet, keeps to herself, never bothers anyone. A few months ago, our new neighbor decided to report her to the city for having an “illegal shed” in the backyard.\n\nIt was total BS, the shed’s been there for years and has full permits. An inspector came out, checked everything, and left without saying a word.\n\nBut the neighbor? Smug. Proud. Thought he’d scared us.\n\nSo I did a little digging.\n\nTurns out his brand-new pool was way too close to the property line and illegally built over a utility easement.\n\nI reported him. Attached photos. Quoted city codes.\n\nTwo weeks later, the city ordered him to either move it (impossible) or fill it in. He lost the whole thing $40,000 down the drain. Literally.\n\nNow he gets to look at our completely legal shed every day… while standing over a pile of dirt where his pool used to be.\n\nMom sleeps great now.",
        "score": 8953,
        "id": "1k11dhg",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/1k11dhg/neighbor_tried_to_get_my_mom_fined_over_our_shed/",
        "created_utc": 1744854281.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "I Beat the Shit out of My Sister and Sent Her to the Hospital",
        "selftext": "I originally posted this story on another sub but was told it belongs here. \n\nI Beat the Shit Out of My Sister and Sent Her To the Hospital\n\nTrigger warning, this post talks about SA and r*ape. \nEnglish is not my first language so I apologize ahead of time. \n\nI 26m beat the shit out my sister (23f) for sexually harassing my boyfriend (25m) \n\nI can finally talk about this because all the legal proceedings have been delt with. So I’ve been dating my boyfriend “Mark” for about 5 years. He’s the BEST thing that has ever happened to me. He’s kind, smart, understanding and absolutely beautiful. \n\nWhen we started dating he was a bit closed off and was afraid to initiate any form of intimacy. I at first thought it was because I was his first relationship and maybe he was nervous. Six months into us dating he tells me that between the ages of 5 and 12 he was sexually assaulted and r*ped by his mother. His father left when he was around 4. It fucked him up in the head for a while and when it got out his mother was arrested and he and his two older sisters were put in the custody of their grandparents who they lived with ever since. \n\nHe was placed in intensive therapy and still goes to this day. He’s come a long way and has healed a lot but he still has some days when he gets really depressed and cries. Part of his therapy was exercising, so about two years ago he and I started doing some body building work outs. I toned up a lot, put 20 extra pounds of muscle on and he toned up a bit. \n\nBecause we’ve been dating for so long and have marriage in mind, he told my family (a less detailed version) and they welcomed him with  love and support. Now for my sister “Sally”. I’ve suspected she’s had a bit of a crush on him, she’ll flirt sometimes here and there but he never reciprocated and usually ignored her. I’ve talked to her about it so many times but she didn’t listen. \n\nTo make a long story short, I had gone out one Saturday afternoon with some friends to get some drinks and left Mark behind because he didn’t feel like going. My sister had texted me prior to ask if she could borrow a few things from me, a sweatshirt, DLSR camera, and a third thing that doesn’t come to mind at the moment.  I said sure and to get it whenever. She went when I was out, unknowingly. \n\nWhen I came home I found my boyfriend on the ground crying his eyes out and my sister trying to calm him down. He was having a panic attack. It’s never safe to touch him when he has an episode because he may act out violently due to his headspace. Her hands were all over him and he was trying to push her away. Her shirt was also on the ground and she was only in her bra. \n\nI tore her away and asked what the fuck she was doing. She said that she was trying on the sweatshirt when he walked in on her, freaked out and went into an episode. However, Mark through his tears said she tried to touch him. I asked my sister if it was true and she said no, but Mark again said she tried to touch him. We have cameras in the house and I pointed it out to my sister. Her face went whit and I don’t know what came over me but I saw red. I can’t remember much because I was so angry, but I beat the shit out of her. \n\nI can’t even remember if I was the one who called 911 or her though her beat up state. I do remember kind of snapping out of it because Mark was still going through his episode and I could him cry louder and I had to help him through it. It’s all a haze. \n\nI broke my sisters nose, gave her a black eye and bruised her ribs. She was in the hospital for a few days. \n\n\nUpdate: \n\nA lot of people messaged me to ask about context from my last post. \n\n 1: This all happened right before Covid hit, the end of 2019 and \n everything was just settled this last month. \n\n2: The incident happened in our kitchen, the front door leads down a hall directly to our open kitchen and to the right is our living room that leads to the bedrooms. \n\n3: We have cameras in every room but the bathrooms and bedrooms because we have a Great Dane named Butler (he’s black and has a white oval patch from his chest to his tummy, he looks like a butler) who likes to get into EVERYTHING so we set up cameras to keep an eye on him while we’re out. The cameras don’t have sound recording. \n\n4: My sister didn’t r*ape Mark but she did try to coarse him into sexual activities. \n\n5: My sister didn’t know I was out when she came over. \n\nI don’t have the recording anymore, it was too painful to keep let alone watch, also, my memory of the whole thing is hazy but the tape showed Mark answering the door. Again our cameras don’t have sound recording, but Mark said that when he answered the door she told him that she was there to get my camera and sweatshirt, he said okay and let her in. He was watching the television so he went back to his show while she walked into our room. She called out to him for help and the cameras showed Mark getting up to help her. I don’t remember how long they were in there but the tape showed Mark rush out of the room while holding his hands out as if trying to stop an attacker. My sister then emerged half naked while holding onto her shirt. Mark backed up into the kitchen still holding his hand out she advanced towards him. Mark said he was telling her to put her shirt on and to leave but she kept saying something along the lines of “Hey, it’s okay. I just need some help that’s all.“ and “You’re a nice guy, just help me out a little.” \n\nI think by that point he was declining into a panic attack as he started shaking, my sister took that opportunity to hug him (she said she did it to try and calm him down, but the tape showed her kind of grinding up on him) He pushed her away and fell to the ground crying and screaming. She then got down by him and was trying to wave her hands through his hair. Her other hand was also moving up towards his crotch. I remember from the tape seeing Mark flinch backwards and try to push her way. She always moved back closer to him. A few minutes later is when I got home and beat her to an inch of her life. \n\nI can’t remember who called the police but the police had showed up and my sister limped to the door well I was trying to help Mark calm down. I kind of remember them asking questions and trying to help Mark calm down. They thought he was going into shock so they put a blanket over him and the paramedics came. My sister was quickly evaluated and then brought to the hospital. Mark and I stayed behind because by that point he had started to regain control again. I remember my parents showing up and asking what it happened, I told them everything. My mom stayed with Mark and I while my dad drove to the hospital to see my sister. \n\nMark and I pressed charges on my sister, emotional trauma and Sexual  battery (Class A1 felony where I’m from) My sister tried to sue me (A misdemeanor charge) but it fell through. With the evidence we had my sister was sentenced to 60 days of incarceration with a bond of $5,000. No one paid. She also has to serve 200 hours of community service and her named was added to a s*x offender registry. She can appeal to the courts to have it removed after 10 years. She was also placed under a restraining order. On top of that my sister owes us $25,000.  I got a small slap on the wrist and have to do 50 hours of community service. Nothing too bad. \n\nMy sister was cut off some the entire family and still is. Mark regressed tremendously, to the point that he couldn’t sleep in the same bed as me for months. He was required to go into even more extensive therapy. He’s come a bit of ways, but nowhere like he was before it happened. It will take a long time for him to heal. \n\nI consider myself Bisexual but I lean more towards men while Mark is %100 gay. He finds the female body disturbing, to the point that we have had to skip over full female nudity scenes in movies.  My sister new of this. When I asked her why she would do this, she said that she thought she could change his mind. \n\nI’m not proud of what I did, but I’m also not sorry.",
        "score": 8917,
        "id": "t6ccbx",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/t6ccbx/i_beat_the_shit_out_of_my_sister_and_sent_her_to/",
        "created_utc": 1646374377.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "My boss LOVES to call me at 6:15 A.M. to ask me if I would LIKE to fill the shifts of the people who just called in sick.",
        "selftext": "This is an everyday thing.\n\nI was bored and frustrated, so I decided to volunteer at 3:30 a.m. to call this same manager to ask if they needed extra help. He got super-pissed and tried to write me up for it. I showed the GM the time stamps of the calls I had recieved.\n\nI dont get calls anymore.",
        "score": 77589,
        "id": "jgh4j0",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jgh4j0/my_boss_loves_to_call_me_at_615_am_to_ask_me_if_i/",
        "created_utc": 1603431642.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "A friend set up my Dad and he was nearly beaten to death - my grandfather got revenge on everyone involved.",
        "selftext": "TLDR: My Dad was nearly beaten to death and my grandfather went nuclear on everyone involved. \n\nThis isn't my story but it comes from my Dad and other family members who witnessed it.\n\nBackground\n\nThis all went down in the late 1970s when my Dad was 17. The area he grew up in was in the UK and was a stereotypical working class town. The part of town my family lived in was run down, full of poor families and had its fair share of crime - but it was close knit and everyone knew everyone (this will be important later)\n\nNow my Dad wasn't the most well behaved kid, and he had hated being at school, but aside from a speeding ticket he had never been in trouble with the police. He was (and still is) a really talented musician and had a very active social life.\n\nFor his 17th birthday one of his 'friends' had bought him a leather jacket with a very specific logo on it. We'll call this friend Dave for future reference. According to my Dad it was a rare and quite expensive motorcycle jacket - he was extremely happy that Dave had got it for him. Dave had bought himself the same jacket a while before and it was a big surprise. My grandmother apparently joked that with the jackets on they looked like twins and she wasn't far wrong - they had similar features, black hair and were both well known for being kitted out in motorcycle gear.\n\nA few days after my Dad's birthday, he was leaving work as a bartender in the town centre at around 10pm. As he was getting close to where his bike was parked, a gang of five men approached him from behind. The last thing my Dad remembers was being smacked over the head and passing out as he hit the floor. These men beat up my Dad with bike chains and a crowbar - literally to within an inch of his life. Luckily two bouncers from a nearby pub had heard the commotion and rushed to help - the men ran off, the bouncers called the cops and my Dad was taken to hospital.\n\nIt turned out that Dave had quite a substantial gambling habit and owed a large amount of money to people who you really didn't want to owe money to. They had threatened Dave and told him that they would be looking for him to teach him a lesson. So Dave decided to set up my Dad to take the beating instead of himself, or at least lessen his chances of taking it. He had bought my Dad the same jacket because these guys knew that was what he wore when he rode. He then arranged for a guy he knew to find out when my Dad left work and call up the loan sharks to let them know where 'Dave' was. What a scumbag.\n\nThe Revenge\n\nMy grandfather and grandmother were obviously distraught about this whole thing. The first thought on my grandfather's mind was if my Dad would survive - when that was answered his second was how best to get revenge.\n\nBit of background on my grandfather. He was a lifelong boxer and a career military man - he enlisted at the back end of WW2 at 17, stayed in the forces through Korea and then served in Malaya and Burma as a scout and sniper during the mid to late 1950s. He only reluctantly retired when my Dad was little and worked as an engineer after his discharge. This guy was a certified badass even into his 50s and although he wasn't the best husband or father at times he could never stand bye and watch his family get hurt.\n\nThe first move my grandfather made was to call up every ex-service buddy, bouncer, pub landlord etc that he knew and even a few less than legit characters he knew from the pubs. In my town word travelled fast, and my grandfather was well liked and had a bit of a reputation so it wasn't long before he had the names and addresses of the five men who had attacked my Dad. Apparently these guys had been bragging about beating up a defenceless man from behind. These guys were career criminals with violent reputations but my grandfather really didn't give a shit who or what they were.\n\nMy grandfather then called up a few of the most dangerous, hardened guys he knew from the service. He explained to them what had happened and they were all happy to help. One night, the group kicked in the doors of each thug and beat them to a pulp - all five of them. They knew that if they hit one, the others would hear about it and run so they hit all five of them in one night. My grandfather knew that no one would call the police in the area they lived in (talking to the cops was a big no no in that area back then) so there was little chance of being caught. \n\nAll five guys ended up bloodied with broken bones, shattered teeth, and the requirement to be fed from a tube by the end of the night. One of them had to be put into a medically induced coma. Of course, the police interviewed all of them in hospital when they sufficiently recovered but none of them talked - both out of fear of my grandfather and fear they would be labelled as rats - and nothing came of it. \n\nBut my grandfather wasn't done there. My grandfather used his connections in the clubs and bars to start spreading rumours about why they had been beaten up. Soon it had gotten round that these five guys had fucked up, and had beaten up the wrong person. Not only that, but they had bragged about it and lied to whoever they worked for about it. Not only were they physically broken, but my grandfather ruined their 'credibility' so that when they got out no one, criminal or otherwise, wanted to be associated with them. \n\nOnce this was all done my grandfather turned his attention to Dave. He had specifically left Dave for last, knowing that he would shit himself knowing that my grandfather knew what he had done. My grandfather, however, was much more subtle in dealing with Dave, as he thought that a simple beating would be too good for him. He waited and asked around, and it turned out that Dave was not only a compulsive gambler but also had recently turned into a heavy drug addict as well. \n\nMy grandfather found out who he was buying his drugs from, when he would usually buy and where. He had a buddy of his follow Dave when he went to buy his stuff, follow him to where he was living and let my grandfather know. My grandfather then called in an anonymous tip that there was a huge drug deal going on at the address and he thought he heard gunshots. He got two of his buddies to do the same - the police investigated, searched the house and caught Dave red handed with boatlaods of drugs in his home as well as counterfeit bills and a ton of other illegal stuff. \n\nDave was charged, denied bail and ended up pleading guilty to all the charges laid against him. My Dad could never remember his exact sentence but it was definitely heavy - at least 15 years. To add to that, Dave owed a lot of money to a lot of people and let's just say his time in prison was made much worse by this fact. My Dad never spoke to him again, his parents disowned him, his girlfriend dumped him, he struggled to get a job with his record and when he got out he had to move miles away as no one he knew wanted anything to do with him. \n\nMy Dad eventually recovered from his injuries, although you can still see various scars on his body from the beating he took. My grandfather never told anyone what he had done until my Dad asked him about it when he got really ill in the early 1990s. Dave's life was ruined and out of the five who attacked my Dad three ended up in prison later in life and two ended up dead due to crime. My grandfather passed away in the late 1990s and although my Dad and him had their issues it could never be said he didn't look out for him when he needed it.",
        "score": 8039,
        "id": "bom51e",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/bom51e/a_friend_set_up_my_dad_and_he_was_nearly_beaten/",
        "created_utc": 1557856181.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Guy takes advantage of my little sister's Disability, and I snap",
        "selftext": "**A quick preface**\n\n1. this all happened about a year back\n2. I will not be using real names because I could be in deep shit if I did (all actors in this story will have their names replaced with Jojo references)\n3. this is a long one\n\n**Context**\n\nMy little sister,  henceforth known as Holly, is mute (she can actually whisper a little but it takes a lot of effort on her part). she's been mute ever since she was five, when she lost her ability to speak in an accident. she's very smart, and she's a good looking kid. at the time of these events, she was 16, and I was 21. me and my sister live together in an apartment, because my mother is a roamer who isn't well suited to take care of a teenager. she has our twin kid siblings, but not my sister and I. my dad is distant from the family, so helping my sister through highschool falls to me. I work at a car parts shipping company, so I get paid just enough to get by. because of our relatively poor living situation and my sister's inability to speak, she gets bullied at school. generally it isn't much of a problem, but in the few months leading up to these events she was having increased problems with it.\n\n**Build up**\n\nat the time, Holly was 16, but she was a Sophomore in high school due to failing a year in middle school. (she refuses to take special ed courses, now because they didn't help her at all) Because she's good looking, and is older than most of her class, she gets attention from juniors and seniors. it's mostly negative attention, but there was one  guy, who I will refer to as DIO from now on (he's the villain of this story), who treats her really nicely. he's a senior and at this time is 18. he repels bullies from her, because he's a tall, handsome, tough guy, and bullies don't want to mess with him. I don't interfere with them because my sister is visibly happy when she comes home from school and whenever she's around him. (I didn't let them hang out alone together, but supervised them hanging out a few times) anyway, king crimson a few months, and she stops coming home happy. she isn't hanging out with him anymore either, and although I ask her multiple times, she won't tell me anything about it. I confront him about it, and he evades the topic. at this point I'm suspicious, but I don't know what to be suspicious of.\n\n**Researching**\n\nI'm getting more and more worried about Holly, so I go to her counselor and assistant principal to ask about her activities at school. from what I learn, she still spends all her free time near DIO at school. I find this strange, since she doesn't seem happy anymore. ***This is where the illegal stuff starts.*** a few days later, I invite Holly and DIO on a dinner night to Olive Garden (no one can resist Olive Garden). while we're there I do two things that are completely illegal. 1, I steal his phone (which I've seen the password to), and 2, I read his texts and Emails. anything I can to find out what's happened between them. I don't find what I'm looking for, but I do find out that he drinks and smokes weed with his friends on weekends. (this will be relevant later) a few days later I \"find\" his phone in the laundry, and say it must have ended up in one of our coats on accident. I know for a fact he got it back, because he called me to thank me for having Holly return it. I still didn't have what I was looking for, so I went back to the school, and used his previous texts as grounds to check CCTV for any suspicious activity. there wasn't anything suspicious by school standards, but there was something that caught my eye. it was my sister, going to the central bathroom in the school, and him going to the boys room of the same bathroom about a minute later. the bathrooms are separated by a wall, but there's a janitorial closet that opens into both bathrooms and is completely in the blind zone of anyone walking into the bathrooms, let alone the CCTV cameras. at this point, I began to suspect that something was happening between them in that bathroom. it was the only one with a closet like that, and if my memory served me, the closet didn't have a proper lock. it just locked from the outside on both sides.\n\n**Boiling point**\n\nnow that I suspected something, I confronted Holly about it. she broke down crying, and after 15 minutes of consoling, she shakily signed to me something that made my blood boil. apparently, it was far worse than I expected. I had thought they were going in there and doing drugs or something, since DIO was the kind of guy who would pull that kind of thing. as it turns out, according to Holly, he brought her in there one day, closed the doors, held her down, and raped her. he told her that he would know if she told anyone, and he would hurt her if she did. because she physically could not scream for help, or make any kind of loud noise for that matter, he got away with it. and the worst part is, he was threatening her into meeting him there every couple of days and doing that to her. I was LIVID. my first instinct was to call the police, but I realized that there was no evidence except the testimony of a mute girl. I wouldn't be satisfied with police intervention anyway. the first thing I did was call Holly in for a week from school. (\"family emergency\" can get them a week of excused absences easily) the next thing I did was find out where he lived. after that, I planned the most brutal revenge I could think of.\n\n**Highly Illegal Revenge**\n\nMy first step was to break into his house. It turns out his parents go out a lot, and he leaves to smoke and drink with his friends. I knew from reading his texts that there was a spare key on top of the porch light in the back yard. that Saturday, I scoped out the place, and waited for everyone to leave. I then began phase one of my revenge. I went in to his house through the back door, and found his room. I smashed his PC, stole his wallet, and pissed on his bed. then I poorly hid 2 small bags of weed in his house. (I have a friend who grows). finally, to hide the fact that it was targeted, I tossed up the rest of the house, but didn't take anything. I then went to a Starbucks and used the WIFI and DIOs Debit card (he didn't have credit) to purchase a bunch of sex toys in his name and send them to his house. I then left his wallet sitting near homeless man sleeping on a park bench.  next, I contacted his parents and told them I had seen their son drinking and smoking with a group of teenagers. they were furious, which leads me to believe that wasn't  the first time something like that had happened. Finally, I went to the back road he walked on his way home from his drinking parties, which i had found out in a text from one of his friends. I waited for 2 hours in some bushes for him to walk by, and then (wearing sunglasses and a hoodie) jumped him. I demanded his money and phone (although I knew he didn't have his wallet). I kept one hand in my hoodie pocket, pointing it like i had a gun, which he believed. he handed over his phone and ran away. I then finished up my plan by using his phone (which i still had the password to) to send an email to the school from his school email, confessing to raping my sister in the janitorial closet multiple times, as well as possessing drugs on school grounds and drinking alcohol when he was underage. then I snapped his phone on my knee and went home.\n\n**Aftermath**\n\nMy sister went back to school the following Monday, armed with a can of mace I bought her. DIO wasn't at school, and she was  called in by her counselor. she confessed, and he was charged with rape, underage drinking, and illegal drug possession. on top of that, his parents completely disowned him, and he was expelled from the school. sadly, this story doesn't have a completely happy end. this whole ordeal sent Holly into a downward spiral. her grades fell behind, and she barely smiled. in march of 2018, she attempted suicide by cutting herself, and it was pure luck that I found her in time. she's getting better now, but the emotional trauma will probably affect her for life. I pray to whatever cruel gods are out there that he gets a taste of his own medicine in prison.\n\n&#x200B;\n\nEDIT: HOLY SHIT This blew up! thanks for gold and silver everyone! my sister says thanks too.\n\nEDIT 2: My god, 3 silvers and a gold, 1.2k upvotes. I really appreciate everyone here.\n\nEDIT 3: PLATINUM OMG  THANK YOU\n\nLast EDIT: 2nd Highest of the month, 4th of ALL TIME you guys are all amazing and I thank you all for the support from the bottom of my heart.",
        "score": 8025,
        "id": "au60n6",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/au60n6/guy_takes_advantage_of_my_little_sisters/",
        "created_utc": 1550996508.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "You can't continue working from home because you go idle in chat too often",
        "selftext": "As part of the plan to return to office post covid, my company has done a lot of re-designating of who can permanently work from home, who can hybrid, etc. I really wanted to work from home full time. I hate the office with a burning passion - it's distracting, it's a long commute, there's no benefit to being there, so on and so forth. I'd just rather be at home.\n\nWell when we thought May was going to be go back to office time they started giving out the new designations. I got designated as in office full time. It made no sense to me. I work on a team of 8 people and each of us is in a different office somewhere in the country. I've literally never been to an in person meeting or needed to do in person work in 3 years at this company. Every single other person on my team got designated to work from home. So I brought it up with my boss and asked to work from home. When I started at this company and lived elsewhere I got to work from home for 4 months before I moved and the past 14 months during covid have been at home, so 18/36 months at the company have been WFH. What I was told is that I go idle too often in chat to trust to work from home. \n\nBasically we have a company wide IM system that shows you as available, idle, or in a meeting. If you don't touch your keyboard for 5 minutes you show as idle. So they've decided to use this as a measure for who is working and who isn't. The thing is, like many people in many types of jobs, I don't have shit to do for a full 8 hours every single day. The amount of work I have to do on a typical day takes 3-5 hours of actual attention. There simply isn't something to do ALL the time. My performance numbers actually went up working from home, by all objective KPI numbers I'm a better worker at home. In fact, in the KPIs that I don't flat out lead the team in, I come in second. There isn't work to do that I'm neglecting or procrastinating, when something comes up I simply do it until it's done or until I can't do anymore due to waiting on someone else then stop. And I've done that method long enough that my work queue stays empty because I worked to get my queue down to the point where when something comes up I can immediately address it and be done with it. But because I have other ways to spend my time in down time instead of messing around online at my cube pretending to be working meaning I show idle more often, I'm a worse worker apparently. I was told if it weren't for that they would let me work at home.\n\nSo I wrote a 6 line powershell script that virtually inputs the period key every 4 minutes that starts running every day at 8am and stops at 5pm. So now I literally never go idle. I do the same amount of work and still read books, watch tv, and play video games on the side. But I have a shiny green check next to my name all day.\n\nBecause of covid complications they eventually said no going back until after labor day. I just had a meeting with my boss and he said over this time they've noticed I go idle a lot less than I used to so they're changing my designation to work from home, all because of a little icon in some software. This concludes my TED talk on why low to middle level managers are the dumbest, most useless do-nothing positions in all of corporate America\n\nEDIT: I do not need to be told to buy a mouse jiggler for the 30th time. I'm aware of what they are. This cost me no money and achieves the same thing. Why would I pay to achieve an effect I've already achieved for free?\n\nEDIT 2: A lot of people are understandably asking for the script:\n\n    $dummyshell = New-Object -com \"Wscript.shell\"\n    $dummyshell.sendkeys(\".\")\n\nThat's the backbone of the whole thing. There's different ways to implement it with for loops or scheduled tasks or whatever, that parts up to you, but that's all the powershell needs at it's core to accomplish this. A lot of people have pointed out that sending Insert or F13 instead of period would be better so change that up if you want.\n\nTo all the people commenting that I'm a shitty employee and obviously trying to insult me over it: I wish I could make you feel just how little I care. To all the people implying a work day isn't valid if you aren't at 100% capacity from 8 - 5, keep it up, you truly are an ideal employee...*to them*. Enjoy the taste of leather, bootlickers\n\nEdit 3: Some of y’all would be pissed as fuck if I explained the concept of firefighters to you",
        "score": 74842,
        "id": "nejr3k",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nejr3k/you_cant_continue_working_from_home_because_you/",
        "created_utc": 1621266554.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "1 & 20 Years Paying the Bitch Back",
        "selftext": "Some time back I was hired to a company by a CEO I had previously worked for someplace else. He was a good friend so when his newest company wasn’t achieving sales, he headhunted me to join the new one. \n\nThe company hadn’t made a sale in two years. Year one the software product was in beta so it wasn’t ready to be sold. Year two they realized using the tech staff to make high end sales to C-level executives was the shittiest sales model one could conceptualize. In general, and there are exceptions of course, these two personality styles don’t speak the same language. Tech people talk tech. Buyers talk benefits and how the potential product fills needs. I bridge the gap well by translating tech-speak into natural conversational language so buyers better understand how their needs will be filled. \n\nThe job was an hour and a half drive one-way from my home so the CEO said I could work from home as long as I kept the sales management tool current (it’s where you keep the notes of each prospect’s status), came to important meetings and made sure the executive team had daily sales reports. \n\nThe first month I made the daily 3 hour commute because I needed to have solid, constant interaction with all the departments to rapidly form my sales strategy and develop a two-way confidence level with the section heads. \n\nOnce I had a handle on things, I was ready to launch my sales plan. In the meantime, the CEO hired a VP of Sales (bitchboss) who started 4 days before I hit the ground running to get in front of buyers. \n\nShe was a VP coming from the banking industry and had a long career in sales and marketing in finance products. I hated her from the moment she arrived. She knew fuck all about tech and I spent huge time trying to orient her which wasn’t ideal because I needed to work on my sales strategy. They brought her onboard because she had strong experience gaining financial investors. \n\nNevertheless, I forged ahead. Traveled to a target state and spent 19 days criss crossing it. When I came back I had 17 contracts from buyers totaling about $2M in sales. My CEO was overjoyed. \n\nFast forward six months and now working from home, I’m rocking and rolling. Sales are strong. CEO is happy. Good things are happening. \n\nBitchboss has landed an investor willing to drop $6M into the company, and they are coming into town for a discovery meeting. She asks me to drive up because they specifically want to meet the salesperson. Seconds before walking in the door for the big meeting, bitchboss pulls me aside and says she needs me to back her up on lie she has told them. Basically she doubled my sales numbers. I told her there was no way I was going to do that. She says the CEO has okayed the lie. \n\nWe get to the part in the talk where the investor is looking over my inflated sales numbers on the prospectus, then directly asks me how many sales I’m making a month. Bitchboss is behind him waving her arms but I was having none of it and answered truthfully. He looks askance staring at the document which has the false number listed, while she’s giving me the stink eye behind him. \n\nNo one says a word. Dead silence.\n\nI ask to see the document and fates have aligned allowing me to solve the dilemma. I explain the first two numbers were transposed (they correlated well to my real sales versus inflated sales if you flip-flopped the first two digits.) Potential investor is satisfied and we move on. \n\nSwitch gears. About a week later I was meeting with the CIO in his office and he referred to my “big tits.” I’m no shrinking violet but it stunned me because it was so unexpected.\n\nThat  night I was chatting with my BFF who happens to be a lawyer and told him about it in casual conversation. He said I should tell the CEO so he can address it. Thinking along smart business practices, I decide to tell bitchboss to whom I directly report as proper protocol since we don’t have a HR dept yet. Side note-I also reported directly to CIO as a boss since my role was a muddy mix of sales and tech. \n\nThe next day CEO calls me and I take him through it telling him it’s no big deal but to make sure he talked to CIO so it didn’t happen again. He says he’ll do it right away. \n\nTwo days later I check in with him and CEO still hadn’t talked to CIO because the investors were in town. I gently push him to get it done and casually mention my best friend who happened to be a lawyer was the one who urged me tell him because “any good CEO would want to know about it.” I reiterate I’m not mad or upset. \n\nThe only word he heard was “lawyer.”\n\nHe went apeshit that I was bringing a lawyer into the mix. Now this guy was my good friend. We’d worked together at two companies for years. I calmed him down (or so I thought,) explaining that I only wanted him to talk to CIO. I also told him I HADN’T brought a lawyer into it, that I had been innocently chatting with BFF who just happens to be a criminal defense attorney. He seemed okay and we hung up. \n\nThe next day I’m working as usual and I get a call from an attorney who explains the company has hired her regarding my sexual harassment claim. I’m flummoxed and adamantly told her that was not the case, that I had no claim against the company.  She said otherwise. \n\nAnd that’s when everything changed. Dramatically. \n\nCEO was furious with me for bringing this on when investors were looking at us. His reaction set the tone which filtered down. The company began to retaliate against me. Bitchboss now made it her mission to make my life hell: “forgetting” to tell me about important meetings I was supposed to attend, freezing me out when I was in the office, telling me I could no longer even speak to CIO (a problem since I’m selling a multi-million dollar tech product needing his input AND I directly reported to him as my other boss), denying me a long planned, approved vacation, basically anything she could devise to screw me over-she was gleefully working it. \n\nCoinciding with this was a serious health problem I developed ultimately requiring surgery. My illness had no impact on my work as I was able to work from home which made things easier on me health wise. Bitchboss then decided that I need to come to the office every day despite a 3 hour round trip commute. \n\nNow I know you’re thinking why didn’t I just leave, get another job somewhere else...\n\nI needed the health insurance. There was no way to turn around another job fast enough and I had a complex surgery scheduled requiring 3 surgeons for my procedure. \n\nMy doctor gave me a note for them which released me from having to make the daily commute so I could continue to work at home. As long as my work didn’t suffer, they legally couldn’t force me to commute especially since working from home was a part of my employment contract from the outset. \n\nThe night before my surgery, bitchboss calls to tell me they’ve cancelled my health insurance. After hanging up with bitchboss I collapsed on the floor in a faint. I was so, so, so sick, and mentally exhausted from all the stress. \n\nThe next morning the CEO frantically calls asking to talk to me. My mom refuses to let him. I’m on official leave as of that morning and we’re heading to the hospital. CEO had told their lawyer about canceling my health insurance and she chewed him a new asshole telling him it was illegal. They immediately reinstated my insurance. \n\nIn the two weeks I was out, my mom had found a lawyer for me as it was clear shenanigans were going on. I still needed them as an employer because I was in no shape to rigorously job hunt while recovering. \n\nTurns out all the bullshit they were doing to me is illegal. Companies aren’t allowed to retaliate against employees when they report nefarious acts against them. \n\nI met with my new lawyer who said I had an excellent claim for retaliation and took me on. He said I had to continue working there while he did his thing to stay within protocol while he filed the EEOC claim. \n\nNow it’s time for me to return to work. The company had relocated (planned) during my absence and bitchboss refused to tell me where so I couldn’t come back to work. Company lawyer told them they HAD to tell me so bitchboss gives me wrong directions making me late on day one. \n\nI walk in the new office and it looks like any other place except for one thing. There is a wide open area directly in front of the CEO’s glass office with a single desk in the middle of it. Welcome to my new desk. \n\nAlso, I wasn’t allowed to do sales anymore. In fact, I wasn’t allowed to do anything, at all, period. \n\nThey had hired a bunch of new people to the company and they treated me like a pariah. Turns out bitchboss had gone to them telling a pack of lies and if they know what’s good for them they’ll stay away. \n\nSince I had nothing to do but couldn’t just sit there looking like a dope, I worked on documenting everything being done to me per my lawyer’s advice. I was meticulous in my note taking. \n\nBitchboss began writing me up. Stupid stuff like not answering my phone on the first ring and for asking questions during company wide meetings, asking to see my personnel file which employees are legally entitled to do although not entitled to photocopy any of it.\n\nEach time she wrote me up, I had to sign the write up. There was a space for me to reply to it so I consistently wrote, “I do not agree with this assessment.” It infuriated her so much, she wrote me up again for writing the statement that I didn’t agree with it. \n\nThere were several instances where she called me into her office and literally began screaming at me loudly and enthusiastically. I wouldn’t engage though; my standard answer to everything was OK which made her apoplectic. At one point, she’s inches from my face screaming, her face beet red and I just sat there with a dreamy expression whilst envisioning her blowing a vein in her head stroking out.  I infuriated her with my equanimity. \n\nStill and all, I was in it to win it at this point. It didn’t matter what new humiliation they dished out. I took it all with a bland face, then went to my desk and documented it in my notebook. \n\nShe loathed my notebook, sure that I was doing exactly what I was doing. Documenting. Because it was my personal property though, she couldn’t take it from me. I had to carry all my belongings with me everywhere (company wide meetings, the bathroom, lunch) because I caught her one time going through my desk drawer....in my fucking purse!!!!!  (Although it gave me great joy to write a note reading “fuck you” which I left in my backpack and jerry rigging it so I could tell if she went into it...which she did.)\n\nI withstood it all with a brave face only breaking down once I left for the day. My attorney took a lot of sobbing phone calls during this period. \n\nFinally the day comes that my attorney has what he needs and I can resign, better still, he advises I don’t have to give a two week notice. I come back from lunch and type up my letter with one sentence, “I resign immediately.” I take it into the HR guy (who also took part in their evil machinations) and hand it to him. His mouth forms an O shape and he half stands up from his chair as he reads it. He looks up and I give him a smile and say bye bye just as sweet as pie, walked out the door and drove home feeling mighty fine. \n\nOne month later, my lawyer and I are at the EEOC office along with the CEO, bitchboss and their lawyer so the EEOC can review my claim. \n\nIn my state, you can’t just bring a lawsuit against a company for things like harassment and retaliation. Claims must first be evaluated by the EEOC, and then if they determine you have enough grounds to file a lawsuit, they issue a Right to Sue document. \n\nMy lawyer presented my case logically and forthright detailing all the evidence. It took him 40 minutes to go through it all. Then they presented their side with allegations of my poor employment along with their “evidence” which were all the copious write ups bitchboss had written. EEOC asks about the timeline of the write ups inquiring if they before or after my claim occurred. Bitchboss wearing a smug self-satisfied smile states they were all prior to my claim as noted by the dates on each document. \n\nEEOC Lady looks at my lawyer. My lawyer looks at me. I look at bitchboss then serenely pull out MY  photocopies of the documents. Whilst handing them to EEOC lady, bitchboss barks “she’s not supposed to have those, they’re company property.” I show EEOC lady that the dates have clearly been altered by Bitchboss. (She had made copies with the dates blanked out then backdated them.)\n\nYou see whenever she wrote me up, I had to take the document personally to the CEO to put in my personnel file. Along the way though, I stopped at the copier and took copies. She never knew I was doing this. \n\nYou could’ve heard a pin drop. \n\nEEOC Lady reviews the copies then slowly sets them on the table. She didn’t say a thing for a long time, then she spoke. I can remember her words exactly to this day. \n\n“I’ve seen a lot of ill treatment and illegal undertakings by both employees and employers, including forged or altered documents, but I have never see someone so incredibly stupid to present documents this easily disproved. Not only are employees entitled to receive and keep a copy of formal write ups but reading these ridiculous allegations, it’s obvious you are trying to manufacture your case.”\n\nShe went on to say I had a clear case for a lawsuit, and moreover I would win it. She recommended their side go in another room and determine a settlement amount to pay me immediately or risk the lawsuit. \n\nThey went to a nearby office and I could hear the lawyer dressing them down. Words I heard included “lied to me” “lied to EEOC” “presenting false documents” “broke so many laws” “figure out a number big enough to pay her so this doesn’t go to court because you will lose.”\n\nThey came back with a $50k offer which we accepted. My lawyer and I left then did a football touchdown dance in the parking lot. Looking up at the EEOC window, I could see bitchboss in the window looking miserable and crying.\n\nShe had just been fired. \n\nThat was my year 1 revenge. \n\nI’m not a hateful person. I get mad and get over it. But... for bitchboss, I nurtured hatred and vowed to one day get revenge, so I kept tabs on her, and discovered she opened a finance marketing company after she was fired. Then I waited a year before exacting my petty delight. \n\nFor the past 18 years, I’ve executed a wonderful, soul-refreshing project. Each year I go to her website and write down all the work email addresses and phone numbers for the employees. Then I subscribe them all to “get more information” from places like online schools, online insurance companies-all those bullshit aggressive organizations that keep your contact information longer than a gypsy fucking curse while trying to sell you stuff. \n\nThe last few years, I’ve subscribed them to an email bomb service where the service takes the address and instantly subscribes it to 1000s of newsletters, request for more information feeds and other online buyers of email addresses for marketing services. I tested it with a burner email and it wreaks havoc on your inbox with thousands of emails received within seconds, and they never.... fucking... stop....\n\nYou literally have to close down the email because it can’t be salvaged. Each year when I go to collect the contact information, all the emails have been changed to new ones. \n\nLast year my cousin took a job in the same building. I enlisted her help and she made it a point to befriend a receptionist working for bitchboss. After executing my yearly plan, my cousin went to lunch with her. The receptionist was in a foul mood and explained the entire organization was in disarray because IT had to redo all the emails again. “It keeps happening over and over and nobody can figure out why.”\n\nShe said the owner (bitchboss) has had to get her cell phone number replaced 3 times because of all the texts and phone calls she gets whenever it happens again. (sometimes bitchboss would have her phone number on the website which I duly subscribed to everything under the sun.)\n\nThe best part for me was hearing how she lost a mega client because they felt the company was in too much turmoil so often. \n\nThe thought of this keeps me warm and cozy at night, and I sleep so very, very well.\n\nEDIT: I forgot a part of the tale. A Redditor mentioned that if the investor pulled out that would’ve been a neat twist. That jogged my memory. \n\nThe investor DID pull out. Once I left the company, they couldn’t duplicate the same scale of sales revenue I had been generating and the investor got skittish. The company did go on to success ( sans bitchboss and CEO) but it took them much longer due to this fiasco.",
        "score": 7926,
        "id": "apy6s3",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/apy6s3/1_20_years_paying_the_bitch_back/",
        "created_utc": 1550005198.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Favorite teacher gets wrongfully fired, so I get 3/4th of the staff arrested.",
        "selftext": "I'll start off by saying this happened to my sister, and the actions taken were hers. \n\nMy sister has always gotten along very well with her teachers, and has a habit of forming *actual* friendships with them, to the point that she still talks to her 5th grade English teacher (along with many others) decades later.\n\nThis happened about 15 years ago. My sister was a student at Job Corps (a government run live-on-campus vocational training program), studying hotel/motel management. She got on extremely well with her hotel/motel management teacher, better than pretty much every teacher she'd already had up to that point.\n\nOne day, the teacher goes to the center's dean's office, and walks in on a paper-shredding session. It turned out that there was some pretty major embezzling happening at the center; as in more than 60% of the funds for the center were being stolen.\n\nThe teacher was appalled, and despite some rather... *lucrative* offers made, refused to join in on these acts.\n\nLess than a week later, the teacher was fired for trumped up reasons. This was especially bad given the teacher was only 2 years away from retiring, and being fired lost their retirement package.\n\nNeedless to say, my sister was PISSED.\n\nKnowing how things typically work, and that almost any report she tried to make would just be swept under the rug (if it was taken seriously at all), she came up with a plan... And took things nuclear.\n\nOver the next month or two, my sister managed to gather some basic evidence of the embezzling; nothing concrete, but enough to warrant considerable investigation by the authorities.\n\nShe took the little evidence she was able to gather, along with the story of what happened to her teacher, and sent the info in an email to the Job Corps regional director. Now like I said, she knew that her email would likely be ignored, or the event swept under the rug, so she got smart. The email was CCed to EVERY single major person in the Job Corps chain of command, all the way up to the national director, as well as to anyone even tangentially related to Job Corps in the upper-echelons of the Department of Labor, *and* EVERY member of Congress, as well as the US President's office (remember, this was a government run program). All in all, the email was sent to over 2000 people.\n\nBasically, she not only sent the report, but sent it in such a way that everyone who got it could also see everyone else who got it, and she sent it to WAAAAY more people than would be needed to ensure the issue couldn't be swept under the rug.\n\n2 weeks later, after the investigation finished (never seen the government work so fast on anything that wasn't collecting owed taxes), only 5 or 6 staff members, out of 20ish that worked in the center, still had their jobs; and at least 5 of the ones fired (including the dean) were facing *major* criminal charges, with the rest facing minor charges. I'm not sure of the exact figure on how much was stolen, but it was well into the 7 digits (the embezzling had been happening for *years*).\n\nThe teacher got a VERY nice severance package post-investigation (IIRC, it was 3-year of pay, her full retirement package, and signing a NDA), though she didn't get her job back; and my sister was given her completion certificate, despite not having finished the requirements of the course (they wanted her *gone*, but couldn't kick her out).",
        "score": 7873,
        "id": "ch761h",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/ch761h/favorite_teacher_gets_wrongfully_fired_so_i_get/",
        "created_utc": 1563969028.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Take off my earphones while you're speaking to me? Sure, no problem officer.",
        "selftext": "Happened this morning. Even though I made a complete and full stop at a 4 way stop, I get pulled over by a police vehicle, lights flashing, the works. I turn my dash cam around to face me and whomever goes in front of the driver side window. \n\nI roll it down and ask \"what seems to be the problem officer?\" Officer looks at me the way one would look at a sticky piece of gum stuck to the bottom of one's shoe. \"You didn't make a complete stop.\" he says. I adjust one of my hearing aids (lost part of my hearing due to being a touring session musician previously) and before I could speak, he firmly orders \"Sir, take off your earphones when I'm talking to you!\"\n\nI take both hearing aids off and look at him. I can read lips a little but we're both masked so I can't understand what he's saying. I communicate in sign language simultaneously while speaking verbally \"I'm deaf and I didn't understand what you just said. Can you communicate to me in ASL (American Sign Language) please. He points at my hearing aids that look like Apple Air Pods, motioning me to put them on. I respond \"Yes officer, without those I can only communicate in ASL. Please instruct me in ASL and I will be compliant in every possible way\".\n\nHe looks at the dashcam that's neatly pointed squarely at us and mumbles \"For fuck's sake\". He then motions for me to to go, giving me 2 thumbs up. Needless to say, I rolled up the window and drove away as fast as legally allowed.\n\nCouldn't wipe the smile off my face all day, Lol.\n\nAddendum: Whoa! 13K likes in a span of less than 2.5 hours. Thanks all! Don't worry, I'll update with a YouTube link as soon as I and a more gadget savvy nephew extract the footage. I will not be driving the car to preserve the video and to not risk getting it recorded over.\n\nCheers!",
        "score": 74614,
        "id": "rw9wr4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rw9wr4/take_off_my_earphones_while_youre_speaking_to_me/",
        "created_utc": 1641344640.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "They framed me. They fired me... And that’s how they fucked themselves into a divorce, a prison sentence, and a handful of deportations.",
        "selftext": "This is a long one, but if you stick with it until the end, you will learn how I was framed and fired from my job, and accidentally set off a chain reaction that led to a staff overhaul with several managers being fired or moved to other restaurants, the general manager being fired and getting a divorce, and one of the managers being investigated by the FBI and ultimately arrested, as well as several of the workers being deported. \n\nHere we go: \n\nI used to work at an upscale restaurant owned by a large corporate entity that owns several different restaurant brands. I worked there for about 3 1/2 years before they eventually fired me, but more about that later. First, I want to give an idea of my role there. \n\nMy role at that job was a little of everything. Since the day I started working there, I took it upon myself to learn as much as possible. I was very persistent with management when I wanted to learn a new department. I had started as a server, but eventually had worked my way into different departments and job titles, like carry-out, hosting, bartending, bar backing, banquets, catering, and deliveries. \n\nMy singular goal while working there was to make myself available for as many hours as possible. I was being paid about $12 an hour, though that fluctuated if I was working as a bartender or server and making tips. Eventually, it was noticed by management how I fit best into one of the non-tipped positions. I was so good at it that they decided to try me out as an unofficial supervisor over the team that worked in carry-out, catering, and deliveries, as those were all one department. \n\nI knew this was going to ultimately mean a few less hours since I would only be working one department, so I negotiated with management to increase my pay by about $1.50. Since I was taking on additional responsibilities, they were satisfied with the pay increase. I wasn’t trying to get as much money as possible, I just wanted to be able to pay my bills and still have a little money left over for fun. \n\nI was living in the highly taxed city of Chicago, which is in the already highly taxed state of Illinois, so it was pretty difficult to make ends meet and still have money left to enjoy my life. I am a person of simple pleasures and I can enjoy things for long periods of time, so it didn’t take much money to be happy. A video game could hold my attention for several months, sometimes even years. I had a family pet that I had brought with me to Chicago, so that counted as an extra expense. Not long after I started this position as the unofficial supervisor, I got a girlfriend so I was also going out more often and spending money on her.\n\nWith my position and some smart budgeting, I was able to afford all of this. The money wasn’t an issue, but management had a high turnover rate, so the incoming managers often did not know what the department entailed or how important hours were to workers of these departments. \n\nEventually, it was noted that our current general manager was going to be fired and replaced. The incoming general manager was supposed to be some rockstar when it came to improving restaurants. We looked up his name and found him as the first search result on Google. But the entry wasn’t some glowing review of his work ethic or of his impeccable ability to improve the way a restaurant runs.… It was actually a mugshot and a police report filed for repeated domestic abuse. This is important later. We’ll call him Harvey. \n\nShortly after Harvey came in and started making changes, one of our best managers gave her resignation. She refused to work with him, and like a fucking Oracle, told us to expect lots of sexual harassment, misogynistic comments, and for him to eventually run this place into the ground. Not long after she left, our general manager began replacing our current managers with hand-picked people that he had worked with in the past. Eventually all but one manager was replaced. That manager was the kitchen manager. We will call him Fredo. \n\nFredo had been there since I had started working there. He seemed to be something of a chameleon, as in his values and ethics seemed to change depending on who his boss was. Honestly, I sort of applaud his survival instincts, but ultimately see him as a suck up and traitor.\n\nHarvey never really replaced the manager for our department, so we ran without a lot of oversight. Unless you count me as the supervisor, we didn’t constantly have someone breathing down our necks about how things should be done. Our department had some hiccups here and there, but it still ran really smoothly. \n\nSince we did not have our own manager, we often had to radio for a manager to come help us out on things that needed a manager card for approval. Fredo would always be the one to answer these calls since the kitchen was closest to our department. Over time the new team of managers started to see Fredo as the manager of our department as well. However, the hourly team that worked there still saw me as their supervisor. This meant that any time Fredo was trying to make changes that would ultimately hurt us, the team relied on me to mitigate those disasters or to negotiate with Fredo to let us do our jobs the way we had already proven worked really well. \n\nOver several months Fredo and I would butt heads dozens of times. He and I were constantly arguing about how important hours were to the workers in this department. He had it in his head that we should be living off of tips like servers, but since most of our orders were carryout, they came in through Grubhub, and Grubhub doesn’t tip. We didn’t have a lot of deliveries in a day, and the tips we got from those were maybe $10 if we were lucky. But splitting $10 four ways doesn’t add up to a lot. It just showed that Fredo had no clue what he was talking about. \n\nEventually we had a meeting with our Harvey, Fredo, and all the workers of this department.  it was marketed as a chance to voice all our grievances and concerns with the changes they wanted to make with no chance of retaliation. So the workers did exactly that. They talked about how Fredo was trying to cut hours even though he isn’t our actual manager. When it was brought up that they were attempting to hire someone to be the manager, the team suggested that I take over since I had already been supervising them and running things smoothly for the last several months. I was also the one that management consulted with when writing schedules as I had an understanding of the days some workers could and couldn’t work depending on their school schedules or family life.\n\n I could see at the moment it was suggested, that Harvey and Fredo made the decision on the spot that I had to be gotten rid of. Although they didn’t say it, I could see the look they gave each other, and instinctively knew that my days at this place were numbered and my job was going to be getting the ax one way or another.\n\nThey made a bunch of promises to us about not cutting hours. They told us that they would stop sending all but one person home early and only leaving one person to clean everything and close up by themselves, as this wasn’t a small department and it was simply too much for one person to do alone while still meeting health and safety standards. They promised that whatever hours we were scheduled for, we would work. We weren’t trying to be unreasonable, so we told them that we usually have 3 or 4 people scheduled to work our department. They could cut two of them early, but we always needed at least 2 people here to help close properly. The promise was made that they would always have at least two closers. \n\nHowever, only about a week later, they started sending all but one person home early again every night. One night they tried to do it while I was scheduled as the closer, and we had just returned from a massive catering event and there was an unbelievable amount of cleanup left to do for one person. When Fredo came in and tried to send everyone except me home I stepped up and told him that he was consistently breaking the promise he had made it to us during the meeting. He looked me square in the face and told me to stop complaining about it, and if I was going to keep trying to talk to him about him breaking his promises he could easily find someone who could work my shifts.\n\nI quickly realized that this was an assassination attempt on my job. He *wanted* me to press it further. So I backed off and started cleaning. I ended up having to stay way late, and that meant overtime pay anyway. I got a write up for that, since we aren’t allowed to work overtime without a manager’s approval. When I refused to sign the write up, pointing out that I had tried to explain to Fredo that I wouldn’t be able to clean up all that stuff alone before my scheduled shift ended, I was allowed to leave without signing the write up, but only because the HR rep that was present at the time wasn’t one of Harvey’s cronies. \n\nSkip ahead, to the day I was fired:\n\nIt is important to note at this point that I always came into work an hour early. Since we lived in Chicago, food was expensive. However at our job we were allowed to have as much free soup and bread as we liked. So I would come into work one hour early every day so I could have some soup and bread for lunch before my shift.\n\nBut on this day, when I walked into the kitchen to get myself some soup, one of the line cooks told me that he had a dish that had been canceled after he cooked it, and Fredo had told him to give it to someone. He assured me Fredo had already comped it and that it was free to take for whoever wanted it. It just so happened to be my favorite appetizer so I happily took the free food. \n\nNot long after I got to my booth, both Harvey and Fredo approached me and asked me if I had put in a ticket for that food. I told them that the line cook had given it to me and said it was the canceled order that Fredo had already comped… Fredo looked dumbfounded and said he had no idea what I was talking about. So Harvey told me “I think you know that’s theft. Go ahead and finish the food and then grab my stuff and go. That’s the last meal you’ll be having here.”\n\nI tried to explain to them that I had been given this food by the line cook, but they refused to listen, so I offered to take them to the kitchen to clear it up with the cook. But by the time I had gone back to the kitchen with them to talk to the line cook, he had already gone home for the day. I had no choice but to gather my stuff, say my goodbyes, and head home.\n\nOn my way out, I told my the people working my department that afternoon what had happened, exactly as it happened. They were shocked and angry, but mostly sad to see me go. I decided that on my way out, I would stop by the accounting office and pick up any tips that may have been dropped for me that week, just to make sure I didn’t get screwed out of that money. \n\nBefore heading down, I had the gut feeling to just set my phone to record, and I stuffed it into my pocket with the camera rolling. Although the video was entirely black since it was in my pocket, I did manage to get a pretty muffled recording  of Harvey and Fredo’s voices through the door, discussing how things had gone as planned, and that they had been trying to get rid of me ever since the meeting with my department. \n\nI knocked on the door and they hushed up before opening it. They asked what I was still doing there, and I asked for my tips. They gathered what was in the safe for me and handed it over. Despite my anger rising at what I had just heard, I decided not to burn this bridge just yet... Because perhaps I could fucking nuke it later. I offered a handshake to both managers, thanked them for the opportunity to work there, and left, making sure to pull my phone out of my pocket and record the front of the restaurant, with the sign showing its name and logo. Working in a restaurant, you learn to ALWAYS COVER YOUR OWN ASS. It’s true for most jobs, but something was just telling me I would need this all later. If I was being accused of theft, I wanted to be able to prove it wasn’t true if ever came up in future job interviews... Which is exactly what happened and where this all started going nuclear. \n\nOn the train ride home, I sent some messages and made some posts on some local groups on Facebook saying that I had just been fired and that I was looking for a job as quickly as possible. By the time I got off at my stop, I had already set up an interview for later that day.\n\nI was offered the job about 5 minutes into the interview, but after going over the details, it didn’t sound like it was for me, so I turned it down. I interviewed a few other places and found one that was a damned good fit, with a hefty pay increase compared to my previous job, and I wouldn’t have to deal with customers. It was an auditing job for a logistics company. \n\nHowever, during the interview with the manager of this job, he mentioned he had already called my previous place of employment and spoken with the general manager, Harvey. Harvey had told him that I had even fired for theft. Luckily for me, the manager I was interviewing with asked me to tell him more about that... and he was willing to let me pull out my phone and find the recording. \n\nI asked it the voice in the video was the same as the one he spoke on the phone with. It was. That was confirmation enough for him that I hadn’t made a fake video. He listened to the two managers in the video admit that they had set me up, and watched to the end when I showed the front of the restaurant, complete with the logo and name. \n\nThe manager interviewing me, who we’ll start calling Dean, hired me immediately and asked me to send him the recording. I did. \n\nI thought that was the end of it. \n\nAbout 7 months later, after settling into this job quite nicely, HR sent out a “Welcome all our new team members” email, which listed all the newest hires, some facts about them, and had pictures of them all. They sent these out every time they hired a new round of people. \n\nOne of them, Thomas, was a former coworker who worked with me at the restaurant. We had worked at the host stand together, so I was pretty glad to see someone I knew and liked coming onto the team. I sought out his desk and went and said hello, and asked why he left the restaurant. \n\nHe hadn’t left willingly. He’d been laid off because the company was under investigation. It had started as a relatively small matter. The corporate entity that owned the restaurant chain had received an email with an attached video. MY video that had been filmed from inside my pocket. That was cause enough for corporate to send someone to investigate internally. \n\nThomas was pretty surprised that I hadn’t heard anything about it, since there had been numerous attempts to get in touch with me. As soon as he said that, I  logged into the old email I had used when I first applied for the job at the restaurant. I had at least two dozen emails asking me to come in to discuss my employment and termination. I never replied. I just didn’t care enough anymore. \n\nI’d also changed my number since then, so they hadn’t been able to contact me by phone. \n\nThomas continued explaining that before corporate had sent someone, Harvey and Fredo had talked with my department and tried to offer them all a small pay increase to spin corporate a story about how I was incompetent at my job and failed to live up to my duties. \n\nThe day the corporate auditor showed up, there had been a small exodus of people from my old department. They quit ON THE SPOT, in front of the lady from corporate (let’s call her Audrey), and made sure to rat out Harvey and Fredo before leaving. \n\nStrike one for both of them. \n\nStrike two came a couple of days after Audrey showed Harvey and Fredo the recording that had kicked all of this off. They denied it vehemently, but there was no mistaking Harvey’s voice. It’s unique. Not only that, but the video also picked up their voice and mine when we shook hands and had a friendly parting of the ways, which was something they had already bragged about to Audrey, thinking it made them look better that we were able to part on good terms. This wasn’t the actual strike two. That came when it was clear they needed to be separated, so Audrey sent Fredo to work at another restaurant owned our parent company, and temporarily demoted Harvey to manager. \n\nThis tore them apart. They had once been an inseparable evil team, but the pressure of the investigation must have pushed them over the edge. They ended up at each other’s throats... on Facebook, on a public post on the company page. The post had since been deleted, but Thomas explained it as the following. \n\nFredo had been pictured in the Facebook post on the restaurant page, and Harvey made a passive aggressive comment about how Fredo shouldn’t even be in the picture since had been moved to another restaurant due to misconduct. Fredo saw this comment and said something along the lines of “At least when people google my name, I don’t show up as the guy that punched his wife.”\n\nTo which Harvey responded, “Very funny from the guy who is cheating on his wife with Janet’s sister.” (Not her real name, but Janet was the girl they appointed to officially supervise my old department after they fired me, the unofficial supervisor.)\n\nFredo replies to that by saying “Like you haven’t tried with half the waitresses. They all have stories about you trying to fuck them.”\n\nThe post was deleted, but not before it had been seen by Audrey the auditor. That was officially strike two. \n\nStrike three came the next day when Audrey started interviewing the female waitstaff and bartenders, seeing if any of them could confirm that Harvey had tried to make a move on them. \n\nAll of them were interviewed separately, several of them had similar stories. Every girl that confirmed Harvey had made a move on them all said he had offered to be their “Sugar Daddy” if they would send nudes or stay after closing to fool around with him. \n\nHarvey was fired. But that isn’t the worst of it. Audrey the Auditor wasn’t just some random woman from corporate. She was the old regional manager for this area, and had personally hired Harvey’s wife as the general manager of another restaurant in the city. So she called up the restaurant Harvey’s wife worked at and told Harvey’s wife everything she had learned from the female waitstaff. \n\nWe learned later that they had gotten a divorce over him trying to cheat on her after she’d already given him a second chance to change after he had BEAT HER. I don’t know what compelled her to give him a second chance after something like that, but she sure didn’t give him a third. \n\nAfter firing Harvey, the line cook who had given me the food was interviewed by Audrey. I don’t know how it came up, but at some point, he had let it slip that he was an illegal immigrant. She had his file in her hand, with an Illinois ID and Social Security Number on file, so this confused her and she pressed him for more information \n\nIt turns out that Fredo had some connections and had his own miniature black market going on where he would have fake social security cards and IDs made for the illegal immigrants he was hiring at reduced wages. It had been going on for at least 4 years. \n\nNeedless to say, this is a felony. With the potential PR nightmare that she was likely dealing with, she felt she had no choice but to alert the authorities. Local PD enlisted the help of the FBI since some of the evidence led them beyond the jurisdiction of the local police. \n\nFredo was arrested, and quickly gave up the names of the people working that he had sold Social Security Cards and IDs to. I’m not sure if he gave up ALL of them, but he did name drop about 14 people, and of those 14, at least half were deported by the time Thomas had been let go. One of them was the line cook that had given me the food the day I was fired. \n\nThomas went on to explain that it had all started with me being fired, but I never sent that recording to corporate. I’d only sent it to Dean when he hired me. \n\nI asked him about it, and he told me he had sent it to his wife, since she was a lawyer. He wanted to see if I had a case to maybe sue my old job, since what they had done was wrong. But he also remembered that when we had first talk about it, I had said I’m not the type of person who would try to make millions off an entire company because of the mistakes of two assholes. \n\nBut I’d also said that it would be pretty sweet to see them lose their jobs too. \n\nSo his wife had been the one that sent it to the legal team at the corporate HQ of my old restaurant job. \n\nMy boss showed it to his wife, who forwarded it to the real head honchos of my old job. They were both just trying to get two scumbags fired for what they did to me, but ended up pulling a thread so long that it didn’t end until there were sexual harassment accusations, revelations about managers cheating on their wives with girls related to people they had placed in positions of authority, a divorce, mass layoffs pending investigations, a staff overhaul, an FBI investigation into what could be considered black market dealings of falsified government issued documents, and at least a half dozen deportations and probably as many as 14. \n\nI don’t know if this counts as nuclear **”revenge”**, as I didn’t actively pursue it. But Thomas ended up showing me that even if it wasn’t revenge, it was definitely nuclear, and the crater it had left was massive.\n\nEdit: Apologies for the run-on sentences.",
        "score": 7856,
        "id": "fnxqdz",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/fnxqdz/they_framed_me_they_fired_me_and_thats_how_they/",
        "created_utc": 1585019065.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Why we don't see Uncle Mark anymore",
        "selftext": "So. This was told to me by my dad over a drink recently. He'd gotten a little drunk and ended up admitting it to me, said it's been too long now and he'd paid the consequences so there was nothing to come back on him (only reason I'm posting this).\n\nUncle Mark was my FAVOURITE uncle when I was a child, he always invited me around to show me his airsoft gun collection, hide and seek parties with my friends and even took us to the beach!\n\nHe would always come with sweets for us and acted like one of us, another child who just wanted to have fun.\n\nBut then... the day I (7 years old) was meant to be going around because we were going for a ride to this 'amazing place'.\n\nMy dad was happy and cheerful for the entire day, he was going on about how much he loved the fact his brother wanted to be in his children's life... until he got a call. I was in my room, packing my stuff when I heard the most blood curdling scream from my dad, he was screaming and raging, I heard him rip open our front door and slam it back shut with enough force to make the picture next to it fall off the wall.\n\nI didn't see my dad for a long while after that, and he never told me why until we had this talk, but that shall be explained at the end.\n\nMum had a lot of money saved up from a minor lotto win so we were okay and she always smiled and said \"daddy is just away for a little while because he was looking after me and my siblings\" whenever I asked where he was.\n\nUncle Mark didn't come around either during this time, but we did see him in town a couple times... funnily enough, he ran away the moment my mum saw me waving at him.\n\n9 months later, dad came home and I excitedly ran and hugged him, he hugged me right on back with a good squeeze. We had a party to celebrate him coming home, we had parry food and cake and all the usual stuff, I was just happy my dad was home though.\n\nA week or so later, dad sat me down with the other children and explained that Uncle Mark wouldn't be coming around anymore, when asked why, he just said Uncle Mark was a bad person and that if he ever tried to talk to us, we were to ignore him and come find one of them.\n\nWe all agreed because my dad always knew best after all.\n\nOne day, a year or so later (9 at this point), I'm coming out of school to wait for my parents to pick me up (my other siblings were either at secondary school or too young for school so it was just me) I see Uncle Mark stood there with a big grin.\n\nI get nervous when he comes up to me, saying he's here to take me for a ride, I tell him I'm not supposed to talk to him, that he's a bad person like my dad said.\n\nUncle Mark got this scary look on his face for a second, then told me it was all good and his parents had changed their mind and made to take my hand.\n\n... that's when I saw my dad just APPEAR.\n\nMy dad punched Uncle Mark right in the face and little old me saw blood fly as Uncle Mark went sprawling. I didn't see much after that except Uncle Mark running away with my dad chasing him.\n\nHe came back after a little while, sighed and took me in a hug. He told my mum to take me home and that he'd see us later.\n\nI don't know why, but I knew there and then it would be a long time before I ever saw my dad again.\n\nAnd I was right.\n\n5 years. \n\n5 years my dad was gone, my mum eventually admitted to us that he was in prison for protecting us and we all guessed he'd done something to Uncle Mark.\n\nAnd he had.\n\nTurns out Uncle Mark liked kids. He liked them a LOT.\n\nAnd that day I was meant to go to his house, my aunt (Uncle Mark's wife) had called my dad and told him she'd found some pictures under her and Marks bed of children and she was scared of what to do because Mark was a big man and it was later revealed he abused her so she was scared to call the police on him, and my dad had gone into a rage and stormed over to his house.\n\nHe'd smashed in the door to find Uncle Mark screaming at my aunt as she waved the pictures around in hysterics.\n\nMy dad had beaten Uncle Mark within an inch of his life, Uncle Mark screaming he'd make him pay as the police had arrested my dad.\n\nMessed up thing was, by the time my dad had explained WHY he had done it, Mark managed to get the pictures, burned them and scared his wife into saying nothing so there was no evidence. My dad was sent down for assault but made sure my other uncles and older cousins were around to protect us in case Mark came back.\n\nBut oh no.\n\nMark waited until my dad thought we were safe.\n\nAnd then, according to my dad, had come to kidnap me from the school right under their noses. Who would stop him? People didn't believe my dad when he explained Mark was a Predator, they thought he was just excusing himself for attacking him. After all, the police hadn't found anything and his wife said my dad was a liar, whereas my dad was the big angry guy with a few assaults under his belt already. So all they saw was my nice Uncle here to pick me up.\n\nHe HAD gotten away from my dad at the school, my dad had tripped and it gave him the chance to run.\n\nBut my dad knew where he would go.\n\nKnew Uncle Mark would run home to hide and more than likely destroy any evidence he had gotten since destroying the last lot.\n\nHe also knew the police would be on his tail for the attack on the school so he didn't have long.\n\nDifference was, though, my dad had his car while Uncle Mark was on foot.\n\nSo.\n\nHe drove over and demanded to know if my aunt was going to lie again, after what Uncle Mark had just tried to pull.\n\nNow. I don't like my aunt much after what she pulled the first time, but I think in that moment she really realised what a monster my Uncle was. He was willing to do this to her nephew just for pathetic 'revenge' for being called out as a Predator.\n\nShe said she wouldn't stop my dad or save Mark this time. My dad ordered her to get all the evidence she could as he waited for Mark to appear. She came back down with pictures. LOTS of pictures. He then told her to go, wait 1 hour and then call the police. He was ending this.\n\nAnd as Uncle Mark appeared, my dad, who had been waiting behind the wall of his garden, slammed him through the door of his house.\n\nAnd then proceeded to beat him to death in his doorway, he apparently towards the end couldn't see the floor through the blood.\n\nMy dad was arrested on murder and did so without resistance, only saying he wished they'd done his job for him. \n\nBut when it was revealed that Uncle Mark was indeed a Predator who had attempted to kidnap me and the fact that they had to face the fact they had allowed a Predator to run free, he was instead charged for manslaughter, his lawyer stating my father had 'gone into a protective rage and had only intended to render him harmless'. \n\nFunnily enough no one argued in defence of the Predator for my dad getting the murder charges. \n\nHe said he didn't regret it, but that he wished he had done something else purely so that he didn't miss out on so much of my life.\n\nI told him I was forever going to be proud of him for that, and that I loved him.\n\nI was a bit shocked I wasn't told just WHAT uncle Mark was for so long. But my dad asked if it would have made it any better to be told as a child what he really was, or now as a man who can handle the truth... and he was right. Me as a child would NOT have been able to mentally handle it... I'm barely able to handle it now.\n\nTLDR; My uncle was a Predator, dad found out and beat the stuffing out if him. Uncle tried to kidnap me in revenge and ended up dead.",
        "score": 7624,
        "id": "xzjiue",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/xzjiue/why_we_dont_see_uncle_mark_anymore/",
        "created_utc": 1665315451.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "My neighbors wanted to call a professional to mark their property line, my parents agreed",
        "selftext": "This was a long time ago but I remember it clearly. We moved in to a community with tight space in between our house and our neighbors, and we didn't like them being able to see into our kitchen. We put up a bunch of plants, costing thousands but my parents thought it would be worth it. A week later my parents awoke to the plants completely chopped down. My father was furious, and marched down to our neighbors house. He told my father the plants were on his property line, therefor he had total right to take them down. He warned that if anything were to go on his property again, he would report us to the authorities immediately.\n\nLater that day my father called the company that put in the plants, and with the warranty we could have them replanted next week for no charge. We made sure there was no way it was on our neighbors property. However a few days later we caught him chopping them down at 2am. We called the police upon obstruction of property, and after a chat with my neighbor he decided to call a professional and mark his property line. My father agreed.\n\nA few days later i got home to find orange tape in my neighbors yard. Apparently, his fence was 11 feet over our property line! We watched as he took down his fence, completely furious. Within the next month we were enjoying our new space and privacy in our backyard, and my neighbor ended up losing 1/4th of his backyard. My neighbor ended up having to pay almost 10k for the destruction of our property, and we got to plant our plants again.\n\nTl;dr My neighbor chopped down our plants because he claimed we were on his property, after calling a professional he lost 11 feet of his backyard and had to pay for destruction of property, and we got to keep our plants.",
        "score": 73092,
        "id": "bc2jye",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bc2jye/my_neighbors_wanted_to_call_a_professional_to/",
        "created_utc": 1555003280.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Boss said we MUST take lunch at 12:00. So we did",
        "selftext": "at my old job we used to have flexible lunch breaks at work. Could go anytime between 11:30-2:00, just made sure someone was covering. Worked fine.\n\nNew manager comes in, says \"Everyone MUST take lunch at exactly 12:00. No exceptions.\" Okay then.\n\n12:00 hits. We all just… walk away. Phones ringing, customers mid-sentence---not our problem. Boss looked panicked, trying to handle it all.\n\nBy the time we got back, it was a complete mess. Next day? New rule: “Lunch between 11:30-2:00 is fine.”\n\nOh, so back to normal? Cool, boss.",
        "score": 71116,
        "id": "1jg1v8p",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1jg1v8p/boss_said_we_must_take_lunch_at_1200_so_we_did/",
        "created_utc": 1742510419.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "You let him rape us, I set you up.",
        "selftext": "Also if the flare is wrong, sorry , Also TLDR at end\n\nEdit * the reason I put the sentences, that are right below this, is because I know myself, it’s sounds completely insane, and a few people will say its fake. Trust, there is no one on this earth that wishes it was fake, more than me. If I could go back, I would go the neighbors sooner, but my reality is that I caused the death of my mom. I had to mature very early. I became like a surrogate to my sister for those last three years.  I only wanted him to beat her up, he go to jail, and my mom get help. I never wanted her to die. \n\nFirst, this is a throw away account, I will not be replying to comments . Take this as you will, this is my story of my revenge against my mother and rapist \n\nFirst our father passed away 4 years before all this started. Car crash, Maybe our lives would have been better, if he hadn’t died that day.\n\nAlso before I get into this, one thing you should know is, before this man came into our life’s, our mother was amazing. She was loving, supportive, and put us above everything. But she would soon replace us with her new man and her new meth habit. \n\nWhen I was around 9 and  my little sister 7, our mom started dating this man, let’s call him POS. POS was tall and weighed about 250 pounds. He had oily, brown hair and a face filled with sores . I didn’t like him from the start. He made me uncomfortable to say the least. \n\nA few months after they started dating, POS moved in to our house. Everything was ok for the first few weeks, I guess. Then my mom started to act funny. Staying up all night, not cooking us lunch or supper, not cleaning, snapping at us for no reason, and started hitting us. Our lives had been turned upside down by this man so quickly. \n\nThen one night he came into my bedroom, held me down and raped me. \n\nI was screaming and crying for my mom, begging her to come help me, to come save me please! And then I seen her. Standing in the door watching him rape me. My mom was just letting him do this to me. She was just watching, like she was looking at a TV or something.\n\nWhen he finished, and climbed off of me, he walked up to my Mom, kissed her, and walked away with her. My mom just left me, crying and bleeding. I was just raped and she allowed it to happen. Not long after they walked out, I hear them having sex in the living room. \n\nIt was my 10 birthday. Happy Birthday to me\n\nA couple of nights later I hear my little sister crying. I get out the bed to find my mom standing in her doorway. I run to the room to try to help her, and my mom sees me. She backhands me across the face, making me slam against the hallway wall. I can hear my sister crying and begging. With no one coming to help her. That day, that was the day, I started hating my mother.\n\nThe rape and abuse went on for 3 years. I didn’t know at the beginning but soon found out, POS had gotten my Mom using meth. POS and meth were the only important things in her life. My sister and I were nothing more than his play toys. \n\nI soon started noticing them arguing more and more. About who got more hits, this one was stashing from the other one, and you smoked the last of it all by yourself. This is when I started planning my revenge. I noticed after about 3 days they would finally pass out. And would sleep for almost 2. And their bag of meth, would always be on the bedside table, beside POS. \n\nI know most would ask “why didn’t you call\nThe police, or child welfare?” Because jail wasn’t enough. He might have raped us, but she betrayed us. She turned her back on us. And I wanted revenge and wanted her to suffer like we had.\n\nSo every chance I got I would move the bag, just at first. Make it looked tampered with. Then I started taking it from the bag and placing some on my mom’s table. These things alone cause a lot of fighting, they started getting physical. I would keep my sister and I out of sight when this went on. And they never lasted long. Well I continued to do this over a couple of months, taking more and more, flushing it, or dropping it down the sink. Until the last day. The last day I took the whole bag. It’s was a good amount, they had just “re-uped” like they would say.\n\nI flushed the whole bag. And locked my sister  and I in my room, and quietly prayed, that they didn’t realize it was me. I am not sure how long after I did this, that everything started. But We had watched like 3 Disney movies before they finally woke up. And then I heard him start yelling about his missing bag. \n\nThe yelling got louder and more intense, then I heard the breaking of objects. It was starting to getting bad now. I hear my mom go from angry to scared. I hear him hitting her, her begging him to stop. Swearing she didn’t touch it. He continues to hit and she continues to beg, begging him to stop hurting her, begging someone to come help her. Begging like we begged her for so many nights. \n\nMy sister started asking to leave, she was scared, and crying. I open my window, put my sister outside and followed. We ran to the neighbors and told them that POS was beating our mom.\n\nThe neighbor called the police and brought us inside. And we watched as the police pulled up to our house. Start to walk up to the door, stop for a second and then started yelling police,and kicked the door open. \n\nAfter what felt like forever, we see POS being brought out to the police car. I wait to see my mom follow, but she doesn’t. I see an ambulance pull up and the paramedics run in the gurney. A short time later I see them rushing back with my mom.I catch a glimpse of her once beautiful face, now looking like ground meat. Her face was solid red, covered in blood.  \n\nShe ended up dying on the way to the hospital. \n\nI never planned to have my mother killed. I just wanted her to feel the pain we had been feeling for these last years. And I guess in the end she did. She felt the pain and terror we felt every night for the last 3 years. She just felt it all in one night. Do I feel bad about what I did, no, I don’t. If I didn’t do what I did, we would have been stuck there, being raped and beaten everyday until one us would have died. \n\nPOS was convicted of second degree murder, possession of drug paraphernalia (I flushed the actual drugs) child pornography, (pictures of us) and 23 counts of aggravated rape and 17 counts of aggravated rape against a person under 12 years of age. That last one is a death sentence where this all happened.\n\nWe moved a few states over, to be with our Dads parents, we hadn’t seen them in almost 4 years, and for the first time in a long time, we actually felt safe.\n\nMy sister, still to this day, doesn’t know what I did. Doesn’t know that I played a big part in our mom’s death. And since we never talk about either of them, it never comes up. We are both happily married now.  I have 3 children, she has 2. Both of us are active members of our PTA. \n\nNo one looking at us today, would ever guess, the hell we went through. Or what I did to get us out of it.\n\nTLDR: our mom allowed her boyfriend to rape us for 3 years, they were hooked on meth, I made it look like mom was stealing it, to make them fight. He ended up beating her to death, I didn’t want her dead, that wasn’t my intention. He is jail, and my little sister and I are finally happy",
        "score": 7578,
        "id": "bi10t8",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/bi10t8/you_let_him_rape_us_i_set_you_up/",
        "created_utc": 1556383937.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Ex-husband ghosts ex-wife, racks up a huge bill. He clearly didn't think things through.",
        "selftext": "(My compliance was malicious for the ex husband) I'm working in the billing queue in a call centre for one of big three telcos, and a client calls in regarding a billing concern.\n\nThis lady calls in, is puzzled by why she got charged a one time fee $49 for a wireless access point(it's gen 1 equipment for wireless set top box's for Optik TV).\n\nShe's even more puzzled, why would she have that charge when she doesn't have TV services from us. And I inform she does, it stared more or less a month ago. She's disputing that because Optik TV isn't available in her area. Now I'm confused. She lives in a small town and there's no Optik TV there. I do a little digging and find out that someone (no ex hushand) was still her on account and got 3 year contract to get a free TV for Optik TV and Internet.\n\nShe begins to cry on the phone and tells me her now ex-husband had an affair with a younger woman, divorced her, milked her for as much as he could and apparently still is milking her for more. He totally ghosted her. Moved to Alberta, changed his email, phone number, blocked her on all social media, etc. \n\nIn my mind I'm like, what a dickhead. And I'm like, well I'm sorry if you cancel the services you're on hook to pay for cancellation fees and so on. I can tell her though, I can remove his access to your account and you can also add on a password, downgrade the internet and tv to the bare essentials and I can attempt to to redirect the TV gift from his address to hers but there's no guarantee as it's been processed already. \n\nI can hear the light going off in her head. \"Wait, what? You have where he's living at now?\" \"Why, yes. He's got TV and Internet services so there's a service address.\" \n\nShe goes really quiet, says her lawyer & herself have been trying to track him down but his family and friends are being tight lipped about it. \n\nShe asks if I'm allowed to give that info to her. I smile and reply, this is your account. You have unrestricted access for service address, phone numbers, emails that your now ex-husband provided to us to get hooked up. She asks, that I can give her his new address, his new cell number(and the 2nd number left on the account, presumably the new woman) and contact info over the phone right now. I asked if she had a pen and paper handy. She was so ecstatic. And after giving her all the details from her account regarding the 2nd service address, downgrade everything, and he was a hockey fan and there was a game playing right now with his team, so I wish i could of been a fly on the wall when the game cuts out and he calls in to ask wtf and discovers hes been removed, and there's an account PIN and he's been discovered by his ex wife and lawyer.",
        "score": 69290,
        "id": "tbta7d",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tbta7d/exhusband_ghosts_exwife_racks_up_a_huge_bill_he/",
        "created_utc": 1647014544.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "I didn't go Nuclear, I went Super Nova.",
        "selftext": "This is my first post on here, so please bare with me. \n\nJust a little background to start off. I was an exterminator for better than a decade, and was only a few credits shy of a degree in entomology. Needless to say, I know my stuff when it comes to anything one might consider creepy and/or crawly. \n\nWith all this being said I was a specialist for the absolute worst kinds of infestations. I treated for bed bugs, small cousins to ticks that only drink human blood. \n\nI bet you think you know where this is going, and just to cut you off, no, I never intentionally infested anyone. In fact the revenge in this story isn't even for me. It was for what turned out to be one of the sweetest women I have ever met. For the purpose of the story we are going to call her Mary. She was a nurse in World War 2.\n\nI was called out to Marys home by the management of the subsidized apartments she had complained about a \"small bug issue\". What I found when I got there was not a small bug issue, and still haunts me a little to this day. When Mary answered the door she was covered in bed bugs. Her hair, her clothes, even crawling on her hands. Without going into too much grizzly detail about insect biology, this isn't normal. Bed bugs don't like touching human skin, and they don't hunt when people are up in moving. That is why the bed is the most prevalent place to find them, and thus the name. \n\nI immediately called an ambulance, waited on them to arrive and warned them about the very real possibility that anywhere they took her would be in sever danger of being infested if they didn't do something to decontaminate her. The poor woman was suffering from anemia, and it was luck of biology that she hadn't gone into toxic shock from the number of bites she had received. \n\nWhen she was rushed off, after having to be hosed off, literally sprayed with a hose, and having her clothes taken from her in semi private, revenge mode started. Bed bug treatments are expensive, very expensive, and I had made a lot of contacts with local Department of Social Services, and the Adult Protective Services because of the amount of charity of work I had done. Every single one of them got a phone call. Subsidized apartments have rules, including that they have to make routine checks. For an infestation to get to that level, it had gone unchecked for years. She had been being eaten alive, for years. \n\nI called the local news, warned every neighbor, and collected statements about exactly how often the maintenance staff and management had entered the apartments. Once DSS and APS was done, I urged every single person who was put in jeopardy of infestation to file civil suits, and recommended a lawyer I had done some work for in the past. He was more than happy to take the cases as a class action suit. By the end, I had the manager of the apartments arrested for elderly abuse and neglect, and the entire staff from the top down fired. They had been falsifying paperwork saying they had been inside the apartments, performing routine maintenance, and generally scamming the government for services they didn't actually provide. \n\nI visited Mary for a while after that, checking in since it didn't seem anyone else had in a long time. She was a wonderful person, and she never deserved to have to live like that. Her health recovered for a while, but time eventually came for her. Ill never forget her, or forgive the people that allowed it to happen in the first place. \n\nEdit: Thank you all for the amazing feedback on this story. I never thought it would take off the way it did. And a special thank you to whoever gave the silver and golds. \n\nEdit 2: Yes, I now know there is a category for supernovarevenge. Thanks for letting me know",
        "score": 7535,
        "id": "ay7m8x",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/ay7m8x/i_didnt_go_nuclear_i_went_super_nova/",
        "created_utc": 1551926949.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "I wore a suit to work and got my supervisor soft demoted",
        "selftext": "I’m posting mainly because I’m not a passive-aggressive type and I’m in disbelief that this actually worked.  \n\nEver since I started at my job a few months ago, my supervisor—we’ll call him Josh—has been micromanaging me. When I’m the subject of criticism (which is often), I try to give him the benefit of the doubt and ask him to clarify. What are your expectations? What specifically should I have done differently? Josh’s responses are always vague, often something to the effect of “Just do better.” I even had a meeting with Josh and HR to address this, but to no avail.\n\nYesterday, Josh comes to my desk to tell me I need to dress better. Now, I work at a small company, and the vibe is unusually casual. A not-insignificant number of people come to work wearing jeans, hoodies, t-shirts, and/or baseball caps. I have never worn a hat to work, and I make a point of wearing a button-up shirt with a collar every day. This particular day I was wearing a long-sleeve button-up flannel, chino pants, and Adidas gazelles. Other days I wear loafers and dress shirts that are tucked in.\n\nSo, I ask Josh to clarify. Should I be wearing dress shoes? Dress shirt? Tucked in? What specifically do you want me to change? Josh tells me I just need to dress better and that I should talk to HR for clarification. So I go in to HR and ask, what is the dress code? I get a standard answer: pants, close-toed shoes, no sleeveless shirts, etc. I ask, have I ever worn anything to work that poses a problem? HR says no, you’re fine.  \n\nBecause I’m mad, and because my repeated efforts to resolve this kind of problem had gone unheeded, I decided to be petty. The next day (today), I showed up to work in a full suit. It’s one I keep for events like weddings, so it’s fitted and I look really sharp in it. It’s also wildly and conspicuously overdressed for the office I work in. I had several interactions with people coming to my desk to comment on my outfit and ask what the occasion was. When anyone asked (only if they asked), I told them I had been told to “dress better.” This was always met with disbelief and incredulity. Two people even said they like the way I dress normally. When anyone asked me who the order came from—again, only if they asked—I told them it came from Josh.  \n\nI was expecting to pull my little stunt for a week just to prove a point, and then go back to wearing what I had been wearing before. Word got around the office fast, apparently, because the CEO (Josh’s direct boss) came to my desk later in the day to tell me I would be reporting to him now, and that he’d be having a talk with Josh about this and other issues. It’s important to note that I was Josh’s only underling, so he effectively went from being a supervisor to just a regular employee. I’m on a bit of a high now, I think I’m going to come in to work tomorrow wearing a different one of my flannels!\n\nEdit: This blew up! Thank you for all the support. No, this isn't AI and I didn't use ChatGPT to edit for style or grammar. I genuinely like em dashes and I use them regularly in writing—I promise!",
        "score": 68473,
        "id": "1kay4hv",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1kay4hv/i_wore_a_suit_to_work_and_got_my_supervisor_soft/",
        "created_utc": 1745958674.0
    },
    {
        "subreddit": "NuclearRevenge",
        "title": "Ruined a marriage and my family for revenge",
        "selftext": "So I recently discovered this sub and had a personal story to share. On mobile so forgive formatting/grammar/etc. story is several years old\n\nI’ve always been the black sheep of the family. Cousins grew up to be doctors, professors, creatives and whatever else. Meanwhile I’ve managed to just make a humble stable passive income through some business decisions, nothing fancy but I can afford a one bedroom in nyc and live comfortably with that and a part time job in a cafe. \n\nEveryone in the family including my own parents judge me harshly for not “pushing myself to do what my cousins do,” especially my one cousin we will call Randy.\n\nThink the stereotypical dude bro who got rich thanks to working for his dad, multiply that by ten, and you got Randy. Anyway, he always gave me the most shit, and eventually I just tuned them out cause I get to enjoy my life with my SO, work part time and still afford what I want.\n\nSo, to cut the bullshit short, Randy has a wife and two kids, he also had a mistress. I found this out cause one day when I was walking through the city when I saw him walking down the street with a woman who clearly wasn’t his wife, arms around each other. I checked Facebook and saw he had indeed posted about visiting a bagel shop in the city while on a business trip that morning so we head indeed in the city. So, I decided fuck it, let me see how this plays out.\n\nI followed them for five hours, snapped several photos, one of them going into a hotel together. I held onto these and waited until Christmas that year, about 6 months later.\n\nI decided to unceremoniously drop printed photos in front of everyone at the table before dinner and made sure to get his wife to see them. Queue screaming and fighting, I actually got a black eye out of it. It was Randy’s dad who did it though not him. Queue police, a lot of questioning, my SO and I get kicked out, we head back home after talking to the cops one last time.\n\nThe aftermath:\n-Besides Randy’s wife and another cousin who hates Randy, my family cut me off entirely for several years. Whatever, even my parents had always expressed disappointment in me for not applying myself fully so no real loss there.\n\n-randy got divorced \n\n-lost full custody of the kids after threatening his ex\n\n-family occasionally tries to guilt my into apologizing but my response is some variation of “not gonna apologize for outing a cheating cunt” and I’m promptly blocked for another few months.\n\n-so and Randy’s ex wife are good friends and the kids call me uncle, nic having a family who actually loves me unconditionally for once\n\n-so and I got married and that’s when my family last tried to get into contact with me and were actually nice for once, seeing me moving on I guess eats at them idk. Maybe realizing their punching bag is gone for good.\n\nThat’s it really, living my best life now with a good family as opposed to a shit one.\n\nEdit: first, thanks for support and awards\n\nSecond, a bunch of y’all seem to think being abused is not traumatic or bad as several comments seem to be saying “wow you’re a bad person for having a negative reaction to abuse and not handling it like a golden human being”\n\nSo I’ll clarify, the comments about my wasted potential weren’t just “oh your cousins a doctor what about you?”\n\nThey were “I can’t believe Randy just sealed a deal for x amount of dollars, are you still working at that shitty cafe? Are you still saying what’s her name? The girl with the pudgy stomach? Aren’t you ever gonna do anything with your life? I’d feel so worthless living like that.”\n\nThose are the nicer ones. The worse ones include being told that it’s better I didn’t try as I wouldn’t amount to anything and other such things along those lines as I really don’t care to remember the more toxic lines. \n\nI’m not interested in judgement, go post on aita threads if you want to say your piece about that, but don’t fucking tell me that I wasn’t an abuse victim and wasn’t treated horribly by my own family just cause I didn’t spell out the nitty gritty details.",
        "score": 7510,
        "id": "r1gwqe",
        "url": "https://www.reddit.com/r/NuclearRevenge/comments/r1gwqe/ruined_a_marriage_and_my_family_for_revenge/",
        "created_utc": 1637792723.0
    },
    {
        "subreddit": "MaliciousCompliance",
        "title": "Kentucky passes law that all schools must have \"In God We Trust\" displayed. School district complies.",
        "selftext": "\"The new law is required as a result of legislation filed by State Rep. Brandon Reed, a Republican minister from Hodgenville. It said in part that beginning in the 2019-2020 school year, local boards shall require each public elementary and secondary school to display the national motto of the United States, “In God We Trust,” in a prominent location in the school.\"\n\n\"Fayette Superintendent Manny Caulk said Wednesday afternoon that in complying with the new law, “**all schools in our district have been provided a framed version of an enlarged copy of a $1 dollar bill to display in a prominent location**.”\"\n\nhttps://www.kentucky.com/news/local/education/article233993192.html",
        "score": 66502,
        "id": "gwkgqf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gwkgqf/kentucky_passes_law_that_all_schools_must_have_in/",
        "created_utc": 1591287167.0
    }
]